{"Microsoft Acknowledges Xbox One Disc Drive Issue http://t.co/M7AOx6sRkU": 0, "fashion lady: new image http://t.co/wqaEh2Ecz3 #fashion via http://t.co/qiQqBbpNxe": 0, "I liked a @YouTube video http://t.co/R7Xo7xe33U GS News Top 5 - Good Guys Sony and Microsoft + does PlayStation \"define gaming\"?": 0, "@etsuukorin Microsoft being incredibly oppressive for the sake of earning money again": 0, "IBM, Microsoft, and Google are still getting crushed by Amazon in cloud computing http://t.co/Hk5sDVqN1U": 0, "#Tech Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/xnsyQg3Vze #Onlireeks": 0, "#Microsoft doesn't want you to swear at your #Xbox One: The Verge: The #Xbox One's Upload Studio is designed t... http://t.co/eKhdJATn0w": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives #news #tech #WP , http://t.co/WDPbVIO6Bn http://t.co/tfTEfyvVxa": 0, "Black Friday Ads from Microsoft, Big 5 Sports, Family Dollar and Hobby Lobby!: We have received the 2013 Black... http://t.co/SkNM8S0hU3": 0, "Microsoft releases PDF with all the Xbox One voice and gestures commands. Download here! http://t.co/mADFY6YdrK @xbox http://t.co/wFLQu9y083": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/ctWjfGmZLQ": 0, "RT @WindowsCanada: The New Windows: One experience for everything in your life. http://t.co/kN1bWN8RKL | http://t.co/GuqR5ByDqM": 0, "@HELLHOUNDGRIM Actually, you can't uninstall DirectX 11, but try this to reinstall 9.0c: http://t.co/mEQYpxoTtd": 0, "well I opened Microsoft Word, so I think that's enough work done to deserve a break. #seeyouintwohoursessay": 0, "Why 'One Microsoft' also means one Windows - for everyone #apple #ios #microsoft #xbox http://t.co/KsVHPX3NKu": 0, "@surface is anything ever going to be easy with #Microsoft? Is hard to recommend a product that is always almost there.": 0, "Dear @Slingbox, you need to team up with @Microsoft &amp; @Xbox to make an app for #XboxOne! Would be epic, please make it so. KThxBye": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/LcjhUBC04c #windowsphone": 0, "Xbox One: Microsoft is reportedly banning users from using Skype and Upload Studio for swearing.": 0, "Microsoft admits glitch with some Xbox One disc drives (via @news360) http://t.co/ZvxfGmvA2I": 0, "RT @IsraelLA: A Microsoft exec in Israel estimates that ~$13 billion in Israeli tech acquisitions have been done since 2012. http://t.co/L6": 0, "@ryandishman1 Sorry to hear that but the Microsoft account would just be a log in email address, do you not know that? ^AC": 0, "Trying to create a client database using Microsoft Access. Powerful software...but really whatevertheoppositeofUserFriendlyis": 0, "Catch up: @Microsoft confirms more than 1m #Xbox One consoles sold in first 24 hours http://t.co/nhaGgMp7s5": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console Bundle 2 Controllers Charger MW: $99.99 (0 http://t.co/obLkLIki6O": 0, "@haleyerin17 I think they're nice I just am not sure on the area I can send you it on FB so you can open up Microsoft and see them!!": 0, "Microsoft billionaire Paul Allen adds a $27 million home in Atherton, America's priciest zip code, to his collection http://t.co/NPcErkIWmd": 0, "In Pictures: Eight Ways To Make Money Online - http://t.co/SyyvKOI18Z": 0, "Microsoft sells over 1 million Xbox One consoles in 24 hours http://t.co/6y9gXxhrxg": 0, "RT @verge: Microsoft doesn't want you to swear at your Xbox One http://t.co/eeGjczyRyC": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/Rrt0Z7LdUg": 0, "Nokia takes page from Microsoft in new Lumia ad, goes after iPad's lack of physical keyboard: Competitors are ... http://t.co/XiAEH6ENzW": 0, "RT @globaltvnews: Microsoft admits some Xbox One consoles have faulty disc drives: http://t.co/5h0Lb9snL5 Have you had the same issue? #cdn": 0, "New xbox having problems with overheating and disc reading. Shock Microsoft cock up #TeamSony #PS4": 0, "Microsoft Windows at the theatre...a theatre full of nerds. http://t.co/AOY00KU1r7": 0, "Microsoft Xbox 360 13 GB White Console + 2 controllers and charging Dock: Price 199.99 USD (0 Bids) End Time:... http://t.co/t0YLCSqxOE": 0, "@iGamerZero24 Shouldn't have trusted Microsoft man": 0, "Microsoft Acknowledges Skype Messaging problem and promises to fix it. ~Ken http://t.co/h7DIOYPUFP": 0, "calling @Microsoft again to try and get my Office 2011 activated - this should be fun, right?": 0, "Microsoft Xbox 360 S with 4 GB Matte Black Console broken disc drive: Price 50.0 USD (0 Bids) End Time:... http://t.co/JRp3b1FG16": 0, "905 Brazilian Jiu-Jitsu: Getting ready for the Toronto BJJ Annual Decembe... http://t.co/4aEFnmAH7e via http://t.co/ABUaH7ML8Q": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $725.00 End Date: Wednesday Dec-25-2013 16:40:59 PST Buy... http://t.co/fV83qtLAlr": 0, "@MattHDGamer I'm sure it's not just cod , Microsoft have been having a lot of problems lately": 0, "RT @MSFTDynamics: Jump in and take it for a spin - http://t.co/b4NdZJkerh #CRM2013": 0, "RT @wpcentral: Microsoft responds to overheating on Surface devices - a firmware update is coming http://t.co/x9HqKHVwjT": 0, "NYLON: Icona Pop's new video has us dreaming of a Parisian vacation compl... http://t.co/4puMn7zXvd via http://t.co/qiQqBbpNxe": 0, "How To Publish WordPress Posts From Microsoft Word 2013? | My Blogger Tricks http://t.co/g62RBRLC8Y": 0, "Microsoft reaches a new low by having a pawn shop employee trash talk Chromebooks. Sad. http://t.co/Sa78HeqCXw": 0, "Microsoft Enlists Pawn Stars To Mock Google's Chromebook http://t.co/9pMdUHsMHi by @fredericl": 0, "@switcherMark good idea. but I think @Microsoft hung up on me. line is open but no sound": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/2HrX5oKhtf": 0, "I'm giving away: Microsoft Office Access 2003 Inside Out (Bpg-Inside Out) [Paperback]. Check it out - http://t.co/TboSly4cLr": 0, "Incredible artwork created in Excelyes, Excel!for our #GivingHero campaign: https://t.co/1rQyV23po3": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console - In Hand, Ready to Ship: $499.99 (0 Bids) End Date:... http://t.co/Y3XgI9AcwK": 0, "Options Flow Suggests More Upside for Microsoft http://t.co/G2SymPax9h  via @TheStreet": 0, "RT @ThinkingAlpha: Microsoft sells shirts and mugs slamming Google on privacy:  http://t.co/1gRVfhzwph  http://t.co/ETw1BG2Ec2": 0, "#LogicalDOC Introduces Microsoft Outlook Integration to Drive Greater Productivity for #SMBs http://t.co/rZ4hv7csDj": 0, "Microsoft responds to overheating on Surface devices - a firmware update is coming #news #tech #WP ,... http://t.co/hWwpLePsHa": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console (PAL): Price 90.0 USD (0 Bids) End Time: 2013-11-26 07:43:35 PDT http://t.co/z4EwQZafSy": 0, "Buddha's Birthday Could Be 100 Years Earlier Than We Thought http://t.co/yj4l10y2c5 via http://t.co/3cVMRz99nh #worldnews": 0, "Great #BigData resource: The largest hyperlink graph available to the public outside @Google, @Yahoo, @Microsoft http://t.co/9YThJjy333": 0, "RT @appleinsider: iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/IWjj5Of0EK": 0, "Wow @Microsoft, Xbox One can't handle TV (50hz) from anywhere outside the US properly and are monitoring #skype calls http://t.co/JYHyESEXdZ": 0, "I think @Microsoft @Xbox needs to come out with a handheld console.": 0, "Microsoft doesn't want you to swear at your Xbox One http://t.co/vcY5vs3YKe": 0, "\"@Bease11: If someone smarter from @Microsoft doesn't call me soon I'm gonna go ape shit.\" &gt;&gt;&gt; Rip it up CB!!": 0, "@surface @Microsoft With Touch or Type Cover 2 I think key lights should be turned off when the cover is folded behind the screen. Thanks.": 0, "Thales, Microsoft serve secure crypto in the cloud - ZDNet http://t.co/3kfZpJhaao": 0, "RT @MakeMoney140: In Pictures: Eight Ways To Make Money Online - http://t.co/SyyvKOI18Z": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console (NTSC): $100.00 (0 Bids) End Date: Monday Nov-25-2013 17:49:23... http://t.co/iWE6cNM5Qe": 0, "Microsoft responds to overheating on Surface devices  a firmware update is coming http://t.co/KwIKFolFN0": 0, "RT @jacekfrankowski: Great #BigData resource: The largest hyperlink graph available to the public outside @Google, @Yahoo, @Microsoft http:": 0, "Microsoft's device chief sees a future without three versions of Windows - http://t.co/Y0GDtKJtLd": 0, "@Bease11 @Microsoft The guys at Microsoft must be Giants fans.": 0, "Microsoft responds to reported Xbox One issues http://t.co/oAwDu7x5HY": 0, "RT @itzstephlew: @itzVickiLou: I think @Microsoft @Xbox needs to come out with a handheld console. Amen ": 0, "@WhipeeDip while Microsoft tablets are for people who are working for productivity. A physical keyboard? Why does the iPad not have one?": 0, "Microsoft supports lawsuit reform so it doesn't have to compile 60 million pages per case.. #tech http://t.co/s7jLtSSkMc": 0, "Snoop Dogg: tha funk comn in 2 weeks, pre-order ur copy 2day !! http://t.co/SSGEa2dqbD via http://t.co/lZ21fxpl5d #celebs": 0, "Xbox and Microsoft pissing me off. Im done with xbox i need a PS4": 0, "#Nokia jabs at the #iPadAir with a new ad for its #tablet http://t.co/faH5EOfPKb #Apple #Microsoft": 0, "Love Quotes and Sayings: new image http://t.co/DNJDGakq7E via http://t.co/gxktWhKfbI #quotes http://t.co/PejCGIzzGr": 0, "@Boogie2988 #Francis RT @verge: Microsoft doesn't want you to swear at your Xbox One http://t.co/fZFqTBTTsH": 0, "@kevinmorfis See, and not even all of Microsofts consumers. The consumers who could be getting xbox ones have gotten the absolute shaft.": 0, "@StefanPerales If you've got a moment, we'd love feedback on your experience with our support team: http://t.co/pLMAPiRm4E. Thank you! ^KM": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/EtVvbSiRfy": 0, "Investigating issues with App Insights Configuration management http://t.co/Tvve7p2RzB #microsoft": 0, "(Dealnews) Nokia Lumia 520 4G Windows Phone 8 for AT&amp;T Prepaid for $59 + free shipping: Microsoft Store offers... http://t.co/LGIVDjmsyk": 0, "RT @Office365: Weve been busy improving the Excel Web App.  Learn whats new during tomorrows webinar at 9:15am PST http://t.co/tpLzM7aoe9": 0, "Microsoft Launches New Anti-iPad Surface 2 Ad Highlighting Kickstand and Multiple Accounts: http://t.co/MewEhx6sDU": 0, "Want to learn more about RMS? Check out this video we created on the Microsoft RMS Sharing Application! http://t.co/T0JMFljGPE #TheNewRMS": 0, "Judo World: new image http://t.co/baFRcF6qtc via http://t.co/jDAwU42y28 #olympics": 0, "Use Microsoft Private Cloud infrastructure to lower cost of ownership by registering... http://t.co/PXvzv4uaTv http://t.co/T2v5bQlL17": 0, "RT @apple_live: [Mac Rumors] Microsoft Launches New Anti-iPad Surface 2 Ad Highlighting Kickstand and Multiple Accounts: Micro... http://t.": 0, "Despite NSA Crypto-Meddling, Microsoft Plans Office 365 Encrypted Email http://t.co/ETireP5rxh #ccureit": 0, "#Xbox One Could Break #Microsoft in Two: The #Xbox One is the first test of Steve Ballmer's \"One Microsoft Str... http://t.co/tqb6JbKZfk": 0, "Microsoft Xbox One (Latest Model) 500 GB Black Console - In Hand - No Preorders: $534.99 (0 Bids) End Date:... http://t.co/xpJoq9R3lY": 0, "@Microsoft_Zach what kind of jack ass would do that?!": 0, "http://t.co/zCYWgJ6lkT MICROSOFT ARE YOU FUCKING KIDDING ME AHAHAHAH": 0, "@iGamerZero24 @Smokeydogg7 Looks like Microsoft put the old bait and switch on you. #shameful": 0, "Zing! Microsoft just threw a major diss at Google. This could turn ugly folks! http://t.co/T4RAUwmPZQ": 0, "This @Bease11 saga with @Microsoft is quite entertaining! Get this man his Xbox 1!": 0, "Supporting registration for 'powering Women in Business #PWIB13 #Peatix #women #business #microsoft #starhub http://t.co/Rz7PK4tIqs": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/MhQbBBXi5m": 0, "Love is when u see the imperfections of ur partner and thinking its cute, #sayquotestters-microsoft-with-imitation  :p": 0, "Excited to be attending the Powering Women in Business Conference #PWIB13 #Microsoft http://t.co/5fejPcZb0D": 0, "Microsoft doesn't want you to swear at your Xbox One http://t.co/Ag1pMLHx53": 0, "The whole \"ecosystem\" thing for Microsoft clearly working with Xbox One. Downloaded Skydrive on my iOS devices to view my Game DVR clips...": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft:  Its been ne... http://t.co/ZPvPahy1EE": 0, "@thisgirlrox Surface 2 is available here - http://t.co/pLikPJn1TS Is this what you needed? or Surface 2 Pro?": 0, "@itzVickiLou: I think @Microsoft @Xbox needs to come out with a handheld console. Amen ": 0, "@sadstagram: my sister discovered templates on Microsoft word today ???? http://t.co/zmUMcDHwdy": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft:  Its been ne... http://t.co/6czKWAzqYR": 0, "RT @Kaptain_Kenneth: @iGamerZero24 @Smokeydogg7 Looks like Microsoft put the old bait and switch on you. #shameful": 0, "Photo Model Network: PMN Photo of the day 11-25-13 http://t.co/lpjo8kFnTV #fashion via http://t.co/PEiph2vUXV http://t.co/3dxE0ae4US": 0, "Why Microsoft Word is garbage http://t.co/FJZNvrRXrh": 0, "Microsoft responds to overheating on Surface devices  a firmware update is coming http://t.co/jkjWL4wuz4": 0, "@UncleAggieTV I have seen no one complain about the Online everyone loves the PS4 that is not a microsoft fan boy.": 0, "How Microsoft Lync capabilities measure up in the marketplace http://t.co/y7APl8V5YO": 0, "Microsoft promises to fix Skype | Mobile - CNET News An Opinionated Commentary on Technology http://t.co/UucSAyVU0v": 0, "Infosecurity - Despite NSA Crypto-Meddling, Microsoft Plans Office 365 Encrypted Email http://t.co/SgapR9U9Fu": 0, "HP private cloud service leads the pack, followed by Cisco and Microsoft ... - Network World | @scoopit http://t.co/QrMNDv54Ed": 0, "Great story! Mascot on the weekends, Microsoft employee during the week. Meet the man behind Blitz, the mascot of thhttp://t.co/CA0W1SCNso": 0, "New post: Analyst Upgrades: Microsoft Corporation, J.C. Penney Company, Inc., and Caterpillar Inc. http://t.co/Iz3ZzPjDS6": 0, "Microsoft responds to overheating on Surface devices  a firmware update is coming http://t.co/a2uakRPwHS": 0, "X bone (@ Microsoft Specialty Store - @microsoftstore) http://t.co/bOxd64ZBT8": 0, "RT @RWHII: Microsoft went down 3 points. #WeisGuysLiveTweet http://t.co/DrGMX0NUCl": 0, "@Bease11 @Microsoft you're Cole Beasley this shouldn't stand!": 0, "eBay's auctioning a panel from #ForzaFilmSpeed signed by @TannerFoust and Jeff Zwart. Proceeds go to the @wwpinc! http://t.co/XGCksAIDIR": 0, "Xbone looks the exact same as 360 and you can't even play 360 games on it. No way nice try Microsoft #360forlife": 0, "Surface 2 vs. iPad Air: Microsoft Launches Two New Anti-iPad Ads [video] http://t.co/NFEM17ZYX6": 0, "Sundance Channel: When we say Judi Dench, you say ______?\n\nSee her in toni... http://t.co/PGPQ3YenN5 via http://t.co/tXjObGiDiU": 0, "RT @Viviansummers: XBox One: Microsoft's Disappointing Answers: http://t.co/2puoKXI0TF via @youtube you don`t won your bought games you ren": 0, "Extra Deal : Nokia Lumia 520 4G Windows Phone 8 for AT&amp;T Prepaid for $59 + free shipping: Microsoft Store offe... http://t.co/UDgCf9hNnd": 0, "RT @arstechnica: Microsoft: Very small number of Xbox Ones have disc drive problems http://t.co/yqJd90YsqZ by @KyleOrl": 0, "@nicker_bockers @CaitlinR_Adkins scared": 0, "Microsoft... is this some kind of cruel prank?! http://t.co/SjV8TaoBo9 via @youtube": 0, "Microsoft went down 3 points. #WeisGuysLiveTweet http://t.co/DrGMX0NUCl": 0, "Here are some astounding Wallpapers From the Artist CygX1 http://t.co/0PByS9KQdk": 0, "Microsoft squeezes only about $28 of profit out of each Xbox One http://t.co/3RJejGPWWM": 0, "Tech Moves: Katie Couric joins Yahoo; Shakeup at BlackBerry; Crosscuts Shaw returns to Microsoft http://t.co/07JU4UUEdT": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/lrRR4km7f6": 0, "Beginning Windows 8 and Microsoft Office 2013": 0, "Fixes coming for #skype #messaging on #Windows_Phone; improved device syncing also in th http://t.co/MnKP9TlUwj #messaging #microsoft #": 0, "@JClishe I wasn't able to find this info. You can try posting here http://t.co/LZUVIDHGzv or contacting our @XboxSupport team. ^KB": 0, "Microsoft may unify Windows Phone, Windows RT in the future http://t.co/ELZrrkODgI": 0, "RT @HBSAlumni: #HBS alumni on the future of Microsoft, http://t.co/i0Ns5b2Sfk  @HarvardHBS @HarvardAlumni @TheHarbus": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $550.00 (0 Bids) End Date: Thursday Nov-28-2013 15:33:16... http://t.co/a79PCwEwHi": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/3GDCwZ2IoY": 0, "Today, MSN Messenger is no more. After 14 years, Microsoft have closed the once popular instant messaging service. R.I.P.": 0, "2 - Microsoft Xbox One 500 GB Black Console NEW SEALED RECEIPTS INCLUDED: $1,300.00 (0 Bids http://t.co/sM5kznjCZz": 0, "RT @bdsams: Blackberry fires CEO, hires Elop, burning platform memo, converts to Windows Phone, Microsoft buys out BBRY, Elop swims in cash.": 0, "And, of course, if you're deploying a new #MSExchange 2013 org, or upgrading from 2010, check out http://t.co/CqOUR41kd5": 0, "Microsoft confirms more than 1m Xbox One consoles sold in first 24 hours - Digital Life - Digital Life http://t.co/Hn4aHkA8nk #paperli": 0, "I'm giving away: Microsoft Office Access 2003 Step by Step (Step By Step (Microsoft)) [Paperback. Check  http://t.co/aegKJCPVof": 0, "@KMxRetro After activating your product on your account, were you able to log in here http://t.co/EceNq1iZHX ? ^RZ": 0, "Help UCLA game design students better game design by using this link: http://t.co/rNWFQMyDxL #Win8 #FunApps": 0, "Funny or Die: A Very Cosby Thanksgiving http://t.co/3lQP1qV1na via http://t.co/3cVMRz99nh #worldnews": 0, "#joemacintosh Microsoft releases statement on faulty Xbox One Blu-ray drives: All launches of new technology are... http://t.co/UMr924faIW": 0, "Alan Mulally's extended dance with Microsoft leaves Ford in an unwelcome state of limbo http://t.co/TXdSwtrgIf": 0, "RT @abeolandres: Just bought an XBox One from http://t.co/bdKT7uOLCY using #GCASHAMEX this #GCashBlackFriday sale season! Can't wait to get": 0, "RT @TheEconomist: Nokia, once the world's biggest mobile-phone maker, is reinventing itself. Again http://t.co/jwP37Cc1cK": 0, "#Tech Microsoft responds to overheating on Surface devices - a firmware update is coming http://t.co/8qbiT1fyB9 #Onlireeks": 0, "USA Water Polo: A bunch of schools won CIF Championships this weekend, in... http://t.co/5wwRFrcgi3 via http://t.co/jDAwU42y28": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/LpktxoMFg2": 0, "RT @Polycom: 14 Best Practices for a smooth #Lync Deployment http://t.co/60N4Ao8jM1": 0, "GSA looks to trim Microsoft product costs http://t.co/sqbjmkoS52": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/keV6fXMKBq": 0, "Check out \"AIMS CORE CPR \" on Vimeo http://t.co/0RYu0U9Y3e #Vimeo #aims #microsoft #cpr #training #simulation #games #medical #evms #simis": 0, "@jaredcarter_ Exclusive bullocks. What an excuse at making corporate expenses happy. Cough, Microsoft.": 0, "Microsoft acknowledges Xbox One problem with disc drive: *The issue affects 'a very small... http://t.co/7YxNkeVh9Y #xbox #x360 #xboxone": 0, "@StevieAmazin @sp1d3r_ownz @Microsoft I'll even do it a couple more. @Microsoft @Microsoft @Microsoft @Microsoft @Microsoft point proven?": 0, "Nokia takes page from Microsoft in new Lumia ad, goes after iPad's lack of physical keyboard http://t.co/23RCBOvFZn #appleinsider #TFB": 0, "Microsoft kinetics crm introductory phrase in contemplation of improving personage relationships: bXFH": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/uGWuKJj5JR": 0, "Microsoft Xbox One bans swear words http://t.co/hr7IGx8wkz": 0, "#Tech Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/ClhUsokPSn #Onlireeks": 0, "RT @PizzaCube: @ManaByte Now I know what that anti swearing patent tech was for a few years back. http://t.co/wm80Jm6Mo7": 0, "@Bease11 @Microsoft before you go ape shit...are you using your same username as before?": 0, "Mulally's Extended Dance With Microsoft Isn't Fair To Ford http://t.co/dC8MhC3S0M": 0, "Microsoft's device chief sees a future without three versions of Windows |  http://t.co/E0yyHxSWke": 0, "@EquitumLoL Need something from the Microsoft Store since my homie has gift cards. =[": 0, "yay first blog post in a while, http://t.co/MIRMGjwV8j Thanks @troyhunt  for live writer hit up. Just need to find a syntax highlighter": 0, "@StevieAmazin @sp1d3r_ownz @Microsoft yes that's exactly why i did it captain obvious.": 0, "Thank god for Microsoft word": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/zwro6YKKCP": 0, "Photoset: thefrogman: Every Pixar movie summarized in terrible Microsoft Paint drawings By Matt Bellassai... http://t.co/QMafcKonNo": 0, "RT @GoJolla: @jpetrise @jukkaeklund People know why they will avoid @Microsoft devices. @Nokia isn't Nokia anymore for like 3 years. #Whori": 0, "Microsoft affidavit midterm, comptia an other ccna exchange of views: essentials vice programs differently coac...": 0, "RT @LMAOComedyPics: That awkward moment when Microsoft Word informs you your name is spelt wrong. http://t.co/Prd6w0fPjX": 0, "At the Microsoft store. This is torture. #XboxOne http://t.co/WsoNppm1be": 0, "So 'Microsoft AppFabric 1.1 for Windows Server', has it had its day? Do we need to wait until Azure worker roles/worklow join SB on Svr2012?": 0, "UCLA game design students in learning how to use feedback from players, use this link: http://t.co/RkYXChFK0U #Win8 #FunApps": 0, "#LightSwitch Screen templates - implement custom #JavaScript components and not have to write any JavaScript... http://t.co/idDvdHz5Qt": 0, "MMA Fight Club: Our Graphix Designer with the Domin8tor! http://t.co/hNMbz3CaML via http://t.co/ABUaH7ML8Q #mma http://t.co/dLpwrizHnM": 0, "RT @Jamezzy: RT @Krunkanomics: I know I will have made it when my name is recognized by Microsoft. // or simply select \"at to Dictionary\" l": 0, "Xbox One sells 1 million units in first 24 hours: According to Microsoft, their new gaming system, Xb... http://t.co/BtielQ4XZc #XboxOne": 0, "Working for Microsoft University Roadshow. (@ National University of Malaysia (UKM)) http://t.co/woLkTPpEiZ": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/wwLpekhijI": 0, "@sp1d3r_ownz I would get both but I kinda don't like @Microsoft": 0, "Funny jokes &amp; pics: new image http://t.co/rld3ZEXTQ8 via http://t.co/fnTDKnNbKt #funny": 0, " http://t.co/gfOPZLgYVK 848 Office 365 | Microsoft's Office 365 Gets Encrypted Emails From Early 2014 | Wollongong | AUS | New South Wales": 0, "Microsoft Promises to Fix Skype Messaging on Windows Phone http://t.co/3iYohLAmhG": 0, "@podfeet @Microsoft You should record it!": 0, "@WWEAJLee which will u buy of the following; Microsoft @Xbox One, @SonyPS4 , and/or will u buy the Nintendo Wii U?": 0, "Another awesome zombie #pr stunt!- Microsoft brings the zombie apocalypse to Vancouver: http://t.co/s18fwsNMcX thanks for sharing @m_bucher": 0, "Took it bloody long enough over 7 hours! But i finally have microsoft office 2013, error after error finally! http://t.co/RCv9q3i65b": 0, "Sitecore acquires http://t.co/ketjKSArFS http://t.co/kkuJKJZBvk": 0, "RT @Emi1yRogers: Microsoft admits Xbox One disc drive glitch http://t.co/aOwm0NuIou via @YahooGames": 0, "Here are some Celebrity Pencil Drawings from Various Artists See: *** http://t.co/1ImoLWlR7r": 0, "@I_X51_I Seems like Microsoft didn't want them to use that option. You can't compare iTunes to drm &amp; online check-ins.": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/IC036OxPBP": 0, "Microsoft 78-702 tripos: SOB": 0, "RT @ForbesTech: Alan Mulally's extended dance with Microsoft leaves Ford in an unwelcome state of limbo http://t.co/jIIqIrGnf4": 0, "#Tech Microsoft Promises to Fix Skype Messaging on Windows Phone http://t.co/BsPNl6ll7I #Onlireeks": 0, "I wanna play euchre rn": 0, "Tech News - Microsoft acknowledges Xbox problem with disc drive http://t.co/DxJbQLVnPm": 0, "RT @ForbesTech: Are the Xbox One and PS4 yesterday's gaming tech? http://t.co/AAiYH6Fbhl": 0, "Microsoft doubles down on iPad bashing with a pair of new Surface ads http://t.co/YN7ayLzc4j": 0, "@Bease11 @Microsoft Did you try tweeting @XboxSupport they are really helpful": 0, ".@SGNewsTeam Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's...  @orgasmicgomez": 0, "RT @VideoGamesFacts: Naughty Dog hires Halo 4 programmer Corrinne Yu. Yu is moving from one of Microsoft's top developers to one of Sony's.": 0, "@Microsoft @bing WhatTheBigIT is joining Microsoft in 2 weeks!?!?!?": 0, "New blog post - @Microsoft Urges #eDiscovery Rules Changes (but, they miss their part in the equation) http://t.co/xyU9d1KsnV": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft #news #tech #WP ,... http://t.co/oZxWyVV7yV": 0, "Microsoft Xbox 360 Matte White Console Red Ring (not working): Price 30.0 USD (0 Bids) End Time: 2013-11-26... http://t.co/oMjVzdCPvK": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/Cykket9x8J #Tech": 0, "RT @netzzwerg: Hi @Microsoft and @msdev can u pls fix the #JavaScript documentation @MSDN The code example is false and ugly. Thanks http:/": 0, "@Marly_1Love Ohh Sorry , I was deep in Microsoft typing work, Im sorryy :( .. What's popping love??": 0, "Microsoft 70-691 blue book seasoning paraphernalia: vscT": 0, "Report: Xbox One Upload Studio users temporarily banned for swearing (update: Microsoft responds) http://t.co/sNkonSw3WN via @Polygon": 0, "Xbox One hit by 'Disc Drive of Doom' fault: MICROSOFT admits hundreds of Xbox One consoles are experiencing Di... http://t.co/K5vHNzOpFS": 0, "Microsoft aims to whittle Windows variants on mobile  #business http://t.co/9K4JmGFTFC": 0, "Windows 8.1 Preview and a workaround for your favorite Win+S shortcut key #OneNote #Handy #Office #Windows8.1 http://t.co/31w4VudPLw": 0, "RT @4JStudios: .@stampylongnose We're working on ways to move Xbox 360 saves to Xbox One with Microsoft. Can't say it'll be there until it'": 0, "Microsoft IS Blocking Comments On YouTube and Twitter \n\nhttp://t.co/E8pOGIPs7F": 0, "Why Did Apple Just Pay $360 Million For Microsofts Sloppy Seconds? #apple\n\n http://t.co/nSVSpdy1si": 0, "Microsoft Xbox One Day One Edition 500 GB Black Console SOLD OUT EVERYWHERE!!!!: $100.00 (0 Bids) End Date:... http://t.co/8imbxGjX0n": 0, "@Bease11 @Microsoft Should of got a #ps4": 0, "Nokia Lumia 520 4G Windows Phone 8 for AT&amp;T Prepaid for $59 + free shipping: Microsoft Store offers the Nokia ... http://t.co/SE9gmFomZn": 0, "Microsoft Provides Advance Returns for Broken Xbox One Consoles http://t.co/h81Z455zb6": 0, "RT @daniel_bilar: @quentynblog As @0xabad1dea suggested, this is the paper: increase odds wrt to low density victims http://t.co/DXqKzHhBuP": 0, "RT @MrRobinson: Nokia 520 $59.00 no contract at microsoft store online http://t.co/KZT5BqTyCP": 0, "Microsoft Xbox 360 250 GB Black Console: Price 30.0 USD (0 Bids) End Time: 2013-11-26 12:48:54 PDT http://t.co/QMro6neMtB": 0, "RT @TheRMSGuy: Nice article from @lseltzer -- Thales, Microsoft serve secure crypto in the cloud. http://t.co/ZqiCRp8zqh #TheNewRMS #ZDNet ": 0, "Microsofts Xbox One sales top 1 million in first day: http://t.co/Iv2UDqYwRh  $MSFT": 0, "Original Microsoft Xbox Black Console System Bundle With 2 Controllers &amp; 6 Games: $59.99 (0 Bids) End Date:... http://t.co/k99hHxD3A6": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/7Juv3BoAIx #Tech": 0, "Please explain to me how neither computers in my house has fucking Microsoft word!!! ": 0, "Insanely Funny Shit: new image http://t.co/AKuWKLusMS via http://t.co/fnTDKnNbKt #funny http://t.co/3wHvI6bokP": 0, "Microsoft says it \"does not monitor direct peer-to-peer communications.\" http://t.co/CX95KOgmFW": 0, "#joemacintosh Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft:... http://t.co/iLwlkn6idD": 0, "Exclusive! Andy Dances with tWitch http://t.co/qRP3MJa892 #tvshows via http://t.co/tXjObGiDiU": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/pN4MyBBMiN": 0, "Tech Moves: Katie Couric joins Yahoo; Shakeup at BlackBerry; Crosscuts Shaw returns to Microsoft... http://t.co/MMCS0nidTI": 0, "Trying to use Photoshop shortcuts in Microsoft word. #fail": 0, "Photo: Tech Moves: Katie Couric joins Yahoo; Shakeup at BlackBerry; Crosscuts Shaw returns to Microsoft... http://t.co/2kLtQD7nK9": 0, "I'm at Microsoft retail store - @microsoftstore (Bloomington, MN) http://t.co/TuO4RntYh3": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/gDpCav0Q33": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/OKcww0OAGw": 0, "RT @syr_problems: Let's be real Microsoft Word, the universal font is Times New Roman 12 pt. How about we make that a default setting?": 0, "Cool! RT @Microsoft Mascot on wknds, #MSFT employee during wk. Meet the man behind @BlitzTheSeahawk @Seahawks mascot: http://t.co/O8nJ3CRZsT": 0, "Syrian children bearing brunt of violence http://t.co/7MLaSQGRFu via http://t.co/3cVMRz99nh #worldnews": 0, "Microsoft responds to overheating on Surface devices - a firmware update is coming http://t.co/ntKFGFNNLz": 0, "@TelegramJames your attacking their site with Microsoft DOS?": 0, "Sitecore acquires http://t.co/kR9EgYFQ7w http://t.co/vyvGtSC5XP via Perficient_MSFT": 0, "Useful Microsoft Word tools for academic work http://t.co/LSJf5huTvH": 0, "RT @whymicrosoft: Microsoft preps its mobile app for Office 365 admin. Learn more: http://t.co/2Rhffp7h5S": 0, "Microsoft responds to overheating on Surface devices - a firmware update is coming http://t.co/NnE7AXYjLC": 0, "@Bease11: If someone smarter from @Microsoft doesn't call me soon I'm gonna go ape shit. &lt;~ FIX HIS PROBLEM!!!": 0, "Microsoft Xbox 360 Pro 20 GB Matte White Console: $80.00 (0 Bids) End Date: Monday Nov-25-2013 17:35:09 PST Buy... http://t.co/jSrx9SIuNX": 0, "Photoset: thefrogman: Every Pixar movie summarized in terrible Microsoft Paint drawings By Matt Bellassai... http://t.co/nDxcSeRzfL": 0, "RT @verge: Microsoft backs lawsuit reform so it doesn't have to compile 60 million pages of documents for every case http://t.co/Onhrp7ZjTF": 0, "Microsoft Partners - Please read this as there are important changes to our MPN roadmap. http://t.co/wcMYtlTJqy": 0, "@TaylorBRobb Hey Taylor! You can check out the available retail store job opportunities and their requirements at http://t.co/v9WutoDYQZ.": 0, "Anybody a Microsoft word whiz?": 0, "Why 'One Microsoft' also means one Windows - for everyone - ZDNet http://t.co/zF1ECOrRUF": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/D4DhrxtmLB": 0, "Microsoft responds to overheating on Surface devices - a firmware update is coming http://t.co/PlBkPe9yQf #windowsphone": 0, "@stealthpuppy hey Aaron, you might be able to answer this one? It's doing my head in: http://t.co/lLKRTsCLsD": 0, "Life &amp; Style Weekly: ICYMI: We have the full list of AMA winners! Taylor S... http://t.co/WeUPGmHBK5 via http://t.co/lZ21fxpl5d": 0, "Microsoft Xbox 360 250 GB Black Console: Price 30.0 USD (0 Bids) End Time: 2013-11-26 12:48:54 PDT http://t.co/uoESyRmdDs": 0, "Radar Online: Inside Sandy Hook: \n\nState Of Connecticut Releases Horrific ... http://t.co/A5VE4X61YQ via http://t.co/lZ21fxpl5d": 0, "RT @eparacord: Microsoft declares war on cybercrime with new crime-fighting facility": 0, "Nokia Chairman Defends Stephen Elop And Decision To Sell To Microsoft via Ubergizmo - When Nokia ... http://t.co/lJMfAmhvRj": 0, "I'm at Microsoft Lounge - Featuring Win Phone and Windows - @windowsphone (Austin, TX) http://t.co/9Hs5nw7zI9": 0, "Great article on @blitztheseahawk and the fight against #MS - http://t.co/2684iwMxvV @seahawks #seahawks": 0, "Well. Is Microsoft running their Scroogle campaign because Google's transparency demands will hurt them?": 0, "Pardon me microsoft, for having a name so unique.": 0, "#joemacintosh Microsoft responds to overheating on Surface devices - a firmware update is coming: If you recently... http://t.co/AUYJ1W30Qk": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $410.00 (13 Bids) End Date: Monday Nov-25-2013 17:28:41... http://t.co/GU5O69s2hh": 0, "Cum i-a mpins Munchen-ul pe Steve #Ballmer i #Microsoft afar din ora? http://t.co/iIPLdF7zHh #gnu #linux #munchen #munich #romania": 0, "Microsoft responds to overheating on Surface devices - a firmware update is coming http://t.co/qPuZnOGNQe #Tech": 0, "Microsoft Xbox 360 Matte White Console Red Ring (not working): Price 30.0 USD (0 Bids) End Time: 2013-11-26... http://t.co/U2w4coFLPq": 0, "Will New #Microsoft CEO Get Rid of the #Xbox? http://t.co/C9MotbQtDF via @wallstCS #msft": 0, "Microsoft Xbox 360 S with Kinect 250 GB Glossy Black Console (NTSC): $335.00 (0 Bids) End Date: Monday Dec-2-2013... http://t.co/V2r0vXskWd": 0, "#Microsoft still #open #sources more technologies than many think http://t.co/OqRzYbXW56": 0, "RT @wpcentral: Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/Q45Zt12uAH": 0, "Amazon Is Crushing IBM, Microsoft, And Google In Cloud Computing http://t.co/WVWmHgSYA6 via @bi_enterprise": 0, "@StefanPerales Hi Stefan, happy to assist you. See: http://t.co/fTsJsDgfZQ for info on accessing VPN properties. Does this help? ^KM": 0, "#computer #security Two big complaints people have had about encrypted email often derail its http://t.co/ZJbt4qUAjx": 0, "What do you call Microsoft's new console? I explore the rise of the \"Xbone.\" http://t.co/VDrYFtn86B": 0, "#OneNote Updated With New Sharing Features: #Microsoft was one of the first to the digital note taking game with... http://t.co/wMi8eoMpS4": 0, "Microsoft acknowledges Xbox One problem with disc drive: *The issue affects 'a very small... http://t.co/5XoYpaTmz4 #xbox #x360 #xboxone": 0, "Ars looks back at OS/2 and the IBM/Microsoft relationship. http://t.co/HEpPBpfERS": 0, "Microsoft supports lawsuit reform so it doesn't have to compile 60 million pages per case: [at The Verge] -... http://t.co/5rgaeJ3oS5": 0, "HP private cloud service leads the pack, followed by Cisco and Microsoft, Forrester says http://t.co/fHuRpg7nsG": 0, "Just entered to win a $550 Microsoft gift card from @TheGameFanatics! #MicrosoftStore #XboxOne http://t.co/NSgabPXxw6 via @PunchTab": 0, "TUF 18 Finale conference call http://t.co/vdHXP4udFQ via http://t.co/ABUaH7ML8Q #mma": 0, "UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/TvBn4PlpoG #Win8 #FunApps": 0, "Microsoft preps its mobile app for Office 365 admin. Learn more: http://t.co/2Rhffp7h5S": 0, "Microsoft doubles down on iPad bashing with a pair of new Surface ads http://t.co/XCHEGIGHYA": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/DbRhL5FDcl": 0, "RT @bing: Did you know @Seahawks mascot Blitz is also a @Microsoft employee? http://t.co/YGJf5DREvK One more reason to say #GoHawks! #BingH": 0, "So is Microsoft now just a full-time Google troll? http://t.co/iEZwddPcut If so, great pivot.": 0, "#ScienceFact 0% of Microsoft employees own an Xbox One.": 0, "UCLA game design students better game design by using this link: http://t.co/f2LJeH0xHS #Win8 #FunApps": 0, "New: Grab a picture of whiteboard scribbles, put 'em right into #OneNote (Win8 edition). Uses camera on your laptop. http://t.co/JDm4tzexNZ": 0, "30th anniversary videos: Father-daughter authors Steve Lambert and Joan Lambert, part 1 http://t.co/1GEq3v1Su4 #microsoft": 0, "@KaitlynWWE which will u buy of the following; Microsoft @Xbox One, @SonyPS4 , and/or will u buy the Nintendo Wii U?": 0, "I liked a @YouTube video http://t.co/wqRCZipnKF All Of The Microsoft Windows Sounds!!!": 0, "Microsoft word, I'm seriously not typing in fragments. Get over yourself. HDob taught me better than that.": 0, "i bet they used Microsoft word art to design the new $100 bill.": 0, "RT @RicciFX: **1600 Microsoft Point Giveaway**\n1. RT to Enter\n2. Follow Me ( @RicciFX ) \nMust be following!;\n\nPicking at 200 RT's http://t.": 0, "I liked a @YouTube video http://t.co/pgzpFLxwmG How to Get Microsoft Office 2013 Pro Plus for FREE! (No Torrents!!!) [Voice Tutorial]": 0, "\"@VideoGamesFacts: The white Xbox One that was auctioned off for charity by Microsoft. http://t.co/qUCqYliVYh\" now that's fucking sexy......": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/kviD7NxRXS": 0, "RT @nikzsmiileyface: I remember when Microsoft Word Art was the coolest thing ever.": 0, "RT @TheRecapp: See what @jaredisnothere thought of #SkyDrive - @Microsofts cloud-based storage application - http://t.co/qoc17W5qy5 #apps ": 0, "\"@Bease11: If someone smarter from @Microsoft doesn't call me soon I'm gonna go ape shit.\"haha lol": 0, "RT @CNET: Microsoft breathes new fire into the life of Scroogled with a line of products http://t.co/icQcMlqLyd http://t.co/BT9cQCIgAp": 0, "Despite NSA Crypto-Meddling, Microsoft Plans Office 365 Encrypted Email http://t.co/hZUouRuZAt #ccureit": 0, "RT @veeetoe: Microsoft windows sucks so much penis.": 0, "@its_me_spence Microsoft does not make computers; just the OS.": 0, "Formula 1 Memes: Toto logic http://t.co/eGCj9qB788 via http://t.co/u6brH2PXVg #F1 http://t.co/jnPiKIYw4W": 0, "@Bease11 @Microsoft LMAO, what happened?": 0, "RT @Bease11: If someone smarter from @Microsoft doesn't call me soon I'm gonna go ape shit.": 0, "@Bease11 @Microsoft Just talk with @XboxSupport or something. They really do suck....": 0, "@RealCam83 Refer to the post by Froilan_V http://t.co/r9viDVjtrR for an answer on this topic. Does this help? ^MG": 0, "Just to make sure, windows is registered trademark of Microsoft inc.": 0, "Forbes: How to pick and stick to career goals http://t.co/rg56EwJjgd via http://t.co/3cVMRz99nh #worldnews http://t.co/HKMe06R650": 0, "RT @NeoGAFNewThread: Microsoft admits Xbox One disc drive glitch http://t.co/MNVU5R17wO": 0, "Microsoft's Xbox One users caught swearing in video clips are having their accounts suspended http://t.co/TGmeSi4QVi": 0, "If only Microsoft Word could translate a whole sentence into #yolo my life would be made.": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/A9w6zQi7qO": 0, "CNET News: Microsoft aims to whittle Windows variants on mobile http://t.co/CahRPUDzTb": 0, "The New Windows: Accountant http://t.co/YnoXm4mMIo via http://t.co/EvmIlaxnxL #technews": 0, "@byrnetweets Awesome, this is great for photo editing: http://t.co/EkCtqoOQWP. This one is cool too: http://t.co/uq3eYFJ4xD. :)": 0, "Microsoft responds to overheating on Surface devices - a firmware update is coming:  If you recently picked up... http://t.co/KJdXi33vFC": 0, "RT @thegame: At the microsoft launch party for the #XBOX one !!! Sorry playstation..... We got this !!! http://t.co/IEtPZzI8Uw": 0, "An Apple a day keeps Microsoft away.": 0, "@Bease11 @Microsoft you might wanna check with JJ on going apeshit over this. Im sure him and ol Bill are in cahoots with each other": 0, "@neumarator Microsoft has published every Xbox One voice and gesture command that users can give to the new console. http://t.co/s53mMnSUlI": 0, "#xboxlive account hacked .Getting  customer support to help me is like trying to make tea using a chocolate teapot #wasteoftime #Microsoft": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/KKCnlLhEXE": 0, "Despite NSA Crypto-Meddling, Microsoft Plans Office 365 Encrypted Email http://t.co/WEef7j5z2j": 0, "Good news: I found a new way for Microsoft to gather information about me and my friends. http://t.co/UcsfqIkQ5J": 0, "U-Verse dropping Xbox 360 receiver support after December 31st -&gt; http://t.co/1ExAfglxHO #mobile #microsoft #xbox #tech": 0, "RT @adsteel: ...but...why? RT @corytv: Microsoft's new Surface 2, Surface Pro 2 and the Windows phone all run different operating systems. ": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives:  All launches of new technology are usually ac... http://t.co/A2xMN0OqjP": 0, "Bizarre 'fix' discovered for faulty Xbox Ones as Microsoft hands out free games http://t.co/6ztGkraQu8": 0, "RT @MSDynamicsCRM: Calling all manufacturers! Join us on Dec 10th to learn more about CRM for Manufacturing  http://t.co/a8ud9c8rke #MSDyn": 0, "RT @Ross_7_7: Modesto Chamber of Commerce and Microsoft advertising on Controversial R...: http://t.co/gc24rURvQB via @youtube   #stoprush": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console (NTSC): $0.99 (0 Bids) End Date: Thursday Nov http://t.co/toIwHfvWdi": 0, "RT @lmLesIieChow: Microsoft bought Skype for 8.5 billion dollars. HAHA idiots! They could have downloaded it for free!": 0, "Wisdom Quotes: Subscribe us at http://t.co/D2biX42EUv... http://t.co/woz0Y6cIUY via http://t.co/gxktWhKfbI http://t.co/RYh1tCVkaV": 0, "3 Favorite Java Mugs: Nasa; Geek from Microsoft, and my newest edition... @pluralsight http://t.co/APrTvzhhep": 0, "RT @JediJon: Thanks Facebook, now I'm aware that Kelly Rowland tried to text Nelly in the Dilemma video using Microsoft Excel http://t.co/w": 0, "Microsoft: We aren't going to have three different versions of Windows http://t.co/McAuXbq8xv": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/z3jbXjdJgC": 0, "Take hold of puissant performance conformation skills therewith microsoft powerpoint cultivation: nJUlwEQOt": 0, "Google responds to Microsoft smear campaign with witty retort about wearable computing #tech http://t.co/wP1RobyvEN": 0, "RT @RememberingMSN: Today, MSN Messenger is no more. After 14 years, Microsoft have closed the once popular instant messaging service. R.I.": 0, "Microsoft starts offering cash bug bounties up to $161,000 http://t.co/AXNcyYYzV5 #Geekcom": 0, "Damn! Funny: Wait watt? http://t.co/yBihF9AY7v via http://t.co/fnTDKnNbKt #funny": 0, "WWE 2K14 signed by daniel bryan collectors copy for Microsoft Xbox 360: 50.00 (0 Bids) End Date: Tuesday... http://t.co/T4PVg3RCGE": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/CJgkzYyt6k": 0, "RT @microcenter: RT if you want to win a #PS4 or #XboxOne ! Sign up here to win http://t.co/gEuVDYN6VU . #Microsoft #xbox #Sony #Playstatio": 0, "RT @Polygon: Report: Xbox One Upload Studio users temporarily banned for swearing (Update: Microsoft responds) http://t.co/tPcXM4MV2a": 0, "Sunset Overdrive to release in 2014 by Microsoft\n\nRatchet and Clank developer Insomniac Games is lending its... http://t.co/ZaObqAgEgl": 0, "Juan Pablo Montoya: new image http://t.co/cROzXwKybU via http://t.co/u6brH2PXVg #F1 http://t.co/uDMfIQR75A": 0, "Collection of cool, nice,...: new image http://t.co/C4WdRhNMUK via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/H6FuNzqjRA": 0, "UP WiFi might be the most infuriating thing when I'm actually trying to get work done- that and Microsoft word spontaneously shutting down ": 0, "Reasons in passage to trust microsoft software cause pc differently laptops: Gyzpc": 0, "I hate Microsoft my whole computer won't work because of the stupid new updates :)))": 0, "BBC News - Microsoft acknowledges Xbox problem with disc drive http://t.co/h71gGGhplR": 0, "Microsoft releases statement on faulty Xbox One Blu-ray drives http://t.co/ZbLq2auf3N": 0, "Microsoft Xbox 360 Limited Edition Modern Warfare 3 Console: $131.89 End Date: Wednesday Dec-25-2013 16:40:13 PST... http://t.co/pWwS6aIVa5": 0, "A new survey suggests there's no such thing as the Monday morning blues.\n\nA Microsoft Office survey finds Monday... http://t.co/FmE6KHNhSq": 0, "@LeRiethmiller I'm counting Surface as a computer BECAUSE IT'S GOT A KEYBOARD. regardless, Microsoft is weak": 0, "@mtlhooligan According to http://t.co/s9TsylwxTv Office 2007 should be compatible as well. Are you getting any error messages? ^KB": 0, "I like this story, it gets into what Microsoft is after this generation. Xbox One revives the war for TV... http://t.co/z1VO0SQQWT": 0, "Microsoft is fixing Skype messaging, fun things planned for Windows Phone 8.1 http://t.co/JsQkgNK48m)": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/eTSA2Im90F": 0, "&amp;%*$#! Microsoft limits Xbox Live users' curse words http://t.co/3RoLW80tDX": 0, "Apple buys 3-D company behind Kinect: Apple has bought a 3-D-sensor company that helped build Microsoft's moti... http://t.co/BOgkwG5zdZ": 0, "Formula 1 Memes: JEV trying one last time to get the Red Bull drive http://t.co/ITPm7wXNZu #F1 via http://t.co/u6brH2PXVg": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/U8GSpCV6Xc #windowsphone": 0, "Protect self from cybersquatting&amp; fake web addresses&amp;How 2 recognize phishing email messages,links,phone calls; http://t.co/zUE08B3E4O": 0, "Video: So Microsoft made an anime short for Internet Explorer and its pretty kickass actually. http://t.co/FdtuBSSauz": 0, "Microsoft Paying Third-Party Publishers to Not Show PS4 Games at E3 2013\n\nhttp://t.co/GydvpPG75U": 0, "Microsoft Xbox 360 250 GB Black Console:   Price 30.0  USD  (0 Bids)End Time: 2013-11-26 12:48:54  PDTBuy It N... http://t.co/jUZ1rLTscB": 0, "Microsoft Black Friday Deals Dash Instant WIN Game\nWIN a $500 online gift code\nEnter DAILY-Ends 11/27\nClick... http://t.co/LMgHse6LtQ": 0, "My phone is officially fucked, the life of the battery completely depends on being plugged in! fuck you Microsoft": 0, "Nokia Chairman defends Stephen Elop and Nokias decision to sell hardware division to Microsoft http://t.co/vud0zhXAhl": 0, "UCLA computer science students better game design by using this link: http://t.co/B7cGaqXzgU #Win8 #FunApps": 0, "Microsoft responds to reported Xbox One issues http://t.co/eZhEVGDgo9": 0, "Love Quotes and Sayings: new image http://t.co/4UGVPTVRoX via http://t.co/gxktWhKfbI #quotes": 0, "Black Friday Ads from Microsoft, Big 5 Sports, Family Dollar and Hobby Lobby http://t.co/n2sxOjgpOx": 0, "Nokia takes page from Microsoft in new Lumia ad, goes after iPad's lack of physical keyboard http://t.co/yFsfWCRToL #apple": 0, "ELLE Magazine (US): Only 72 hours until these 24 luxe sweats are all you'... http://t.co/1yvjK4cZUE via http://t.co/qiQqBbpNxe": 0, "@PSony1 @sp1d3r_ownz @Microsoft so that's why you tag them, to get the point across": 0, "@maria_fiorillo7 my microsoft isnt working": 0, "buy ukash voucher bitcoins farmers and bitcoins dinar rising in value bitcoins moneygram microsoft office purchase online": 0, "RT @MyNinjaTurtle: BBC News - Microsoft acknowledges Xbox problem with disc drive http://t.co/h71gGGhplR": 0, "@Microsoft @bing I have Bing Desktop and I therefore have this little fox as a big background!": 0, "@Xbox @Microsoft Will the worlds on the 360 transfer to the one. On minecraft?": 0, "RT @vruz: \"Microsoft hacked systems of a NYC startup who develop an adblocker for Bing, falsely incriminated them for possessing illicit su": 0, "Microsoft Xbox 360 (Console Only, Broken Drive) AS IS: Price 4.99 USD (0 Bids) End Time: 2013-11-26 12:23:01 PDT http://t.co/H4t5oIBDdC": 0, "I liked a @YouTube video http://t.co/RdujHyzHQA The Making Of Yoteslaya Limted Edition Microsoft Xbox One (Only Model)- 500 GB Black": 0, "Fact check: Did Kelly Rowland try to text Nelly in the Dilemma video using Microsoft Excel?\nhttp://t.co/nMrolbf86N http://t.co/LyKFj2ZEfI": 0, "Microsoft admits disk drive glitch is killing some Xbox One consoles http://t.co/qJoT5a2emb": 0}