{"EU reportedly set to sign off on Microsofts $7.2 billion Nokia deal http://t.co/sBwBt1SmNq": 0, "I'm 52% down with the kids. I've got dubstep on my Microsoft Zune. How about you? http://t.co/okGFKQo2pe Shoulda just cheated!": 0, "@Microsoft @Xbox If you guys give me a free Xbox One I will tweet and promote you guys like all the celebs do": 0, ".@Supervinh47 @KSIOlajidebt he was at the xbox 1 launch and paid by microsoft. it's ppl are upset.": 0, "@lokagames If they was to do that then at least it would be a new kind of microsoft as they gave something to say sorry regardless how small": 0, "RT @StonefoxMedia: Xbox One green screen of death. Sony Congratulates Microsoft . xbox one unboxing and comparison. http://t.co/4jI8Ze1k2j": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/fMCoH8mzuO": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/wf7Co7fnJ4": 0, "Xbox One sold more than one million units worldwide in its first 24 hours, Microsoft says http://t.co/OXNSJcLfKd": 0, "#mashable Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the ... http://t.co/eazt4g6PDa": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/AfgLiFc527": 0, "@Microsoft plz message me on crazyboy-123@hotmail.co.uk and tell me what's wrong with my account": 0, "Still good to see. Every system is great in it's own way \"@IGN: Sony congratulates Microsoft on Xbox One launch http://t.co/VbAGLWYmQs\"": 0, "MICROSOFT LIFECAM VX-2000 WEB CAM: $9.99 (0 Bids) End Date: Friday Nov-22-2013 13:44:14 PST Buy It Now for only:... http://t.co/Thy3IUWDfQ": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/ILwhKaSy3e": 0, "TripAdvisor to power hotel price comparison on Microsoft Bing http://t.co/6LqNq5DQh6": 0, "PopSugar Fashion: Bronze, silver, or gold? You http://t.co/BqBUhbA8Qa via http://t.co/qiQqBbpNxe #fashion": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/ZQ5aUV24EE": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/G8kKz947Dz": 0, "Microsofts latest venture comes as no surprise; competition in the wearables space is really heating up.": 0, "Xbox vs Playstation comes down to personal preference of games you play and if you like sony or Microsoft platforms more. Virtually no diff": 0, "@KimDotcom @Microsoft @Xbox hummm dosent it dectect your eye movements and your breathing... not sure thats needed information for a game.": 0, "Microsoft produces a Governance Guide for SharePoint 2013 http://t.co/9NjDknRp11": 0, "Goodbye world lol #Microsoft #xboxone #gamer #about2go_in http://t.co/2geoCkc73S": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/ilQW45izkK via http://t.co/gxktWhKfbI #quotes http://t.co/454QdtO8hL": 0, "Tell Us: Are Anti-Google T-Shirts a Good Look for Microsoft? http://t.co/0DTyPmFW7k Google responds to Microsoft's line of anti-Google...": 0, "#xbox #one #microsoft #nerd / nice to fly home and have this waiting for me :) @ Masey Homestead http://t.co/gScqJAmjuS": 0, "RT @DwightHoward: Thank you to @microsoft for the #XboxOne, been checking it out today...WOW #veryexcited": 0, "Microsoft's \"Scroogled\" Google-bashing gear proves popular with its competitor's employees http://t.co/nCUbYPn460 http://t.co/Q0HxNFFCRa": 0, "[mashable] Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join... http://t.co/OXIMNg0KLy": 0, "Integrating Facebook in class, Vietnam teacher wins Microsoft award! DeafWire video. http://t.co/HZeL1kdEka http://t.co/fJKuTmWQqn": 0, "Microsoft to win EU okay for $7.3 billion Nokia deal: sources http://t.co/wMCFDn1RqZ": 0, "RT @ubergizmo: Microsoft Issues Statement On Xbox One Blu-Ray Problems http://t.co/Uco8lspiTJ": 0, "Top #Experts Dish... Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech... http://t.co/7wGZuKDeBt": 0, "Microsoft Store Workshops: DIY Holiday Crafts and Cards http://t.co/ouYUiAYBtY": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/24CxLNrXs4": 0, "RT @BBCTech: As #Microsoft's #XboxOneLaunch takes place, how do developers handle the massive ... http://t.co/aBSgwOfYFX": 0, "RT @westkid559: @PrettyBoyLoqan: Microsoft just stick to software you're not cut out to make hardware. Truth": 0, "Microsoft adds load balancing as Azure availability stutters - http://t.co/yoJESW3XzT http://t.co/rPD8jBZGuf": 0, "RT @columnfive: Another from our @Microsoft @Project #science series, visualizing the Human Genome Project: http://t.co/8FLcbZRL6O / http:/": 0, "RT @PandoDaily: Is David Sacks the Marissa Mayer of Microsoft? http://t.co/bkGScMN0cy": 0, "@camillacalhoun Thanks for getting back to us. Try contacting the Microsoft Store at 1-877-696-7786 for further assistance. ^KLM": 0, "Microsoft to Roll Out Encrypted Message Service for Office 365 http://t.co/p1UUX5DiUB": 0, "Microsoft to win EU okay for $7.3 billion Nokia deal: sources http://t.co/HkavN1U38d": 0, ".@espiekermann is not amused by @microsoft, and he is RIGHT ON: http://t.co/BenBJxekaV": 0, "Mashable: Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the ...": 0, "Bah, Humbug! Microsoft Wants You to Stock Up on Anti-Google Merchandise  http://t.co/H94sMSzyX4 via @DanielZeevi": 0, "Help UCLA computer science students better game design by using this link: http://t.co/XFGFUMArqp #Win8 #FunApps": 0, "@MarkusBondus Bungie split from Microsoft because Microsoft were too controlling. Insomniac just randomly worked with the competitor.": 0, "It's about time!  #microsoft #XboxOne http://t.co/AnZNCuGAAc": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/4EJPI6oK5S": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/Wc4imP34b0": 0, "RT @applenws: Microsoft brings auto photo backup to SkyDrive for iOS http://t.co/x1ztCUIoiA #apple": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/oaE6ZnrBJI": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/X5Vi5qGiS2": 0, "Debugging OWIN app or framework: Diagnostics The Microsoft.Owin.Diagnostics nuget package contains a welcome p... http://t.co/QgZ4dBNPfj": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/fX90a14ev0": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/4xQCdPU2yI #SmallBusinessNews via @previsomedia": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/dkg1g1q8lF": 0, "RT @surfer5671: UCLA game design students better game design by using this link: http://t.co/fFCjc3rFtZ #Win8 #FunApps": 0, "Microsoft Corporation (MSFT): Would Alan Mulally Be A Good Fit At Microsoft? $MSFT http://t.co/HujEe74YRc": 0, "Presidential Medal of Freedom Recipient - Loretta Lynn http://t.co/bSZyXpHGZW #uspolitics via http://t.co/hdZI6v6ii9": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/G0W4pVFYFI": 0, "Windows 9 Concepts: Designers Imagine the Next Microsoft Operating System: Windows 8.1 is here, but unfortunat... http://t.co/Yo3UYFhBWx": 0, "I'm the sister of a Microsoft employee.. Why didn't they send me an Xbox One too?  #NotFair": 0, "Judo World: new image http://t.co/o0UrtJQoe0 via http://t.co/jDAwU42y28 #olympics": 0, "@Resolutionary_ yeah they made all the regular ones black. Only select Microsoft employees got the white one. Shit look too smooth": 0, "@Colligo Briefcase iOS now integrated with Office2 by @citrix for editing of Microsoft Office docs on iPad and iPhone": 0, "UCLA game design students understand usability in games by reviewing their game, use this link: http://t.co/2zqqKbQ0hC #Win8 #FunApps": 0, "Microsoft Security Essentials Virus Protection\n\nhttp://t.co/NHs85zjIkr": 0, "So now you can trade yourself from team to team @DwightHoward Thank you to @Microsoft for the #XboxOne , been checking it out today...WOW": 0, "Microsoft's New Xbox One Sells Out - Wall Street Journal http://t.co/HWNRQLGZkf": 0, "two year postdoc position in theoretical computer science and probability at Microsoft Research http://t.co/9A7GDxELyU": 0, "Microsoft OLE DB Provider for Oracle error '80004005'  \nORA-12537: TNS:connection closed  \n/SIS/default.asp, line 68": 0, "@Microsoft dame back": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/qpKrtbbqum": 0, "Drinking  The Reverend by @AveryBrewingCo @ Microsoft Studio A  http://t.co/L29x5TMYfx": 0, "Microsoft Xbox 360 Special Edition Bundle 4 GB White Console...: Price 50.0 USD (1 Bids) End Time: 2013-11-23... http://t.co/a6cl4s7hiM": 0, "@themundanematt yeah I would angry at @Microsoft too when some months ago back at the #XboxOne 1st reveal they tried to fuck over everyone": 0, "RT @randypond: As a long time @Microsoft and @Xbox supporter I am really disappointed with their broken promise and screw up on my #XboxOne": 0, "New SmallBiz Trends: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/9he0LAs3a0": 0, "WHOOPIDY DOO MY FREAKING TEN PAGE LONG ESSAY DIDNT FREAKING SAVE THANK YOU SO MUCH MICROSOFT WORD ITS DUE ON MONDAY AGHHH.": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/QfxnzLbgm3": 0, "Microsoft's Julie Larson-Green Hints At Further Windows Harmonization Across Device Classes http://t.co/ahoyVEkErp by @alex": 0, "RT @erecasner: @DwightHoward @Microsoft All the money you make they gave you one?": 0, "nights like this got me wishin I still had my Xbox live, Microsoft is the worst": 0, "First Face - #2 Joan Smalls Spring/Summer 2014 | FashionTV http://t.co/DOidibRGMo via http://t.co/PEiph2vUXV #fashion": 0, "Microsoft releases Xbox One in grand fashion. http://t.co/UMoPdPKEn2 $MSFT $SNE $ATVI $EA $NTDOY": 0, "RT @flyinglotus: U can talk about Microsoft being the scary corporation but Sony isn't any different. They all bad. And they all got my mon": 0, "Give feedback to students Win 8 app by installing from this link http://t.co/mHk9rEN1vN #windows81 #seo #CallOfDutyGhosts": 0, "RT @SaraAdineh: Microsoft Delivers Node.js Tools for Visual Studio http://t.co/vrQMOiZByK": 0, "@kenjimurasame Well this should at least prove to angry young men that Microsoft still see them as there core demographic.": 0, "Microsoft Xbox One Day One Edition 500 GB Black Console: $0.01 (0 Bids) End Date: Saturday Nov-23-2013 16:16:49... http://t.co/d16FtRILkm": 0, "Xbox One problems affect only a very small number of customers, says Microsoft http://t.co/BSfPfWXqps by @TheNextWoods": 0, "RT @LifeCheating: If you want change your Xbox Live gamertag ask your friends to report it as offensive. Microsoft will force you to change": 0, "EU reportedly set to sign off on Microsofts $7.2 billion Nokia deal http://t.co/FwRc02lKLa": 0, "Windows 8.1 is here, but unfortunately for some users, it brings almost no visual improvements, except for a S... http://t.co/ZqQBSrdA0g": 0, "@DwightHoward: Thank you to @microsoft for the #XboxOne , been checking it out today...WOWbuy me one": 0, "Black Leather Stand Case Cover+ LCD For Microsoft Tablet Surface Windows 8 RT *: $6.49 (0 Bids) End Date: Friday... http://t.co/paigHBW76J": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/0kqjav7ykP": 0, "RT @SteveArman: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/ZQ5aUV24EE": 0, "@BaseHarryWorld you might wanna wait http://t.co/8YZcfdaHUZ": 0, "Tech Rewind: Gamers Herald New Console Arrivals: It was a big week for gamers as Microsoft rolled out its newe... http://t.co/D18H7WC3Pi": 0, "what Microsoft brings to the table with Windows Phone 8.1 next year? http://t.co/l27MeXmoqg": 0, "RT @novriltataki: \"Can't update your Xbox One via Xbox LIVE? Microsoft suggests taking it to a friend's house\"\n\nThis launch is way funnier ": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/0xPlKgyqys": 0, "Weezer: Today in Weezer History: 11/22/1996 - Weezer plays the Phoenix C... http://t.co/v6qlsdOQqq via http://t.co/ZY1cU2DvHH": 0, "@XboxSupport1 hi there, got my xbox one, my microsoft credit still doesnt work :( says use another method, ERROR CODE PBR9002": 0, "Nokia workers vow to continue strike over Microsoft deal http://t.co/ZzQgYniNHT": 0, "How to Make Pivot Tables in Excel http://t.co/uT7JXVV2yw #excel #microsoft": 0, "Christmas List:\n-Sanity\n-Peace\n-All my issues solved\n-My mental problems solved\n-iPad Air\n-Microsoft for my comp. \nPretty much sums it up.": 0, "congratulations microsoft, windows 8 is the world's most useless thing to ever exist": 0, "Microsoft Rumored To Be Interested In Acquiring Deezer via Ubergizmo - It seems that shortly after ... http://t.co/OGE8VXrBiH": 0, "RT @monkbent: I think that I have a pretty good vocabulary, and then @gruber drops \"cack\" http://t.co/Ao2PtCmFi6": 0, "@Xbox @PlayStation @Microsoft this is awkward": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/pbBTJdiU4T": 0, "Microsoft Xbox One (Latest Model)- Day One Edition 500 GB Black Console http://t.co/6tVg9GieiR": 0, "@alex_navarro In the voice of Microsoft Sam, the Xbox replies, \"I am your last mistake. Alex, die\" and then he died. - My Alex/Xbone fanfic": 0, "remember when the fans in the #XboxOne camp were bashing the #PS4 for the HDMI problems? pay backs a bitch aint it? http://t.co/fmlK4ll9gP": 0, "@DwightHoward @Microsoft I also want one.": 0, "Tablet Speaker Test: Microsoft Surface 2! Movie and Music playback from Windows RT http://t.co/DNntdLnU7p": 0, "@XboxSupport1 xbox one just takes me back to dashboard when I'm playing online wot kind of console have microsoft produced. Rushed Much????": 0, "RT @EZXboxVIP: Welcome to #DayOne of #XboxOne! Thanks for celebrating launch with us! Check out our launch day blog &amp; enjoy #DayOne! http:/": 0, "Game of Thrones: Send a raven. \n\nGQ named Kit Harington 2013's Gamer of t... http://t.co/BVwIf9kd7n via http://t.co/tXjObGiDiU": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/Y8Ogm1dDJ0 #Smallbiz": 0, "So it looks as though I shall be buying a #surface2 tomorrow... My Christmas pressie to myself #surfacehaslanded @Microsoft @pcworld": 0, "Does everyone receive that Killer Instinct code from @Microsoft? Curious.": 0, "@cdnstudent and thats coming from a person that liked microsoft for last gen": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console: Price 31.0 USD (26 Bids) End Time: 2013-11-23 15:02:32 PDT http://t.co/ZNO1Hct2z3": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/QMXgJ6bUZf": 0, "Ah my daughter just said.  \"Dad all your electronics have the same windows things\" yes life is good.  Welcome Xbox one to one OS #microsoft": 0, "Ow Plz @Xbox @Microsoft Just release the #XboxOne in the NL  and fix the language Issue with patches later. Its all in English now also.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/5x690dxKEb": 0, "Words To Inspire the Soul: new image http://t.co/0z6V15UFNJ via http://t.co/gxktWhKfbI #quotes": 0, "@Xbox @xboxuk  @Microsoft please fix the xbox one we paid alot of money for it to be crashing every 45 seconds": 0, "Silicon Alley - The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the revea... http://t.co/kpftiLmANa": 0, "Best Microsoft Wireless Comfort Desktop 5000 Keyboard and Mouse Set UK Reviews http://t.co/hRjjNfSBJf online sales #cheap": 0, "RT @jdalrymple: Nokia is making a phone for Microsoft, but it doesn't make phone calls.": 0, "So #xboxOne is already breaking. Uhuh. How unsurprising, #Microsoft! I'll keep with my #Sony.(;": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/iZLZxNYQIv": 0, "Fifth Harmony Performs 'Better Together' http://t.co/4KwBH50Y7G via http://t.co/tXjObGiDiU #tvshows": 0, "Xbox One Launch Party Glows Green With Super Fans Microsoft invited a thousand super fans to join the company T... http://t.co/DePsH02dxm": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/JJWiNzwrjV": 0, "Canadian Pharmacy Prescribes Microsoft Dynamics AX for Retail http://t.co/gg9w2wRNBy": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: From the latest tech to policy changes to ... http://t.co/Ta9Ck7HFlB": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/vUYmopm0Gw": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/NP0CAUrRy9": 0, "Microsoft Xbox 360 Pro 60 GB Matte White Console (NTSC): $40.00 (0 Bids) End Date: Friday Nov-22-2013 16:44:21... http://t.co/AFtq7Z6Yh9": 0, "@akaNudah Sorry but i dont see how its funny i dont know evey worker for Microsoft and if its sarcasm your doing really not the norm :/": 0, "David Bowie: WIIG AND BOWIE SPACE ODDITY SEGUE IN MITTY FILM\n\nCommencin... http://t.co/0aXLOoKGEG via http://t.co/ZY1cU2DvHH": 0, "RT @KaeyiDream: The drama continues.. http://t.co/aQqumc2rYM *grabs popcorn*": 0, "Real mature, Microsoft. I've tried to like this company, really I have, but this ain't winning it any points. http://t.co/lMlp59VXna": 0, "@xbox Thanks microsoft for my piece of beauty! #XboxOne": 0, "Having a wonderful time microsoftstore in Tyson's Corner. @ Microsoft Store http://t.co/tdWUtjhPto": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/Hv5LvJhZ51 via http://t.co/gxktWhKfbI #quotes": 0, "Microsoft Xbox 360 Pro 60 GB Matte White Console (NTSC) + 12 Games.: $17.50 (2 Bids) End Date: Friday Nov-22-2013... http://t.co/gffiwT87UD": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/wdvXgWdKi0": 0, "Android 4.4 will ship without a browser  http://t.co/P3EpSxC8EY\n\nHey @Microsoft! This would be a great idea for you too.": 0, "@Microsoft can u plz reply and tell me what's happened to my crimson185 account plz I want to go on it and play games with mates": 0, "#SmallBiz #SMB Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/7KiIEKdhYe": 0, "RT @Linkstagram: @Instaganon you probably got fired from nintendo and have to work for microsoft now\nyoud fit right in over there": 0, "Microsoft to win EU okay for $7.3 billion Nokia deal: sources - Reuters http://t.co/4yR7hkaN73": 0, "@aTimJohnson you should be able to log into BAE with your Bing Ads account until you associate it with your Microsoft account.": 0, "#GoogleWDesigner Microsoft should block Google from Windows because Google is not playing fair with YouTube apps #Scroogled": 0, "Is it @Microsoftbe std process to let Microsoft Inc (they say) call from UK &amp; ask to install pgm to solve pbm detected remotely on my PC?": 0, "Yawns* @kittygoblin: I'm not much of an e-book reader buh @ least I convert al my e books to microsoft reader format @ the very least. Read": 0, "RT @BGR: Google laughs off Microsoft's Scroogled merchandise stunt http://t.co/QXdUG2v3r7 by @bwreedbgr": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/y6otsWjon0": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/tP3hxtDfdB": 0, "Tech News: Google laughs off Microsofts Scroogled merchandise stunt http://t.co/JuLzjvFPb1": 0, "Ballmer Defends Xbox, Bing as Key Microsoft Components: Ballmer's last speech to shareholders made sure the Bi... http://t.co/OzfvNjuYsY": 0, "The console wars are back, and grating on me already. I'm sick of Microsoft mantra but ps4 too expensive. Who's got 350 to shell out?": 0, "Microsoft to win EU okay for $7.3-billion Nokia deal: sources  http://t.co/oUKoU7uTsl": 0, "Microsoft's Xbox One Launch Appears Relatively Smooth So Far http://t.co/gTnXH1K9EX http://t.co/qeBvIXpoeu": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/Cw1E6dURMP": 0, "Giggle Palooza: Get your Giggle on at: Giggle Palooza http://t.co/tYBFJmg5wS #funny via http://t.co/fnTDKnNbKt": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/1Zso3lK3s0 #startup #Dubai #GCC": 0, "RT @MMAFTR: Women's MMA News: Brutal Head Kick KO video from Women's MMA News! Croat... http://t.co/HQkfF9DZt4 via http://t.co/ABUaH7ML8Q": 0, "@MLunsted @pinionblue @darune Sony did in 2006 what Microsoft did at E3 this year. You don't shit on my couch, and expect me to for get it.": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/jpx98yusyu": 0, "Xbox One vs. PS4: Microsoft More Profit Per Console | EE Times http://t.co/SaqVgYFKW3 via @eetimes": 0, "RT @ScriptingGuys: How to make an HTML server report with PowerShell: This script creates a killer HTML Server report for one or ... http:/": 0, "RT @MarketWatch: Microsoft sells shirts and mugs slamming Google on privacy:  http://t.co/OGxgat9Luv http://t.co/32wbGhzgFV": 0, "@jbillinson Just bought at microsoft store on line U have to buy the bundle. For me it was good as I was going to buy the extras": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/hX6oa27VXz": 0, "Trying out the Panasonic MC-UL429 JetForce Bagless Upright Vacuum http://t.co/N4tfJfeDKn #technews via http://t.co/EvmIlaxnxL": 0, "Think Positive to Make Th...: View more quotes at [http://t.co/FMRtHa6iN4] http://t.co/Jqxj5nRnnd via http://t.co/gxktWhKfbI": 0, "The Xbox One is Microsofts attempt to build you a better Wii http://t.co/0mi2ChTUhK  #bpulse #tech": 0, "@akaNudah doesn't make sense according to Microsoft white xbox ones are only for members who worked on xbox one unless you did work on it?": 0, "RT @piercedavid: I think there's Microsoft product placement on every single show I watch. My whole life is live tiles right now.": 0, "Since when did they open a Microsoft ": 0, "Enterprise Deployment of Microsoft Dynamics CRM for Outlook (2013 or 2011) http://t.co/tVis6GbxrJ": 0, "RT @gameinformer: Microsoft Addresses Reported Xbox One Hardware Problems - http://t.co/teSxQP9pSK": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/qe9kHoSvsO": 0, "RT @ryanfaas: From @marypcbuk - Microsoft's devices boss hints at wearables and Windows consolidation @CITEworld http://t.co/NOphr7wC9W": 0, "75 dollars for a new xbox one controller is a little ridiculous @Microsoft": 0, "Done Paper 1! Just as I'm about to hit print, Microsoft Word crashes. luckily I saved. because had I not, things would be not living no more": 0, "Microsofts Scroogled Products Tickle Google Employees - http://t.co/JNTWtbib0v": 0, "Early demand for Xbox One rivals that of PlayStation 4 http://t.co/RmGTQNPcnR #xbox1 #consolewars": 0, "Just so I don't come across as a Microsoft hater, the PS4 is a skynet design as well.": 0, "Report: Microsoft is Readying a New Version of Xbox One for 2014 http://t.co/2UdDE20dSN": 0, "In the vicinity in relation to microsoft sharepoint 2010.: hknG": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/VH7U5b3ysM #EZY-HR": 0, "[http://t.co/pJTBbq5nyz] Google laughs off Microsofts Scroogled merchandise stunt http://t.co/y8FGZlOtQK": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/pOqaIJ6ZdR": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store - http://t.co/IER8HtFD09": 0, "Have microsoft said anything about the disc eating or are they just ignoring it as always?": 0, "Microsoft's New Xbox One Sells Out:  http://t.co/vfynSr3tWn #Technology, #Tech": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/vxXutt3lw5": 0, "Microsoft adds load balancing as Azure availability stutters http://t.co/nQgsxXxE3H via admin": 0, "RT @sickipediabot: Whoever stole my copy of Microsoft Office, you're dead.\n\nYou have my Word!": 0, "RT @AnonymousPress: .@Microsoft what about this: NSA Built Back Door In All Windows Software by 1999 http://t.co/pMFtd76Q1q #Scroogle #Irony": 0, "Loving my new controller @xboxuk @xboxone @microsoft": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/S29hKbAQbp #SmallBusinessNews": 0, "Smh-- never gon be a champ like dat RT @DwightHoward: Thank you to @microsoft for the #XboxOne, been checking it out today...WOW": 0, "Microsoft Now Shipping Kinect For Windows Preview Kits To Thousands Of Developers http://t.co/NkGNkNdzoj": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: From the latest tech to policy... http://t.co/vWXRd2JlKZ #YunnohNews": 0, "Microsoft SQL Server Integration Services (SSIS) Engineer: Negotiable, 2 yr of exp, posted on 23 Nov 2013 12:04:00 http://t.co/H9NZ8OK9xK": 0, "@forlorn_i That's a lie we ain't Microsoft": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/L26bCX6s91": 0, "Microsofts Scroogled Products Tickle Google Employees - http://t.co/rUzNvB1L2Z": 0, "Canadian Pharmacy Prescribes Microsoft Dynamics AX for Retail http://t.co/tucchyVm71": 0, "Planned obsolescence?! Microsoft you bastards! http://t.co/FVcfSLFw98": 0, "Urban Outfitters: Blanket fort Friday night. http://t.co/d7S3cBK4gr #fashion via http://t.co/qiQqBbpNxe http://t.co/Y776IKuU4G": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/jWve4RiiNT": 0, "RT @23andMe: Human Genome Project as visualized by Microsoft #infographic - http://t.co/AKEjKojeUS": 0, "@patomills apologies for the delayed reply - very busy day for us - have you tried steps on http://t.co/NB95RQ04Zk ?^JD": 0, "RT @MarkRein: Loving the user experience on Xbox One. Well done Microsoft!": 0, "Fuck Microsoft. The way they presented themselves at E3 was just ridiculous. They didn't even care about what the fans wanted. The only&gt;&gt;": 0, "#Smallbiz Update: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/MGep1kkiKa": 0, "@Mr_Roynaldo been on it for 9+ hours. Love it. Microsoft have delivered. #XboxOne": 0, "@DwightHoward: Thank you to @microsoft for the #XboxOne, been checking it out today...WOW #veryexcited - send me one?": 0, "@otterN9NE at the Microsoft store in the galleria http://t.co/zcyzKDsY2N": 0, "To spin or not to spin: Does Microsoft need Xbox? http://t.co/IJYADliNu0": 0, "Assist UCLA game design students better game design by using this link: http://t.co/lbLS87paeh #Win8 #FunApps": 0, "RT @DNaDez: Wait so Xbox One doesn't have 100% dedicated servers even though Microsoft are providing them for super cheap? \n\n-.- IW": 0, "Color-changing mouse for Microsoft Windows 8 and AppleMac http://t.co/15JNbfI4w5": 0, "I guess my only question for @Sony and @Microsoft Is with these new counsels n all the power between the 2 we do have enough internet right": 0, "Microsoft, your new console is fucking useless at downloading games. #XboxOne": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/j56vh7RAM7": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/ZKRztzezZg": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy ... http://t.co/dhX1qVnwi3 #smallbiz": 0, "More people are likely to buy a PS4 as it's cheaper then people get what they're friends get, Microsoft are pretty stuffed.": 0, "I feel bad for whatever foreign Microsoft employee answers my call, I have a few things to say.": 0, "RT @PirateOrg: You like your coffee bitter? #Microsoft now sells the perfect anti-#Google mug &gt; http://t.co/NdLUS23Rfy": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/DOCLPt5dpp": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the ... http://t.co/U5nFLmtvtF via @Business Inside": 0, "Global launch for Microsoft Xbox One console - BBC News: BBC NewsGlobal launch for Microsoft Xbox ... http://t.co/XpkgzbEAFF #mustfollow": 0, "Microsoft Office 365 helps Get it Done #GetItDone http://t.co/N3gU3IDoKz via @Gingermommy": 0, "Man on the Street  XBOX One Launch http://t.co/CMHx6Sc0wo via @msadvertising": 0, "@luckkyd  RT @X360A: Microsoft Offers Advice Regarding Xbox One Disc Drive Issues http://t.co/F4WDDxZUsu #X360ANews": 0, "@benkepes Microsoft all over again.": 0, "So much next gen I might explode! @Sony @PlayStation @Microsoft @Xbox #PS4 #XboxOne #nextgen #bye #ps3 #xbox360 http://t.co/lTjUzD28N7": 0, "Looking for a Microsoft Server Admin in Tokyo, Japan http://t.co/2ibhSfIS4r #job": 0, "I'm giving away: Sams Teach Yourself Microsoft Office FrontPage 2003 in 24 Hours [Paperback]. Check it ou http://t.co/ag4ghCIJQC": 0, "Becoming a better leader requires gaining better insights-try the Microsoft Dynamics CRM free 30-day trial http://t.co/1RVRV36oDK #TheArtOf": 0, "I think... Microsoft and Sony should use a 20% of their consoles before it sale out!": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/oeYmMXC4Un": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track  http://t.co/Dyujal6aCc": 0, "Microsoft Grabs Attention with a Zombie Apocalypse in #Vancouver http://t.co/yhkt6f44eH #business": 0, "@Xbox @Microsoft I just wanted to say that the delivery thank you card is just awesome #XboxOne": 0, "BREAKING: Microsoft Sells Over 1 Million Xbox One Units In Less Than 24 Hours http://t.co/ZNubm5u0fQ": 0, "Luke was fully prepared for the launch.. #Xbox #One #XboxOne #Microsoft #NextGen http://t.co/yoqROAS3YZ": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/S2arOWyzhO": 0, "Win a Microsoft Surface from Sweepstakes Advantage http://t.co/CW1CbTVmHx via @PunchTab": 0, "Microsoft's New Xbox One Sells Out - Wall Street Journal: ABC NewsMicrosoft's New Xbox One Sells OutWall Stree... http://t.co/HkyOOEeajo": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console with kinect: Price 50.0 USD (0 Bids) End Time: 2013-11-23... http://t.co/4OrtK85A5a": 0, "since I don't have microsoft word yet, this shall be what I use": 0, "Dear @Microsoft/@Xbox, whens the Xbox One releasing in Dubai. Sincerely, a devoted consumer of your products. *": 0, "Should You Buy The Microsoft XBOX One Or Sony PlayStation 4? [VIDEO]:  The XBOX One launches worldwide today, ... http://t.co/d1yVaRI2Ng": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/zxCiOg58ih": 0, "@MarketWatch: Microsoft sells shirts and mugs slamming Google on privacy:  http://t.co/aJv30fH4qG http://t.co/yMCI1RtvaN": 0, "On the plus regarding the Xbox I've been invited to go play Xbox with a Microsoft exec so it isn't all bad!": 0, "I like this. If only their fans were mature as them. #XboxOne #Playstation4 #Sony #Microsoft http://t.co/TOwG24ULry": 0, "Back from the WORK OFFCIE! ALL NIGHTER ! #xbox one #callofdutyghosts #bf4 #forza5 #microsoft #BBKLIVE": 0, "$ATVI Xbox One Debut Could Be Last Major Console Launch http://t.co/ZOlMbMPoRr": 0, "How Munich rejected Steve Ballmer and kicked Microsoft out of the city http://t.co/zOu9RuAWHf": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/Smxc2Z3760 #innovation": 0, "[Redmond Report] Exchange 2013 SP1 Will Run on Windows Server 2012 R2: Microsoft announced a few details this ... http://t.co/7G1LWNIpsk": 0, "RT @TAS_technology: Microsoft didn't cr... http://t.co/njYeRK4gW9 #technology #tech #technologyfacts #technologyfact #techfacts #techfact #": 0, "Just got the email from Microsoft with my Killer Instinct code.": 0, "Microsoft SQL Server Integration Services (SSIS) Engineer http://t.co/paA4zjn5j3": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/t257P7PeiU": 0, "RT @_iame: If you don't open Microsoft Paint and fix this RT @BrendanLLM: Implants shifted.. RT @TiffanyyyyyS_: That ass  http://t.co/N5s9": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/2J0MuHjdOC": 0, "Microsoft adds load balancing as Azure availability stutters http://t.co/JYK808UwqJ": 0, "Microsoft Xbox 360 250 GB Black Console: $200.00 (0 Bids) End Date: Friday Nov-22-2013 16:24:18 PST Buy It Now... http://t.co/OWZpGsfDdC": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/NRttp2GEDS #SmallBusinessNews": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/HagE3VpNiA #Tech": 0, "fashion lady: Choose one?\n\nThe order link order link 2&gt;&gt;&gt;ht... http://t.co/EVq9mXoqvG via http://t.co/qiQqBbpNxe #fashion": 0, "#5: Visual Studio Premium with MSDN 2012: Visual Studio Premium with MSDN 2012 by Microsoft Software Platform:... http://t.co/MYQkXVpwzl": 0, "RT @Microsoft: Thank you, delivery person. #XboxOne http://t.co/AOjgyg8kvA http://t.co/ghWnsLl35A": 0, "@flymykai call the microsoft store if you gonna get one": 0, "First impressions of the @Xbox one are really great so far! Accurate voice control and smooth transitions... Great job @Microsoft": 0, "RT @CryWasTaken: I just sat through roughly 13 minutes straight of an Xbox One fanboy rant about how amazing it is and how he got free subs": 0, "I liked a @YouTube video from @stonefoxmedia http://t.co/Ti2IgIyh70 Xbox One Green Screen of Death. Sony Congratulates Microsoft.": 0, "Microsoft's New Xbox One Sells Out - Wall Street Journal  http://t.co/koxASp34M2": 0, "now reading: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/OStbEQuZAD": 0, "RT @stephenswu: Encrypted messaging coming to Microsoft's Office 365 next year http://t.co/xnYlCfKuBV via @CNET": 0, "A TECH INDUSTRY ANALYST SAYS MICROSOFT'S NEW XBOX STILL NEEDS SOME HOT GAMES TO MAKE IT A SUCCESS...#KLIV  mcleod via @1590KLIV": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/mzsUenf8Aw": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/zSPotfTfd1": 0, "Small Business News: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech... http://t.co/U3HfRSpq0u": 0, "RT @Techland: 30 Days with Microsofts Surface Pro 2: Its a Keeper http://t.co/rWaCximy5P http://t.co/6CJHygh0iK": 0, "Just installed Microsoft Office on my computer. I'm ready to start this whole \"college\" thing now. #pumped": 0, "At the Microsoft Hack-a-thon at UCF tonight networking with some of the best coders in the area": 0, "#Mashable Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the ... http://t.co/s4joBi1XKQ": 0, "The heads of Microsoft then got wind of his supposedly 'hilarious antics' and promptly severed all ties to him forever.": 0, "Microsoft's New Xbox One Sells Out: Microsoft's new videogame console drew crowds for its debut, emulating an upbeat launch by rival ...": 0, "@PersonalCreeper @zStarGames @Microsoft @xbox @majornelson Of course he is.": 0, "probably wont even be able to get my hands on an xbox one until 2014.. thanks @Microsoft.": 0, "@Microsoft can i pay a monthly fee to use yr private coffee/donuts room at the overlake bus station #please #heatedroom": 0, "shitty. @nathanheustis @Xbox @XboxOne @Microsoft at least they didn't act like it wasn't their problem. That's what I fucking got.": 0, "FUCK YOU @MICROSOFT @Xbox AND YOU FUCKING JEWS AT @GAMESTOP": 0, "Xbox's bid for the living room: Microsoft aims to make Xbox One the hub of the living room as it takes... http://t.co/SiZ61wMRai #Kabari": 0, "@XboxSupport if I have 10 in my Microsoft wallet and I want to buy something for 15 will the store use the 10 credit first?": 0, "Amy Talks 'All by Myself' http://t.co/f1SW6q8ZCb via http://t.co/tXjObGiDiU #tvshows": 0, "RT @ManaByte: Microsoft to launch new version of Xbox One in 1Q14 http://t.co/cqceAtoG2V": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/cSt8k6fml3": 0, "@camillacalhoun We'd like to put you in touch with the Microsoft Store folks. With your country we can provide the right number to call. ^DJ": 0, "RT @JustGettingTech: Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL http://t.co/yCuwyITtgU": 0, "RT @ChrisJWatts504: RT @WhoIsPierre: LMAOOOO \"@Stuart_Horwood: #xboxone broken out of the box, back to Microsoft you go! #pos https://t.co/": 0, "#SLDprime Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the ... http://t.co/S86A5ZFlrI": 0, "Sony Congratulates Microsoft on Xbox One Launch http://t.co/WCUmvyIjlu": 0, "Kids streaming to Twitch.tv could be a PR disaster for both Microsoft &amp; Sony. #twitch #ps4 #XboxOne. Where are the parents?": 0, "So if I own an Xbox and not a PlayStation and I am the #lastman on earth does that mean Microsoft won the console war?": 0, "NEW SEALED Microsoft Surface RT tablet 32GB, Wi-Fi, 10.6in - Dark Titanium:  $285.00 (44 Bids)End Date: Saturd... http://t.co/2GetqFSoS9": 0, "RT @SpryGuy: @ohiomail @Microsoft The real question is: when will it ship?": 0, "Microsofts Xbox One | First Look http://t.co/x7goAjFT7X #CONSOLE #GAME #GregKumparak #XboxOne": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/l0k5xvLiK1": 0, "RT @Microsoft: Welcome to the family, #XboxOne: http://t.co/iKBaKakOYM http://t.co/Dfb3pifE88": 0, "Free up your RAM! http://t.co/Nk5igHDoCC #EA #free #game #microsoft #pc #war": 0, "I'm sure it's ENTIRELY A COINCIDENCE that online checkout for Microsoft's Scroogled store failed to work with Chrome: http://t.co/V5Y71fQt2A": 0, "\"Microsoft OLE DB Provider for Oracle error '80004005'  ORA-12537: TNS:connection closed  /sis/default.asp, line 68\" What is dis shit  #sis": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/qYd90UtqyP via smallbiztrends": 0, "Microsoft to win European Union's okay for $7.3 billion Nokia deal: sources http://t.co/Suv4BNhJYG": 0, "Microsoft offers veterans the opportunity to train for a job in the tech industry: http://t.co/xudaIe4rTr": 0, "Microsoft OLE DB Provider for Oracle error '80004005'\n\nORA-12537: TNS:connection closed\n\n/sis/default.asp, line 68\n\nYEAH": 0, "@MicrosoftHelps yes the product key appears to be wrong but am typing it in right, and Microsoft for Mac 2011": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/hJkXcWMVap": 0, "@SpryGuy @Microsoft I ordered one day shipping 4 16.00 Says next business day - Time will tell": 0, "RT @AnonymousPress: Microsoft Wants to Sell You Anti-Google Mugs and T-shirts http://t.co/rZct0iMaVb #Scroogled http://t.co/pG4pUBo8gS": 0, "MMA BEAT DOWN: new image http://t.co/ks73ZOxfEP #mma via http://t.co/ABUaH7ML8Q": 0, "Microsoft's Scroogled shop may be childish but Google should worry- The Inquirer http://t.co/wYuRC425Kz via @INQ": 0, "Ballmer Defends Xbox, Bing as Key Microsoft Components: Ballmer's last speech to shareholders made sure the Bi... http://t.co/mw8AwDq37Q": 0, "Microsoft Has Nothing to Share on Winamp Acquisition http://t.co/lhDUOmMaOC": 0, "The Microsoft Trinity! Nope, I'm never gonna give up the Toys R Us dream. I can sing the song right http://t.co/0htt5xzBct": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/tLSjWFKSqF": 0, "Microsoft takes over Times Square for Xbox One launch http://t.co/6QyFeREx7s": 0, "Microsoft and google are about to take over": 0, "RT @ExtremeFactPage: Bill Gates, the founder of Microsoft was a college drop out.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/W3icfW4tQQ #smallbusiness": 0, "I'm giving away: Microsoft Office Access 2003 Inside Out (Bpg-Inside Out) [Paperback]. Check it out - http://t.co/c8Z4SK5BQH": 0, "anybody know how to get a product key for Microsoft 2010 ?": 0, "EU Expected To Approve Microsoft-Nokia Deal via Ubergizmo - A few days ago, Nokias shareholders ... http://t.co/71yyAmJ5GK": 0, "Google responds to Microsoft smear campaign with witty retort about wearablecomputing http://t.co/mAr12Ebwwk": 0, "@Microsoft well yeah my son would if his day one edition wasn't delayed arriving until the 25th.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/9NPLHSesAZ #SmallBusinessNews": 0, "RT @Microsoft: Have a great weekend playing #XboxOne, everyone! http://t.co/53SLjZCuLm": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/eOdv9Ewgxe": 0, "Winamp Petition Emerges as Microsoft Considers Purchase - Tom's Hardware Guide  http://t.co/S0Max7wGmW": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/MdZFZ9FVpd #Startup #Entrepreneurs #Ideas": 0, "@grape_like Some prick who goes to cons and harasses women. He was also hired by Microsoft for a launch party or something.": 0, "omg! from Yahoo!: Jennifer Lawrence's sassy response to seeing her haircu... http://t.co/7rHQGvs26Q via http://t.co/lZ21fxpl5d": 0, "Scroogled swag sells out as some buyers go for the gag - Microsoft upped the ante this week in its long-running Sc... http://t.co/2jQujMcRMp": 0, "I'm a Microsoft Fanboy IDGAF!!": 0, "#Microsoft #News: \"Well Done Microsoft, Xbox One Website Falls Over On Xbox One Launch Day - Forbes\" http://t.co/PU2dkXjYJW": 0, "This mug was given out by Microsoft $msft taunting google $goog about their data stealing behavior http://t.co/PHQDCG2Ph7": 0, "The amount of Microsoft product placement in #Elementary is unreal.": 0, "Encrypted messaging coming to Microsoft's Office 365 next year http://t.co/MGPqxh5gWs via @cnet #tech": 0, "Cool Deal Xbox One Complete Bundle for $699.95:   At Microsoft  Click Here http://t.co/HHn1fn1f8l": 0, "Microsoft Has No Clear Solution for Xbox One Disc Drive Issue http://t.co/gg3bWDUIhn": 0, "RT @sqlpmj: [blog] Tips for Creating a Great Video for the Power BI Demo Contest: With our Power BI demo contest... http://t.co/Ipxyc8GiuF ": 0, "How Munich rejected Steve Ballmer and kicked Microsoft out of the city http://t.co/PaJkAU3y8m": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/fdIAQk9pKv": 0, "Digging the voice commands on the #XboxOne @Microsoft awesome console! worth the wait! (Even though UPS left It on my doorstep) Thank you!": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track - Small Business Trends http://t.co/E21RnWHdln": 0, "Microsoft Confirms Sunset Overdrive for 2014 Release http://t.co/iwC3sNback [news]": 0, "Microsoft Excel's best secrets, saving you time &amp; frustrations http://t.co/nopao9CESS": 0, "ahhhh fuck you Microsoft buying a ps4 in spite now.": 0, "Phoenix Jobs $$ Senior Consultant - SCCM/ Windows 7/Microsoft at CompuCom (Phoenix, AZ)  http://t.co/wCltiH12ql": 0, "He keep bringing xbone in the convo, Microsoft is on the level of Nintendo as far as I'm concerned": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/QFWudQ6h6d": 0, "Xbox One Launch Party Glows Green With Super Fans http://t.co/zRfVOt5Mhw Microsoft invited a thousand super fans to join the company Thu...": 0, "@dusty_b14 I ordered it from the Microsoft store this morning at like 1:30": 0, "Four things to know about #Xbox One: It's official: #PlayStation 3 and #Xbox 360 are part of the \"last generat... http://t.co/XvzVn85aY1": 0, "Console giants battle continued with launch of Microsoft Xbox One - http://t.co/NpBc1usPu6": 0, "RT @Microsoft_Xbox3: #Xbox One in stock at #Microsoft Stores: #GameSpot: A special $700 #Xbox One Complete Bundle is also available... http": 0, "Repost because my last pic apparently screwed up?? #Sony #Playstation #PS4 #Microsoft #XboxOne http://t.co/N7DufQEJj6": 0, "@themundanematt @Microsoft so now I changed sides for my own safety because capitalism shall die": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/RLEM758wlJ": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/ZHDC7aobjM": 0, "Geek Squad - Microsoft Surface Pro 2 expert review http://t.co/ugpwbUwuoy": 0, "TripAdvisor to power hotel price comparison on Microsoft Bing http://t.co/Ts2iqbUsIb": 0, "I say rn, because there is a 0.001% chance that Microsoft pulls their shit together.": 0, "RT @Reem4444: Microsoft's iPad-Killer Lost The Company $900 Million Last Quarter  discovered using Zite, available at www.zit... http://t.": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox One. It hosted two massiv...": 0, "I should learn my lesson when pre-ordering @Microsoft stuff. Zune 80 and Surface RT were 2 weeks late, @Xbox One isn't here either. Damn.": 0, "#Microsoft exec: Challenge to keep up with #XboxOne demand through holiday season http://t.co/gbqOlkGieK via @examinercom": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/47DCz0hXqX": 0, "Microsoft's New Xbox One Sells Out: Microsoft's new videogame console drew crowds for its debut, emulating an ... http://t.co/zlCRD4kLVM": 0, "Seriously? Microsoft has #XB1 in stock but only if you buy the bundle that comes w/2 games of choice. $700. #TemptationIsland": 0, "@DwightHoward @microsoft @SHAQ you should be working out. Get better #PostUpSkills instead of playing Xbox. #dedicated2mycraft": 0, "#News Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/CNxEwwoMB6 #Smallbiz #Entrepreneur": 0, "fr @SmallBizTrends Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/cD2o1HwntW #smallbusiness": 0, "\"Xbox One Bundle with NBA 2k14 + T-shirt (I'm Poor, Need Money) by Microsoft\" for $3,500 on Amazon.": 0, "I liked a @YouTube video from @detroitborg http://t.co/neYLoEqeuJ Microsoft Xbox One: Unboxing": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console (NTSC): Price 50.0 USD (0 Bids) End Time: 2013-11-23 17:58:37 PDT http://t.co/CNm8tZzAof": 0, "WSJ:Microsoft's New Xbox One Sells Out http://t.co/N9zZhZIgTk $MSFT": 0, "RT @FactsInYourFace: Every time a new version of Mozilla Firefox is released, Microsoft sends them a cupcake.": 0, "My #xbox 360 red-rings the same week as #XboxOne launches.Very suspicious #Microsoft. Very suspicious. I'm on to you.": 0, "Windows 9 Concepts: Designers Imagine the Next Microsoft Operating System: Windows 8.1 is here, but unfortunat... http://t.co/KhIR0EEszU": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to ... http://t.co/FWwNQq6CWK #entertainment": 0, "@zaire2005 Weren't you saying the PS4 had a high failure rate? Should have waited until AFTER the Xbox One came out.\nhttp://t.co/8Jy3w8Gm8m": 0, "RT @OneGamerUK: Xbox One is in stock at the Microsoft Store here http://t.co/VkeD6EuAZr @WalsallFC1991 @AzzyMahmood but no bundles. Will ke": 0, "To spin or not to spin: Does Microsoft need Xbox? (http://t.co/8o4pl7wTdN: Business) http://t.co/2PAXafb10z": 0, "#10: Console Xbox One + Call of Duty : Ghosts: Console Xbox One + Call of Duty : Ghosts de Microsoft Plate-forme:... http://t.co/rhraN1aAbK": 0, "@gretawire ~Microsoft has 60 - 80 million lines of code in comparison to ObamaCare's 500 million lines of code.": 0, "I liked a @YouTube video http://t.co/mKSb6YAfN6 Microsoft Xbox One Console Overview - Newegg TV": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/brjg1dyrTE": 0, "The Fuqua School of Busin...: new image http://t.co/SYhXMWA1wL via http://t.co/QZzlZ1Yomz #mba": 0, "Love it when it's grey in #LA @ Microsoft Corporation http://t.co/DslAwdsfxC": 0, "Microsoft, Washington state partner to offer free IT courses http://t.co/BpfIxZvBuq": 0, "Microsoft have changed market completely from Xbox 360 to Xbox One, it's a stupid strategy, PS4 has little competition so less innovation.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/S3yq3J7xpU http://t.co/cvUaesvM8D": 0, "#technology #news AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/ud6csY6uQd": 0, "#SmallBusiness Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom th... http://t.co/96w8D0Z18L by @smallbiztrends": 0, "Another from our @Microsoft @Project #science series, visualizing the Human Genome Project: http://t.co/8FLcbZRL6O / http://t.co/6ytvb7gepW": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/W2FHGzCf11": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/m6E2p1z1NH": 0, "RT @DealConcierge: $699 - XBOX One Bundle In Stock at Microsoft Store http://t.co/7XaErR5XBF": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company... http://t.co/r7eGQTFaaP": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/hmZn20H1f0": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/1zKlxIFMZa": 0, "@CoolBlackGuy @microsoft shouldve got a PS4": 0, "RT @inside_man_55: @wpcentral: Nokia Lumia 1520 shipments delayed from Microsoft and AT&amp;T, say it aint so! http://t.co/oxmkj9aq9g why @att": 0, "Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL http://t.co/yCuwyITtgU": 0, "Nokia workers vow to continue strike over Microsoft deal http://t.co/46ylfAI8Ky": 0, "Insanely Funny Shit: new image http://t.co/vfnznamDbo via http://t.co/fnTDKnNbKt #funny http://t.co/4gwYddpOEH": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to pol... http://t.co/AtL2YvKM29 #entrepreneur": 0, "I love my #infinitv4 but @ what point do I give up on @Microsoft Media Center, @CetonDevs and @Cetoncorp and go to @Tivo? #echo": 0, "@AndrewDumont @hallstigerts seen Bing Offers? Not a shabby program if I wasn't so wary of giving M$ my cc details -- http://t.co/9CxK3JqJRM": 0, "I'm giving away: Microsoft Office Access 2003 Step by Step (Step By Step (Microsoft)) [Paperback. Check  http://t.co/tNY3IDrNoI": 0, "#Microsoft reinvents Visual Studio as an #Azure cloud service: http://t.co/5Fbf33BfUI": 0, "Why Xbox One Debut Could Be Video Game Console Finale http://t.co/8U4rL8Xx8c $SNE $MSFT $NTDOY $GME $EA http://t.co/r0CsK33VK2": 0, "@Michael_Arnone yeah it's pretty clear. The only think that Microsoft has on them is that they have better launch titles.": 0, "Microsoft guy loves the new iPad: http://t.co/HiSwO404dn | I use mine to watch movies &amp; TV, play games, read books, surf net, and tweet.": 0, "#smallbiz Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the... http://t.co/SXUWQZsYRg http://t.co/wt7Fv6CRIZ": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/Bvn0IUQjdG": 0, "New terminology invented by Microsoft, Limited Preview = work in progress = I am not ready yet!": 0, "Did I really just have to teach Microsoft Word the word 'ow'": 0, "@DwightHoward #XboxOne, @Microsoft Thanks for the gift": 0, "New Features in Excel Web App | http://t.co/1NruzT4zsk @office365 #excel": 0, "What an awesome week @Microsoft @Redmond #GetAhead Train The Trainer": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech ... http://t.co/pbNkb2SHkM via @SmallBizTrends": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/3tdXqfIPlR": 0, "@gretawire why doesn't someone investigate how much Microsoft, say, spent on Windows? Or Apple spends on its software? Compare that to ACA?": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/xmqDnWMjEH": 0, "RT @MinnesotaBurns: Microsoft- XBOX ONE THE NEW REVOLUTIONARY CONSOLE.....please use AA batteries in your controller.": 0, "When's a free-to-play game not free-to-play? The answer's obvious, but Microsoft doesn't seem to quite understand -http://t.co/n67SnTwz4H": 0, "RT @ChrisAstro: Google responds to Microsoft smear campaign with witty retort about wearablecomputing http://t.co/mAr12Ebwwk": 0, "RT @ducidni: Microsoft, I love you http://t.co/KZxDvtN1nl": 0, "From SmallBizTrends- Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech... http://t.co/FBxmQIUG7l": 0, "That's why I'm glad I got a PS4, Microsoft's awful track record speaks or itself": 0, "RT @OINKimmaPIG: whoever stole my microsoft office is in a big trouble. you have my word": 0, "#Security Secunia fixes PSI to work with Windows 8.1 and IE11 http://t.co/yCtcdM24ux": 0, "Review: Top #games for #Microsoft's new #Xbox One: Gadget junkies love a new machine. The #Xbox One is fun to ... http://t.co/KhLyrvV01y": 0, "I have heard that Microsoft is shuting down 360 live in 2 years. Is this true or false?": 0, "@Microsoft thanks I'll enjoy my #PS4 this weekend. Didn't get the renege box one.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/FCs9OWzAEa": 0, "Top 10 Things Microsoft Dynamics CRM Can Do For Your Company - CRM Software Blog - Microsoft Dynamics CRM https://t.co/Tx2vw6irBq": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/74FHK4LoKc": 0, "RT @Ryguy6610: Finally my baby has arrived! #XboxOne #XboxOneLaunch @Microsoft @Xbox http://t.co/G2TMsJFzVm": 0, "Microsoft charge 2010 offers hidden hosting clients the redress: GlcSYH": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/RlzufEZyEG": 0, "Xbox One Launch Party Glows Green With Super Fans http://t.co/7tSaiW9kqe Microsoft invited a thousand super fans to join the company Thu...": 0, "Microsoft Store - Fitbit Zip Wireless Activity Tracker (Charcoal) Was: $59.99 Now: $49.92 and http://t.co/RIjMA30aWh": 0, "Microsoft To Release A New Xbox One Early Next Year? http://t.co/eTYDOXJWSK #xboxone": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsoft's Online Store http://t.co/wTpAnGtSFO via @consumerist": 0, "On @Smallbiztrends Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track  http://t.co/FAMl409W7m": 0, "@I_HATE_VA @DoubleHelixGame @Microsoft @Xbox @majornelson @Shuoinked #GodzOfTheArenaTV #XBoxOne Day One Unboxing http://t.co/iMQO6NxHjq": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/6tyQROdGwQ": 0, "RT @HistoricalPics: Microsoft staff photo from December 7, 1978. http://t.co/ThSxhfq8hH": 0, "While Microsoft is only selling T-shirts, Google is hard at work on its Google Glass wearable computing device. http://t.co/Nv7y065ref": 0, "Microsoft just fucked themselves haaaarrdd": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/Sd7RYeyuzc": 0, "Canadian Pharmacy Prescribes Microsoft Dynamics AX for Retail http://t.co/p0kz3ajcoC": 0, "Off to Jacksonville with the Orlando KI champion John Martin! Black car service. Microsoft doesn't http://t.co/YEIoowTydI": 0, "RT @msftsecurity: Download #Microsoft identity theft protection tools to help you avoid email &amp; web #scams: http://t.co/DrLqQ7ub6v RT &amp; Sha": 0, "Kids running around with full-auto guns in a town is exactly what makes parents go nuts on gaming. Thanks Microsoft!": 0, "THERE IS A FUCKING XBOX ONE AD ON SKYPE WHERE THERE SHOULD BE A SKYPE AD! MICROSOFT STAHP!": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/4MJ5kKTO19": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/DNWE5QhJxP": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/FE6DGYg5P8": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/gNOWJwEoPi": 0, "RT @TheNextWeb: The Xbox One launches today - read our review of Microsoft's next-generation games console: http://t.co/uHoR6WJm38 http://t": 0, "RT @declanm: I'm sure it's ENTIRELY A COINCIDENCE that online checkout for Microsoft's Scroogled store failed to work with Chrome: http://t": 0, "Best Microsoft Wireless Comfort Desktop 5000 Keyboard and Mouse Set UK Reviews http://t.co/Y7l97lc2nh buy online #bargain": 0, "So @Microsoft give out of all people in the world Dwight Howard a free xbox one that guy makes $40000 a game he could buy about 800 per game": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/jAXzJdMXqL": 0, "sample xbox at microsoft store makin rattling noises lmfao": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/aVIGwlsLrD": 0, "Microsoft Now Shipping Kinect For Windows Preview Kits To Thousands Of Developers http://t.co/lLaJBKwWsy #TC #pakistan": 0, "RT @famicomplicated: RUMOUR: MS made Xbone disk drives faulty on purpose to force digital sales\n#totallynotarumour\n#hypertrollGET http://t.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to po... http://t.co/E2f6Bf9Ivo #smallbusiness": 0, "Giggle Palooza: Get your Giggle on at Giggle Palooza http://t.co/eTFz9MvJAx #funny via http://t.co/fnTDKnNbKt": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/NQ72gqncQ2": 0, "EU Expected To Approve Microsoft-Nokia Deal via Ubergizmo - A few days ago, Nokias shareholders ... http://t.co/X7PD0uVowH": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/78OyEsySQt #SmallBusinessNews via @smallbiztrends": 0, "Deactivated my xbox/Microsoft account by accident.....can't believe this.....": 0, "Microsoft you }*{|&gt;.  You telling me my new #XboxOne is obsolete already!!! Enough to make me pickup a #PS4.  Feeling raped.": 0, "Microsoft's Cybercrime Center has begun operations as the focal point for the company's Digital Crimes Unit http://t.co/jQ2VET1iI7": 0, "#smallbusiness Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/sU0r5uWMIb #startups": 0, "Microsoft To Purchase Winamp From AOL [REPORT] - ValueWalk http://t.co/EPokkNexmK": 0, "Optimising apps for display on the Nokia Lumia 1520: Microsoft, on its Windows Phone Developer blog, has share... http://t.co/zIVzy48cAs": 0, "@PrettyBoyLoqan: Microsoft just stick to software you're not cut out to make hardware. Truth": 0, "RT @cupcakelynda: Microsoft Word just suggested that I change \"you're\" to \"you is\" so yes, I am very very afraid of what the future of educ": 0, "@fpsjunkie can you go to http://t.co/vnMNLgBa8l and make sure your billing info. is up to date?^KN": 0, "RT @IBDinvestors: Why Xbox One Debut Could Be Video Game Console Finale http://t.co/8U4rL8Xx8c $SNE $MSFT $NTDOY $GME $EA http://t.co/r0CsK": 0, "Withering praise: RT 30 Days with Microsofts Surface Pro 2: Its a Keeper http://t.co/ZEcd3S93Cw via @techland": 0, "@XboxSupport3 wired straight to the modem. I tried the Ethernet with my 360 &amp; laptop, works fine. Should I take it to a Microsoft store?": 0, "So, Microsoft, when you envisioned your launch day, did you imagine people might actually want to try playing any games? #XboxOne": 0, "Man on the Street  XBOX One Launch http://t.co/oOOhYhqH4z via @MSAdvertising": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/IIZ8gqiles": 0, "Funny Wall Photos: new image http://t.co/Ij9lfX9CVQ via http://t.co/fnTDKnNbKt #funny": 0, "\"@DwightHoward:Thank you to @microsoft for the #XboxOne, been checking it out today #veryexcited\" only way ull dominate is on the xbox scrub": 0, "RT @TROexperiential: Congratulations Twenty First for Gold for Microsoft. Silver &amp; Bronze go to TRO #eventiaawards2013": 0, "So what have we learned from the new console launches, people? Shit can happen to either system. So chill down a bit? http://t.co/1r7VfL2j65": 0, "RT @eurogamer: YouTuber KSI dumped by Microsoft after Xbox One launch appearance - http://t.co/VRKwu0Lad6": 0, "Microsoft dumps KSI but \"sexism is not something he condones.\" In that case there's a dick-brained imposter at large. http://t.co/ZrIj5Rk4sz": 0, "GeekBeat Live #118 http://t.co/9gJTFZuSDJ #technews via http://t.co/EvmIlaxnxL": 0, "RT @Espaillat_: @flymykai call the microsoft store if you gonna get one": 0, "RT @heyyouapp:  http://t.co/G9ysGuEVZn 84 Www Google Search | Google, Microsoft modify Internet searches to exclude more child pornography": 0, "Microsoft Xbox One unboxing video  http://t.co/rqhsGh7rlS": 0, "iPad stands #theCoburns #FineGrain so hip that without them your Apple product might as well be made by Microsoft. http://t.co/tn6Stinary": 0, "@Griffin_Davis96 classic Microsoft atleast you can stare at the box I don't even have that option": 0, "@Microsoft if I had one I woulf": 0, "this may be the end of my consumer relationship w/ xbox products. #livid . #xboxone @xbox @XboxOne @microsoft #xbone #xbox": 0, "Google responds to Microsoft smear campaign with witty retort about wearable computing http://t.co/2HL7yhEtOh #TechNewsToday": 0, "RT @fulltimegamer: K: Microsoft Has No Clear Solution For Xbox One Disc Drive Issues: If you got an Xbox One today and your disc ... http:/": 0, "Microsoft Xbox One - Day One Edition 500 GB Black Console - NEW http://t.co/KNYRlHN97E": 0, "@MattShi3lds @Microsoft yeah it does. But I need 2. Cuz friends": 0, "@KishiFishy That's what Microsoft wants you to think!": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/ao9dRncGYB": 0, "Pictured from left to right: A brick, the only thing from Microsoft not pissing me off http://t.co/Idmtz5fu8p": 0, "@darrel_miller Ah, I might just be after UriTemplate http://t.co/5jLUY1wpmA": 0, "Check out the NEW commercial by Microsoft, BEST I have ever seen.  This commercial is making me run to check it out  http://t.co/GUyTLQUWno": 0, "Did you know Helvetica was made popular by Apple &amp; Arial by Microsoft? http://t.co/MiKUHdqZgo http://t.co/hlHhN7xygS": 0, "Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL http://t.co/SflSzlYCwI": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/ahzMZJdokC": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/cXzmIUqftR": 0, "RT @PlayStation \"Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits\"": 0, "Should You Buy The Microsoft XBOX One Or Sony PlayStation 4? [VIDEO]:  The XBOX One launches worldwide today, ... http://t.co/ZoqQ11fPtt": 0, "Microsoft releases Office 365 Admin app for Windows Phone: Microsoft has released the Office 365 Admin app for... http://t.co/OxFZtvSF3G": 0, "Microsoft Now Shipping Kinect For Windows Preview Kits To Thousands Of Developers http://t.co/n1UACc81w9": 0, "Seems the reason people have to pay more for the Xbox One is so Microsoft can get every celebrity to endorse it and give them a free one.": 0, "The Law Of Attraction: The Law of Attraction: 15  Hours of Instruction 3... http://t.co/X3IgCcETo6 via http://t.co/gxktWhKfbI": 0, "RT @RandallReitz: @microsoft You should rename Skydrive OneDrive. It aligns nicely with One Note, XBOX One, etc.  And it fits with the pr": 0, "#OMGawd!! #Fifa14 #NextGen #ImReadyToHearItFromHaters #Xbox #XBone #microsoft #soccer http://t.co/o354j5Xu1a": 0, "RT @prxyq: This is Best Solution for Free Microsoft Points http://t.co/nUL7EdDG5r": 0, "Nokia workers vow to continue strike over Microsoft deal http://t.co/TH16zxCLFY": 0, "Microsoft To Purchase Winamp From AOL [REPORT]  ValueWalk http://t.co/jQFDnCHprO": 0, "How Microsoft plans to change TV with XBox One http://t.co/BqQU1UCYBN": 0, "RT @maxmoefoe: Thanks Microsoft. And relax... all you @PlayStation fanboys, i'll be getting a Ps4 as well when they hit AUS, chill. http://": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/CjOqd9QkON": 0, "@nathanlatiolait is Garrett's there too? Microsoft delivered it to yours dads &amp; not your aunts lol": 0, "@tleaver Apparently they have Ones available at the Microsoft online store. http://t.co/m5WSRYqma5": 0, "@IMatheson http://t.co/tipnmRlxNB Is this what I should read through if I want to make methods available to multiple forms?": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/j6j9fPtsdm #SmallBusinessNews": 0, "RT @chanelwhale: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/l27kkc5jyp": 0, "1st race #forza5 #xboxone #microsoft #nextgen #racing #xbone #shiny http://t.co/KkIj2T0uBV": 0, "Microsoft OLE DB Provider for Oracle error '80004005'  ORA-12537: TNS:connection closed  /sis/Default.asp, line 68 LUL SIS": 0, "@FlamingFlarez I find it funny how Microsoft is using it as a way to advertise their own products so there is no rev coming in.": 0, "gsyncit (3.8.47): gSyncit is a Microsoft Outlook add-in that allows for the synchronization o... http://t.co/70zJHVjUcQ #chocolatey #new": 0, "Ask his mum. \"@firstpostin: Does Microsoft need Xbox? http://t.co/pryD9lBmto\"": 0, "Played Pinball FX 2 (PC), Microsoft Mahjong (WSA) and 1 other game in the last 24 hours. http://t.co/Eq0edI5NaQ": 0, "RT @TechCrunch: Microsoft Now Shipping Kinect For Windows Preview Kits To \"Thousands\" Of Developers http://t.co/mFCoRfcPnx by @alex": 0, "RT @GoldGloveTV: Being able to record Xbox One Day 1 is a huge plus. Thanks Microsoft.": 0, "I liked a @YouTube video from @stonefoxmedia http://t.co/Qps4rtQIob Xbox One Green Screen of Death. Sony Congratulates Microsoft.": 0, "Microsoft Rumored To Be Interested In Acquiring Deezer via Ubergizmo - It seems that shortly after ... http://t.co/NwIl7JrBJQ": 0, "Microsoft Explores Putting Fuel Cells in Server Racks  http://t.co/ZepiynHS1T": 0, "RT @SplinterCell: Today is Day One. Congratulations to Microsoft, and to everyone hopping on the next generation of Xbox: HAVE FUN! http://": 0, "Still haven't got round to downloading Microsoft Office Professional 2010.": 0, "#BizTrend The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of t... http://t.co/0Q382Zuzg3": 0, "Workers in China Protest Nokia-Microsoft Deal: Factory workers originally of Nokia, have taken to protesting o... http://t.co/XiCwax9URV": 0, "RT @MitchyD: Microsoft addresses Xbox One hardware malfunction, which is now affecting our editorial staff. http://t.co/hRwgxHX8HD": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/0h74Mu2yjl": 0, "UCLA game design students better game design by using this link: http://t.co/fFCjc3rFtZ #Win8 #FunApps": 0, "Man on the Street  XBOX One Launch http://t.co/NvNuBATUA9 /@MSAdvertising Blog": 0, "RT @oppo: 28 years ago, Microsoft finally released Windows 1.0 to the masses. Retweet if you're running Windows on your PC! http://t.co/OTM": 0, "#xxx #TaylorSwift Should You Buy The Microsoft XBOX One Or Sony PlayStation 4? [VIDEO]:  The XBOX One launches...  http://t.co/MPDuWliisJ": 0, "I favorited a @YouTube video http://t.co/O3Vys73mxi UnBoxing - Microsoft XBox One Day One Edition - Adam Koralik": 0, "Microsoft To Produce A Brand New Xbox 360 One Early The Coming Year? - http://t.co/bII5UIadry": 0, "@danbeecroft Ah, that's Microsoft and the internet for ya! Did you pick up anything else?": 0, "@DwightHoward @Microsoft hook a brotha up with a Xbox one. Lol": 0, "I liked a @YouTube video from @stonefoxmedia http://t.co/Gg1G8ZHSDy Xbox One Green Screen of Death. Sony Congratulates Microsoft.": 0, "Thanksgiving Drinks: Sip a Tart Apple Cocktail http://t.co/fGPwFaajzE #worldnews via http://t.co/3cVMRz99nh": 0, "RT @CEOJebailey: Off to Jacksonville with the Orlando KI champion John Martin! Black car service. Microsoft doesn't http://t.co/YEIoowTydI": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/B99v9qU3BN": 0, "ENDS SOON! Microsoft Office Home Premium Giveaway\n\nhttp://t.co/g7ECHFbMTC": 0, "Xbox One Launch Party Glows Green With Super Fans http://t.co/qjcg50YqOB Microsoft invited a thousand super fans to join the company Thu...": 0, "Pray for the blue swamp -- and other Microsoft mysteries revealed http://t.co/aO3PnL5USM": 0, "RT @myteardown: Xbox One vs. PS4: Microsoft More Profit Per Console | EE Times http://t.co/wPqRPknnoE": 0, "man microsoft are Really Pushing Microtransactions": 0, "Business News: Microsoft's New Xbox One Sells Out http://t.co/tu8hN6kvX5": 0, "#Professional Services firms in Australia looking to scale  http://t.co/NrvNzOjE58 #Cloud #WCM #BI #BPM #Microsoft #CA": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/2TWzwT9Ptv": 0, "AP Top Stories Nov. 22 P http://t.co/zmGshV2UXn #worldnews via http://t.co/3cVMRz99nh": 0, "WTF, Microsoft? A press release saying the XB1 sold out, but there's tons of stock everywhere. Makes you wonder if the 1M units = a lie too.": 0, "Pray for the blue swamp -- and other Microsoft mysteries revealed http://t.co/z8t6RyCTcw": 0, "@tweeting_keith For that particular aspect of it, I believe it was just someone at MS not doing their homework: http://t.co/zazbfX8AJc": 0, "@IncredibleCulp Microsoft sucks lol": 0, "30 Days with Microsofts Surface Pro 2: Its a Keeper\n http://t.co/DfV95s0SlC": 0, "Microsoft XBox 360 GUITAR HERO GIBSON RED OCTANE X-PLORER WIRED CONTROLLER: $29.99 End Date: Sunday Dec-22-2013... http://t.co/xtC0eRfMLl": 0, "Can Microsofts negative anti-Google tactics really work? http://t.co/LEEBgmbVWa": 0, "Global launch for Microsoft Xbox One - what happens next... http://t.co/98fgRYmPJM": 0, "Ep. 1390: Where we need a doctor's note http://t.co/rrPat6gy0p #technews via http://t.co/EvmIlaxnxL": 0, "Microsoft Store - Xbox 360 4 GB Kinect Holiday Value Bundle Was: $299.99 Now: $249.99 and http://t.co/gFZc0jirIn": 0, "@Doc_Villain Then Microsoft has NO quality titles on launch. Just a sad showing on the part of both companies IMO.": 0, "Microsoft OLE DB Provider for Oracle error '80004005'  \n\nORA-12537: TNS:connection closed \n \n/sis/default.asp, line 68\n\nANO TO SIS? BASTARD": 0, "@Sean_Deere @Microsoft the system doesn't come with one?": 0, "I heard MicroSoft is researching a haptic/perceptual bodysuit for XBox One..epic as always :)": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store http://t.co/5dDnI90B0p #news": 0, "#BizTrend Microsoft's New Xbox One Sells Out: Microsoft's new videogame console drew crowds for its debut, emu... http://t.co/WVW4YPJU3V": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/52ThU8j7q4": 0, "Drinking a Deliverance Barrel Aged (Small Batch) by @lostabbey @ Microsoft Studio A  http://t.co/FYa8JqNFhJ": 0, "CNET: new image http://t.co/oZ0mX21hJ5 via http://t.co/EvmIlaxnxL #technews http://t.co/iGuXw1vAce": 0, "Yea u know nothing new today except that Xbox one #XboxOneLaunch #Microsoft http://t.co/O9Pd0r83lg": 0, "In the last 24 hours, #XboxOne gamers have killed 60 million zombies! http://t.co/coyHNS3iFR": 0, "Xbox One Launch Party Glows Green With Super Fans, \n\nMicrosoft invited a thousand super fans to join the company... http://t.co/xJyUCLZQ8h": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/5bw2l9mMX1": 0, "Microsoft shop 2010 is the thrust unconstrained arrangement: MPzYr": 0, "Is Microsoft offering any similar deal where you can upgrade Ghosts for 10$ like Gamestop is?": 0, "Microsoft Xbox 360 console no hard drive: Price 10.0 USD (0 Bids) End Time: 2013-11-23 20:30:23 PDT http://t.co/eJGOY1w4w6": 0, "I liked a @YouTube video from @kenburtonshow http://t.co/1w5CkRAfE4 SGS - Microsoft, Monkeys, Ison, Eve Players, Virgina Stadium": 0, "Microsoft 70-643 quiz blues: OzPspbrkI": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console with kinect: Price 50.0 USD (0 Bids) End Time: 2013-11-23... http://t.co/dN2Am3lxxg": 0, "@digtriad really? Why no coverage on the #PS4 ? How much did @Xbox or @Microsoft pay for that news report? #disgusted #xboxone is for #loser": 0, "Setting up the #xboxone! @Microsoft @Xbox http://t.co/v60FLbfwk3": 0, "I would be sad to see Shoutcast die..I ran an internet radio station when I was in high school and college http://t.co/sK4Dxo5qsO": 0, "@camillacalhoun Thanks for letting us know. Did you purchase this on the Microsoft Store? Can you confirm your location for us? ^KB": 0, "Introducing Xbox One at\nMicrosoft Canada! http://t.co/iRnrw6gPYt": 0, "I got tickets to the Macklemore free concert tomorrow. Who else will be there haha. @ Microsoft Store http://t.co/NMSRSinquB": 0, "RT @msPartner: RT @buckleyplanet Join #IAMCP #Seattle and #Microsoft on December 4 for a #Social #Event  Kickoff for Women in Technology (": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/Jers77kfWm": 0, "Microsoft OLE DB Provider for Oracle error '80004005'  ORA-12537: TNS:connection closed  /sis/default.asp, line 68": 0, "Cindy Crawford: Im supporting St. Jude Children's Research Hospital thi... http://t.co/MF3ePYUuyO via http://t.co/PEiph2vUXV": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/dKopsZeyoi": 0, "Fuck my life who the fuck launches the same day as Zelda pass of Microsoft": 0, "Gave my son the sticker from my #XboxOne. This is what he did with it! #XboxMan @Xbox @majornelson @Microsoft http://t.co/32BdBO2Os7": 0, "@therealcliffyb Still impressed that Microsoft opted to keep AAs for power. Rechargeable AAs mean zero tether action. Or a second controller": 0, "RT @chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/m6LsBlW3Av": 0, "#XboxOne controller light is completely super scratched. Not happy @Microsoft... Hopefully. Can fix this because the experience... Dampened.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/G0BT1x3T9k #SmallBusinessNews": 0, "@ohiomail @Microsoft The real question is: when will it ship?": 0, "RT @verge: In pictures: Microsoft takes over Times Square for the Xbox One launch http://t.co/5dzjW6qlSw http://t.co/N5jErjknbX": 0, "Microsoft's New Xbox One Sells Out http://t.co/5uiyCAukZv Microsoft's new videogame console drew crowds for its debut, emulating an up...": 0, "Microsoft Addresses Reported Xbox One Hardware Problems ... http://t.co/JkZLnTlTzK": 0, "I really hope I can win @Microsoft @Xbox one from @CallofDuty @InfinityWard this would make my day and help ease the depression im stuck in.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/w05EFCywNE": 0, "Microsoft Research Connections Blog - Site Home - MSDN Blogs http://t.co/saiczrY9eT": 0, "@Microsoft has changed, if the new CEO sees this, he would change it. Personally saying, the Surface is known as a laptop, not a tablet....": 0, "If you want change your Xbox Live gamertag ask your friends to report it as offensive. Microsoft will force you to change it free of charge": 0, "Presidential Medal of Freedom Recipient - Ernie Banks http://t.co/ykMSAxx9Cd via http://t.co/hdZI6v6ii9 #uspolitics": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/t8mGupTRba": 0, "RT @RubyKular: Tell Us: Are Anti-Google T-Shirts a Good Look for Microsoft? http://t.co/wThISLHErf": 0, "Game 2 made it to the store. http://t.co/2LYAXJBqHj Alien Onslaught. 10 waves of furious aliens and asteroids #windows #gaming": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/E0ibKpzDs5 #startup": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/dX9N6StJoS": 0, "Microsoft examination execution coaching glacial movement aureateness dialectic: oTApM": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/h0Aom2Ta6j": 0, "Xbox One Launch: Microsoft's First Gaming Console in Years Launches With Lines http://t.co/wjUYtfwQ1e": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/EftmBpFqYB": 0, "Experts Question Google, Microsoft Child-Porn Measures -  By Ben... http://t.co/5NbhdLDhn4\n #JamesGamble #JuliaDavidson #KingstonUniversity": 0, "@Sean_Deere @Microsoft what friends?": 0, "#digital Microsoft Xbox One gaming and entertainment system launched worldwide: Microsoft made a b... http://t.co/9BcBINDOQk #tech #news": 0, "@twinxsXD if I'm right it would be for xbox or both since Microsoft bought the title like every other sony original game -_-": 0, "Xbox One Smartglass app for Android may just be handy: https://t.co/PNTcRGMXUQ #XboxOne #XboxLive #XboxOneLaunch": 0, "Well Done Microsoft, Xbox One Website Falls Over On Xbox One Launch Day - Forbes http://t.co/neAQStej09 #microsoft": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/9jbkQ5sSdX": 0, "#xbox #one #day #one #microsoft #video #game #videogame #instagamer #instacool #seguenois http://t.co/xIqkdOTpEI": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/VTnTwpcrPB": 0, "http://t.co/f2gR9KeKtW\nnever forgot the thumb pic in w8.1": 0, "Microsoft to win EU okay for $7.3 billion Nokia deal: sources - Reuters http://t.co/wvQp1eaDjc": 0, "At the Microsoft store to try xbox one. Really disappointing customer service. Waiting for 15 mins for it to be turned on #microsoft": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console (NTSC): Price 50.0 USD (0 Bids) End Time: 2013-11-23 20:33:10 PDT http://t.co/jaktjEiG9o": 0, "Xbox One Launch Party Glows Green With Super Fans http://t.co/L1Tx45UCiH Microsoft invited a thousand super fans to join the company Thu...": 0, "So... Logitech C310 (left) vs Microsoft Lifecam VX-1000 (right)? You decide! Loving my new webcam, Comparison Image! http://t.co/aYKnapoELf": 0, "The Case For Microsoft's Xbox One   ReadWrite http://t.co/S8UXigcD0V": 0, "Ballmer Defends Xbox, Bing as Key Microsoft Components: Ballmer's last speech to shareholders made sure the Bi... http://t.co/03vZJquFtC": 0, "Loving the user experience on Xbox One. Well done Microsoft!": 0, "@MicrosoftStore I've received my pre-orders, but was supposed to get Forza 5 on Day One. How is Microsoft going to resolve this? Thank you!": 0, "Availability Group Listener in Hybrid IT: End-to-End PowerShell Script Published http://t.co/sVtmcWde4K #microsoft": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/L5cf9a3TFE": 0, "Microsoft adds load balancing as Azure availability stutters http://t.co/e4AB0EcIzd": 0, "RT @AtomSplitGames: Get the @PowerGameGame &amp; try to beat the AI, battle your friends or family or challenge the rest of the world online ht": 0, "Google laughs off Microsofts Scroogled merchandise stunt (Brad Reed/Boy Genius Report) http://t.co/T89DygE1zt": 0, "Surge thy interpretation abreast microsoft sacrament improvement!: fqOjQHXOe": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/hPnWjH09cx #smallbiz": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/lzGR8LTYuj": 0, "Goodly speaking headed for microsoft training classes therein hawaii: nXEpoqOb": 0, "RT @Appy_Geek: Microsoft takes over Times Square for Xbox One launch http://t.co/nLgstH6UWB #Tech #News": 0, "Over 1 million #XboxOne sold in less than 24 hours! http://t.co/MgHKBqtrJv": 0, "Microsoft's New Xbox One Sells Out: Microsoft's new videogame console drew crowds for its debut, emulating an ... http://t.co/SCm4hBVJbs": 0, "RT @tomrhone: Xbox One Bundle in Stock @ Microsoft Store $699.99 &gt;&gt; http://t.co/cu9STk2XQA": 0, "Pray for the blue swamp -- and other Microsoft mysteries revealed http://t.co/wrS0ochN9R": 0, "RT @Best_Deals_Only: $699 - XBOX One Bundle In Stock at Microsoft Store: $699.95 - XBOX One Bundle In Stock at Microsoft Store \n\n... http:/": 0, "Presidential Medal of Freedom Recipient - Oprah Winfrey http://t.co/v8kWlqBwSO via http://t.co/hdZI6v6ii9 #uspolitics": 0, "RT @weskroesbergen: Microsoft produces a Governance Guide for SharePoint 2013 http://t.co/9NjDknRp11": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/EvVvjPigYz": 0, "Love Life And Life Will L...: new image http://t.co/CiDfUKaZ2p via http://t.co/gxktWhKfbI #quotes http://t.co/IevP4cEsVR": 0, "Today Microsoft launched the Xbox One console for $499.99. Is it worth the hefty price tag? Heres a review from CNET http://t.co/ngx89WToqp": 0, "I'd like to say that I'm unhappy everything in general. With all the shit happening with YouTube and Microsoft lately.": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/mdw0ol5PvX": 0, "IBD:Why Xbox One Debut Could Be Video Game Console Finale http://t.co/iwM45Jih9A $SNE $MSFT $NTDOY $GME $EA http://t.co/AJFuAqrfLv": 0, "Microsoft invited a thousand super fans to join the company Thursday night as it launched the Xbox One in New Y... http://t.co/n1oi1IZVYO": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/WfvKRqTPVM": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/PxsnHR3kDS": 0, "Microsoft barodynamics death chamber streamlines wholesale higher echelons processes: aNv": 0, "If you don't open Microsoft Paint and fix this RT @BrendanLLM: Implants shifted.. RT @TiffanyyyyyS_: That ass  http://t.co/N5s94iTPcP": 0, "Microsoft has Xbox Ones available on the MS store website in $700 bundles: http://t.co/65Wtl0MvYu": 0, "RT @MMAFTR: Brendan Schaub: Straight from Gracie Jiu-Jitsu Academy..recovery starts ... http://t.co/2VGpWP2ZDT via http://t.co/ABUaH7ML8Q": 0, "@ClubbyDubby @Siggyv  soggy why did u even buy the xbox beta ? Just curious. U seem to hate Microsoft.": 0, "#News: Google laughs off Microsofts Scroogled merchandise stunt: Does Google feel intimidated by Microsofts ... http://t.co/oUgPegfGfJ": 0, "After SONY and Microsoft i hope Xiaomi will release 16 core console game #eh i mean Smartphone": 0, "@SeattleProducer excellent.  Xbox is a Microsoft product? Yes?  Is their original programming shop in Redmond or LA?": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/oOk3IWmNFM": 0, "I haven't got any form of Microsoft Office at the moment and it's been a big fucking barrier in my life.": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/2EXBfj5WNu": 0, "Check out my Xbox One gameplay clips through the smartglass app! https://t.co/BGjDYN8zFe": 0, "new @smallbiztrends Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech ... http://t.co/o2kUWX5UzA": 0, "@TinyKarla22 can I borrow your microsoft word? c:": 0, "Get the @PowerGameGame &amp; try to beat the AI, battle your friends or family or challenge the rest of the world online http://t.co/I82Al8QtlB": 0, "welcome to microsoft office 2013 :)": 0, "@NizzDuude @Microsoft yeah man and for your first party games from them": 0, "I think I'm going to cry myself to sleep tonight, courtesy of @Microsoft and @UPS.": 0, "RT @WIRED: Microsoft, this just makes you look desperate. http://t.co/MfEfJbmjZh http://t.co/h4EV3MbkN2": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/LpNmE8jEW8": 0, "Haha microsoft.. Plug in the new xbox, already requires a huge ass update": 0, "Funny jokes &amp; pics: new image http://t.co/julS9XzXjo via http://t.co/fnTDKnNbKt #funny": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company... http://t.co/AtPZQHhWLw": 0, "@BroomyCraft @PersonalCreeper @Microsoft @Xbox @majornelson of course ,who do you think i am?": 0, "@ryan it's Microsoft's way of sparking imagination.": 0, "New toy!! *___* #xboxone #xone #games #geek #Microsoft xboxone http://t.co/oddT6RWBmB": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/A1BD9Zn7Zy": 0, "iOS: The iPhone 4 is 3 years old, but well give you iOS 7. \n\nAndroid: The lucky ones get updates. \n\nMicrosoft: No phones can upgrade. None.": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console (NTSC): Price 150.0 USD (0 Bids) End Time: 2013-11-23 23:13:09 PDT http://t.co/nnMYqFGooZ": 0, "TomH: Workers in China Protest Nokia-Microsoft Deal: Factory workers originally of Nokia, have taken to protes... http://t.co/tM8D3UtbVc": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/UeOtI32zbK": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/udreJoXfTq": 0, "RT @TonyGotBack: #psn down on Friday night...bout to go call Microsoft": 0, "Simple microsoft measure takings preliminary step: eZlOkcPk": 0, "RT @CDBest: #XboxOne in stock at #Microsoft Stores http://t.co/4kI2KqyUK0 #INSTOCK #HURRYHURRY": 0, "Microsoft's New Xbox One Sells Out: Microsoft's new videogame console drew crowds for its debut, emulating an ... http://t.co/wZNCEe7vMJ": 0, "Is David Sacks the Marissa Mayer of Microsoft? -&gt; http://t.co/Zxhi3aiX5q #microsoft #yahoo #tech": 0, "Immanent microsoft questions in passage to suffice 70-291 clearance oral: lUX": 0, "@MustardBun @69hunna no because Microsoft already gives you a complimentary ass fucking when you buy the XBOX ONE.": 0, "@DwightHoward @Microsoft Still waiting on mine guys, Im right down the road if you need me to come pick it up? #WorthAShot": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/HFia2859zf": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/sPkOmykjPA": 0, "Just Published: Man on the Street  XBOX One Launch http://t.co/kYJ4kRXbt8": 0, "\"@gameinformer: Microsoft Addresses Reported Xbox One Hardware Problems - http://t.co/EUKOlwUCHs\" :-/ typical": 0, "Pray for the blue swamp -- and other Microsoft mysteries revealed http://t.co/uwDdPI8M4G via Robert X. Cringely": 0, "@KitsuneLunari We'd like to hear from you. Go to http://t.co/Cnd8pLcIcx to fill out a quick survey and let us know how we're doing! ^KEB": 0, "Microsoft Customers Hit With New Wave of Fake Tech Support Calls http://t.co/v32WpEX1Zk": 0, "The Bold and the Beautifu...: Quinn proves she is a force to be reckoned ... http://t.co/J9OPoKO8n7 via http://t.co/tXjObGiDiU": 0, "Wireless Steel Series World of Warcraft MMO gaming mouse for Microsoft Windows 7 and Apple Mac http://t.co/HLJHPrFDMH": 0, "RT @gblock: OK hell is freezing over! Microsoft just announced a node IDE plugin for Visual Studio! http://t.co/AYnbNV1Gk8. No I am not kid": 0, "Color-changing mouse for Microsoft Windows 7 and Apple Mac OS http://t.co/VWOHXMfghj": 0, "RT @kamoswin: For the record, I'm a real recruiter &amp; I offer real jobs @Microsoft :)--&gt;Fake LinkedIn job offers on the rise http://t.co/xFT": 0, "Google laughs off Microsofts Scroogled merchandise stunt - Does Google feel intimidated by Microsoft's \"Scroo... http://t.co/CNsbG1E8BO": 0, "From SmallBizTrends: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom ... http://t.co/lrXZq8pF14 #smallbusiness": 0, "@microsoft #Forza5 with a 6gb download required? Really? #ThatsWhatsHood? I'll b on my #PS4. Should release games on Mon so we can play Tues": 0, "Microsoft Brings Automatic #Camera Backup To SkyDrive On iOS - http://t.co/JfVRaQe6CR": 0, "Win a One Microsoft Xbox One Day One Edition Console! from Bens Bargains http://t.co/MjCnOOlHqi": 0, "#video Xbox's bid for the living room: Nov. 22 - Microsoft aims to make Xbox One the hub of the living r... http://t.co/VXv34p2QTg #news": 0, "RT @jepeeeh: Microsoft OLE DB Provider for Oracle error '80004005'\n\nORA-12537: TNS:connection closed\n\n/sis/default.asp, line 68\n\nYEAH": 0, "Xbox One Becomes Microsoft's Biggest Console Launch - News http://t.co/GDvop1SU6y": 0, "RT @KyleL035: @DwightHoward must be nice bro @Microsoft sold me a defective one -_-": 0, "Would Alan Mulally Be A Good Fit At Microsoft? $MSFT  $F http://t.co/8wOykKx2iR": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/9NZLmaUyYF": 0, "@DwightHoward @Microsoft Plz Send me 1 im Broke and i really want 1. Plz ur a millionare ima highschool boy. Do a good deed. plz, just dm me": 0, "Funny Videos: Dog loves the trampoline! http://t.co/ND75pVToc1 via http://t.co/fnTDKnNbKt #funny": 0, "With Microsoft the nice thing is you get to listen to the same jazz interludes for minimum 20 minutes before talking to someone.": 0, "Small Biz Trends: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/XywgnCqxji": 0, "RT @Jam_sponge: Microsoft sever all ties with KSI. http://t.co/GWIgdLVYfl": 0, "I noticed that Nokia Lumia 2520 and Microsoft Surface are similar, right?": 0, "Microsoft Xbox 360 Special Edition Bundle 4 GB White Console...: Price 50.0 USD (1 Bids) End Time: 2013-11-23... http://t.co/oL99fFkJbv": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/EMJzTuACS7": 0, "RT @tomshardware: #Microsoft Wants to Sell You Anti #Google Mugs and T-shirts - http://t.co/9F4Jks40EV": 0, "@Akaashiqbal depends on how they implement it. 50% more power under the PS4 hood kind of makes me think that Microsoft must be holding back.": 0, "Meet this Bill from Microsoft -  bridging digital divide in rural areas, bringing education and healthcare http://t.co/Yq5RiCX6g2": 0, "Tip but hints across remarkable microsoft mercy courses: BDc": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/Mu2QJf8DJ9": 0, "You Are My Life: new image http://t.co/rx9OPkfiv8 via http://t.co/gxktWhKfbI #quotes": 0, "RT @smallbiztrends Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech t... http://t.co/AsJJmItjVW": 0, "China Oil Pipeline Explosion Kills Dozens http://t.co/VeBvx461IO via http://t.co/3cVMRz99nh #worldnews": 0, "London Slaves Held In Horrific Conditions, Police Say http://t.co/sMjwKY2aOH via http://t.co/3cVMRz99nh #worldnews": 0, "Fresh microsoft questions till endure 70-291 verification audition: CfnKX": 0, "Microsoft adds camera backup feature to SkyDrive on iPhone and iPad  Pureinfotech http://t.co/SeYHjFOrBF": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/XvXO9WJsGn": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the... http://t.co/p4eM6hRX8s": 0, "RT @Thegooglefactz: If you want change your Xbox Live gamertag ask your friends to report it as offensive. Microsoft will force you to chan": 0, "Microsoft moments is out! http://t.co/u79yftSspi": 0, "Have a great weekend playing #XboxOne, everyone! http://t.co/0i7zadtXHg Via @Microsoft": 0, "Critics say Microsoft should separate Xbox unit http://t.co/zk3uqOyjoO #xboxone": 0, "@HellspawnRei Hahha im getting a real feel for this now man. Microsoft did good getting this one.": 0, "US Olympic Team: Congrats to Tim Burke, Susan Dunklee and Lowell Bailey ... http://t.co/CXnDPfxgtm via http://t.co/jDAwU42y28": 0, "Microsoft Xbox 360 Special Edition Bundle 4 GB White Console...: Price 50.0 USD (1 Bids) End Time: 2013-11-23... http://t.co/eU8VPdWxEA": 0, "RT @mvroberto: Google started in a garage. Microsoft and Apple started in a garage. We should be spending less money on education and more ": 0, "People who never consider buying anything other than #Apple are no better than those who never consider anything other than #Microsoft.": 0, "Google     MS:\"comes as no surprise, competition in the wearables space really is heating up\" :p http://t.co/0LACoOMEVG": 0, "Wait so Xbox One doesn't have 100% dedicated servers even though Microsoft are providing them for super cheap? \n\n-.- IW": 0, "RT @bizsugar: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/5bw2l9mMX1": 0, "Would Alan Mulally Be A Good Fit At Microsoft? http://t.co/XbHwcFK07f $F $MSFT": 0, "Microsoft to Sever all Ties With Youtube User KSI- @KSIOlajidebt All aboard the unjust hate bandwagon #XboxOne #ksi\nhttp://t.co/9PtYioMItO": 0, "RT @pufffishh: Microsoft OLE DB Provider for Oracle error '80004005'  ORA-12537: TNS:connection closed  /sis/Default.asp, line 68 LUL SIS": 0, "#psn down on Friday night...bout to go call Microsoft": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console (NTSC): Price 88.0 USD (0 Bids) End Time: 2013-11-23 05:36:22 PDT http://t.co/ctbmrTxBeL": 0, "VIDEO: D-Block Hits Microsoft Store: Linebackers Sean Weatherspoon and Stephen Nicholas took D-Block o... http://t.co/LdJvgiCvES #RiseUp": 0, "I have literally sat here for an hr talking to my xbox! This is amazing! Well done @Microsoft @Xbox your team did great work": 0, "one of the families i know, the dad works at microsoft\ni feel so bad for them": 0, "RT @MichaelSteeber: iOS: The iPhone 4 is 3 years old, but well give you iOS 7. \n\nAndroid: The lucky ones get updates. \n\nMicrosoft: No phon": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/2oXxFCWCtF": 0, "Windows 9 Concepts: Designers Imagine the Next Microsoft Operating System: Windows 8.1 is here, but unfortunat... http://t.co/47U838EhKW": 0, "From @marypcbuk - Microsoft's devices boss hints at wearables and Windows consolidation @CITEworld http://t.co/NOphr7wC9W": 0, "The Xbox One is Microsofts attempt to build you a better Wii http://t.co/b7s5QwSkUg by @phantomath": 0, "Man on the Street  XBOX One Launch http://t.co/UUoHbaM1Iv via @MSAdvertising": 0, "@XboxSupport Is the Microsoft Store able to just exchange the power brick, even though I bought the One on Amazon?": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/BVqD4opRGc": 0, "Microsoft has announced that Xbox One has already sold 1 million units around the world. http://t.co/ttObqlgJuP": 0, "#SkyDrive iPhone photo backup is awesome. Great work @Microsoft": 0, "We checked out the new Microsoft store at the mall after I got out of work &amp; they had the new just http://t.co/68y4MNgVRo": 0, "RT @SteveReddington: Win one year of @Office365 free with this #giveaway with @AmyBarseghian. http://t.co/RDT0tKlkpG": 0, "For the record, I'm a real recruiter &amp; I offer real jobs @Microsoft :)--&gt;Fake LinkedIn job offers on the rise http://t.co/xFTBRieh3U": 0, "@Microsoft how y'all send all these celebrities the Xbox one for free but make us pay an arm and a leg for it.": 0, "#harsh The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out fo... http://t.co/lPpPko5k23 #startups #internet": 0, "The boys are home from #Microsoft with the #XboxOne #Xbox #games http://t.co/jVxsmVn1QU": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/IJg8tn8hkS": 0, "got my 1st xbox one game to bad im not getting one anytime soon but thanks Microsoft": 0, "Xbox One vs. PS4: Microsoft More Profit Per Console | EE Times http://t.co/wPqRPknnoE": 0, "RT @ChaosDecoder: @TaosConsulting Apple Store staff now wearing red shirts and rival Microsoft store wearing green shirts for the Holidays.": 0, "RT @Windows: Plan &amp; have your perfect trip w/ the new @TripAdvisor app for Windows! http://t.co/FHmOqS3Hjd #wanderlust http://t.co/9iIOOSTk": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/n45qcEm5fR": 0, "#InspirationImport Excuses No More! - When I bought my (stupid) little laptop it came with Microsoft Office but mu... http://t.co/cGJluG3pkA": 0, "@sethlinefsky Hm, unable to hear from that video very well, trying to exchange with microsoft store is a great first step ^LL": 0, "Just to make sure, windows is registered trademark of Microsoft inc.": 0, "them but at this rate its a real let down the xbox wont even work if the Kinect is unplugged I mean come on!!nice going Microsoft #XboxOne": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/XnuOlkp92I #Tech": 0, "Lyf is like a pile a shit u clean it up and it just shits again Nd im not juz sayin cuz i didnt get an xboxone 2dae cuz of microsoft.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/lSjPz1vVF5 #Startups": 0, "Apple Inc. (AAPL): Fruitful Projections Over #Microsoft #Corporation (MSFT) and: Next iPhone News: For many co... http://t.co/EzyCzdKzEF": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea - http://t.co/5PI1nxq19T": 0, "@Yousif_Alshaker When microsoft tries way to hard to mimic apple.": 0, "Microsoft Grabs Attention with a Zombie Apocalypse in #Vancouver http://t.co/2gO34ip4IK #business": 0, "Scenes from the Xbox One's NYC launch - Check out some scenes from Microsoft's Xbox One launch event in New York C... http://t.co/7wHV0Qrdi7": 0, "Thank you Microsoft you were absolutely NO help at all!!!": 0, "#entrepreneur Tell Us: Are Anti-Google T-Shirts a Good Look for Microsoft? http://t.co/zwzYMXu5hZ": 0, "RT @energizedtech: New #Powershell Script! Quickly generate proxy code for a PowerShell command in a new ISE tab. http://t.co/C5HqWmfmbx": 0, "PS4 com defeito / Microsoft parabeniza Sony / Uncharted 4 - Gamer Point http://t.co/lDVhgHmk9G": 0, "#business #finance The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went a... http://t.co/baDxTwvlbY #media #tech #in": 0, "Xbox One Launch Party Glows Green With Super Fans http://t.co/tF5nh6D89b #Microsoft": 0, "#mashable Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the ... http://t.co/IbWjnuNk3k": 0, "Windows 9 Concepts: Designers Imagine the Next Microsoft Operating System http://t.co/Y0PilgggVc": 0, "RT @Kotaku: Microsoft has no clear solution for Xbox One disc drive issues: http://t.co/vREfHW0KDp": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/z8DJ7NhmlQ": 0, "Microsoft Now Shipping Kinect For Windows Preview Kits To Thousands Of Developers http://t.co/ru0YzOMn2J": 0, "Microsoft releases Xbox One in grand fashion - Investor's Business Daily: FirstpostMicrosoft releases Xbox One... http://t.co/K6dVLTxzuc": 0, "RT @deanemurphy: Women account for about a quarter of all employees at Apple, Google, Facebook, Oracle and Microsoft. http://t.co/ms8x1oNAe5": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/Y6oZYFbfOG": 0, "First impression of Xbox one spent a few hours on it and I must say its unbelievable good job microsoft now to test dead rising!": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/5to40mQU2v": 0, "RT @CorpCaleCeo: @MSFT4Work @MicrosoftStore Thank you. This is why I buy #Microsoft products, personal &amp; #business. #Office365 Business my ": 0, "@ksteven37 Zuckerberg in bed with Obama administration ties go very deep with them and Google and Microsoft including common core standards": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/vWxmkSDY8G": 0, "$MSFT Microsoft Corporation (MSFT): Would Alan Mulally Be A Good Fit At Microsoft?: \nMicrosoft Corporation (MS... http://t.co/d3teydQSfG": 0, "RT @jenny0k: @TheBlackKratos they're just dicks like their whole advertising campaign is based around slating Microsoft": 0, "Going to be doing a Xbox One Preview tonight for PCGA tonight. Anxious to see if Microsoft did better than Sony. #doubtit #epicbuttdick": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/oH3D1puSCn on Smallbiztrends": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/2ijx9wkSKl": 0, "Microsoft OLE DB Provider for Oracle error '80004005'  ORA-12542: TNS:address already in use  /SIS/default.asp, line 68\n\nCHIE!": 0, "RT @Xbox: @PlayStation @Microsoft Thanks! It's been a #GreatWeektoBeaGamer": 0, "RT @ITworld: What \"devices and services\" really means to #Microsoft: http://t.co/woMviluglx via @sbisson @CITEworld via @MattRosoff": 0, "Nokia workers vow to continue strike over Microsoft deal http://t.co/iqGtOxLj4o": 0, "our co-founder's regular podcast is up! @MonkeyPodcast Episode 30 is now live! http://t.co/1qfzG6aLt6": 0, "Xbox One Launch Party Glows Green With Super Fans http://t.co/8QZaRtvVxz #Microsoft via @Mashable": 0, "kinda surprised there was no dashboard update for the 360 after next gen launch of #XboxOne @Microsoft @Xbox": 0, "Couldn't be doing with the Kinect constantly invading my privacy &amp; having Microsoft constantly spying on whatever it is that I'm doing man!": 0, "#gamespot GS News Top 5 - Good Guys Sony and Microsoft + does PlayStation \"define gaming\"? http://t.co/OgnhHPorv3": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/bZYHSnRi52 #SmallBusinessNews via @noobpreneur": 0, "RT @twscottiii: Starting Dec.1, schools that license #Office365 ProPlus can offer Office 365 to students at no charge. http://t.co/qpiPZYLi": 0, "@Microsoft Change that to \"PS4\"": 0, "Workers in China Protest Nokia-Microsoft Deal: Factory workers originally of Nokia, have taken to protesting o... http://t.co/JdO8f999IL": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track  http://t.co/Vm9fW55KRK": 0, "#XboxOne #Nextgen Microsoft To Release A New Xbox One Early Next Year? http://t.co/zFxfzC0agb #fb": 0, "Florida man arrested 62 times at his job http://t.co/1xbyQzmoqJ via http://t.co/hdZI6v6ii9 #uspolitics": 0, "Help UCLA computer science students better game design by using this link: http://t.co/QZ8MDLptTT #Win8 #FunApps": 0, "Hey Microsoft. I'm not an athlete. I'm not rich. I'm not famous. But, I do however feel entitled to a free xbox one console like them.": 0, "Windows 9 concepts: designers imagine the next Microsoft operating system http://t.co/18VvKjIGgN #Windows9 #Microsoft": 0, "#Xbox One and #PlayStation 4: Facial recognition shootout: Both the #Xbox One Kinect and PlayStation 4 camera ... http://t.co/xoasPXejMB": 0, "Microsoft, Washington state partner to offer free IT courses http://t.co/oRY2hTRyIu (via @rayschroeder) #elearning #edtech": 0, "Xbox One Debut Could Be Last Major Console Launch. http://t.co/JGZYQPQ35q $MSFT $SNE $NTDOY $GME $ATVI $EA": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/PIlIWHadyN": 0, "@Titanfallgame Disappointed that you made decision to be Microsoft exclusive, lost out on a opportunity to have a huge fanbase": 0, "I liked a @YouTube video http://t.co/4MwcwnFvDk Microsoft Office 2013 Torrent + Crack + Serial Key": 0, "Microsoft Releases HealthVault Update on Windows 8.1  Free Download - http://t.co/P1sWyXhKSM": 0, "ET to Go: Is Jason Statham Expendable? http://t.co/pUhloMhr84 #celebs via http://t.co/lZ21fxpl5d": 0, "AOL's Shoutcast and Winamp May Be Acquired by Microsoft - Kioskea http://t.co/aTWTeCHxuW": 0, "I liked a @YouTube video from @stonefoxmedia http://t.co/SiyXU5IgjT Xbox One Green Screen of Death. Sony Congratulates Microsoft.": 0, "Microsoft Issues Statement On Xbox One Blu-Ray Problems http://t.co/m8giiCko65 #MS": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/Edu3zCullR": 0, "Waiting for the Macklemore concert. @ Microsoft Store http://t.co/GldEFlLUKy": 0, "@MicrosoftStore @Microsoft Worst Launch Ever. Was the first in line and the last to get an Xbox. http://t.co/lPC2b1AYC5 #XboxOne #Xbox": 0, "RT @Windows: Did you know that your #Windows8.1 Start screen is your apps, friends &amp; sites in one place? http://t.co/LQqxH8zSAI http://t.co": 0, "@DwightHoward: Thank you to @microsoft for the #XboxOne, been checking it out today...WOW #veryexcited RICH GET RICHER.": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/1z38ntyw2J #smb": 0, "RT @BGR: Google laughs off Microsoft's Scroogled merchandise stunt http://t.co/YiTAaDMC20 by @bwreedbgr": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/JcWT6ls7OE": 0, "@jotting Right from @Microsoft. I realized after I tweeted though that the next day shipping was $17. Oh well. Lets hope I get it!": 0, "after 2 hours on hold, one of your people picks up, breathes in &amp; hangs up on me. #WTF. . #xboxone @xbox @XboxOne @microsoft #xbone #xbox": 0, "having problems hearing FAB Chart Radio? - try the new Windows app -  http://t.co/ZEoVSNugPp": 0, "So are microsoft just getting away with selling broken consoles by not saying anything? terrible @Microsoft @xbox @majornelson": 0, "Drinking a Deliverance Barrel Aged (Small Batch) by @lostabbey @ Microsoft Studio A  http://t.co/fPk31vuHgq": 0, "Ever since #Siri and #Apple switched to #Microsoft #Bing they take biweekly acid trips hoping to channel 5% of Steve Jobs' creativity.": 0, "Not supporting Xbox One or PS4,fuck em both,Sony and Microsoft jointly messed up": 0, "To join @ImagineCup Thailand chat for tech dev solutions install Lync software (http://t.co/GL2F0m6NKL) and go to: https://t.co/IwqQUlLA4k": 0, "@AidanJudeDude Thanks for the question. See http://t.co/psf1KXEPv4 and the last paragraph for more info. Does this help? ^DJ": 0, "@Microsoft - #XboxOne this is how I found out about this issue http://t.co/MOwx8LRh7o": 0, "Microsoft's New Xbox One Sells Out - Wall Street Journal http://t.co/vX31Dw1n3F #news #tech": 0, "Microsoft adds load balancing as Azure availability stutters  #Cloud #SAAS #Software http://t.co/G44rXAHnmV": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track  #small #business http://t.co/0a1xySXhLg": 0, "Why are @Microsoft .NET updates taking so much time?": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/PwNkR6Ssfs #startup": 0, "Microsoft Xbox One unboxing video: Hot on the heels of last week's Sony PlayStation 4 is the Microsoft Xbox On... http://t.co/5BX1VAfet8": 0, "@XboxSupport @xbox why won't Microsoft send my password reset email for x box live": 0, "RT @smallbiztrends Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/EGVVuzoIjL #4SmBiz": 0, "Color-cycling mouse for Microsoft Windows and AppleMac http://t.co/wFkm4R90C6": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/cRT4Swc3Wo #business": 0, "Microsoft Xbox One 500 GB Free Shipping!!: $700.00 (0 Bids) End Date: Saturday Nov-23-2013 16:17:44 PST Buy It... http://t.co/CEj7cMP22P": 0, "Xbox One Launch Party Glows Green With Super Fans: \nMicrosoft invited a thousand super fans to join the compan... http://t.co/fRYsoNEXtC": 0, "I'm giving away: Microsoft MS-DOS 6 Upgrade Operating System. Check it out - http://t.co/cztdS60yVr": 0, "Hahaha made my day #funny #microsoft #xboxone #xbox #dayone #controller #happy #laughing #secret http://t.co/Xf2Umlh7OQ": 0, "Senior Microsoft .NET Developer: Toronto,ON,CA,Excellent contract opportunity, located downtown - 2... http://t.co/76JIpM3Txj #ITJobs": 0, "Microsoft Issues Statement On Xbox One Blu-Ray Problems: Remember yesterday we reported that there were severa... http://t.co/QRHuD7NQWR": 0, "@Microsoft I wish I had an XboxOne. Probably be a year before I could even buy one :(": 0, "Small Business News: Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech... http://t.co/Sp4KEv2sQw": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/5mCuSZY3XB": 0, "Halo for Xbox One Leads the Lineup of Post Launch Exclusives, Microsoft Says: The upcoming Halo title fo... http://t.co/aE4QP5lft1 #halo": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/JtgsZSqjqS": 0, "Microsoft just stick to software you're not cut out to make hardware.": 0, "Microsoft to win EU okay for $7.3 billion Nokia deal: sources http://t.co/L1vy0zkhLb #technologyNews": 0, "@TaG_95 yeah, the GDDR5 is still faster, but I don't think Microsoft will bring out a new one. They're more concerned about multitasking": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track: \nFrom the latest tech to policy changes to... http://t.co/vZziMxBaxp": 0, "@Microsoft Pretty cool pic!": 0, "I don't hate on Microsoft,BTW. Just being realistic w/ past experience. Also,PS3 never grabbed me. The PS4 is pretty much \"meh\" to me too": 0, "#Win Microsoft Streets &amp; Trips 2013 ($39.95 value!) from @TheReviewStew! US residents only Ends 11-27 #giveaway http://t.co/KU7vYKUjc5": 0, "#XboxOne Xbox One: What to know about Microsoft's new console http://t.co/i8QPcmosCL": 0, "Best Microsoft Wireless Comfort Desktop 5000 Keyboard and Mouse Set UK Reviews http://t.co/iwZXmJNudv where to buy": 0, "Paramore: Here's a video of the choir from Rochester High School on stag... http://t.co/piCqrICHyX via http://t.co/ZY1cU2DvHH": 0, "@DwightHoward @Microsoft like you couldn't buy your own with your millions? Reason poverty exists the rich get everything free": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/oKfFc5QNzs via @smallbiztrends": 0, "Gift the rich lol\"@DwightHoward: Thank you to @microsoft for the #XboxOne, been checking it out today...WOW #veryexcited\"": 0, "Nov 23, Xbox One Sports Star Challenge with former @MapleLeafs @wendelclark17 at the Microsoft Store #Yorkdale .http://t.co/OhGomJBJTF": 0, "RT @SQLServer: Join Microsoft experts on 12/3 for improving performance with SQL Server 2014. #MVAJumpStart http://t.co/OxCANL9Rd9 #Msmva": 0, "Google laughs off Microsofts Scroogled merchandise stunt: Does Google feel intimidated by Microso... http://t.co/6GYIHk6R8e #Tech #News": 0, "Is David Sacks the Marissa Mayer of Microsoft? #VC #PE": 0, "Procedure on route to come out outweigh official in agreement with microsoft custody software: dnzR": 0, "I'm 60% down with the kids. I've got dubstep on my Microsoft Zune. How about you? http://t.co/5Jo4rmmfpo": 0, "#Professional Services firms in Australia looking to scale  http://t.co/luTQygQpqO #Cloud #WCM #BI #BPM #Microsoft #CA": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/gMA3GnOQsu": 0, "only 53 minutes left until I find out what microsoft tell me to do about the 430 brick in my house.": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/LGEXCDGM0H": 0, "The war begins! Gonna be fun! #gaming #gamersunite #ps4 #wiiu #xboxone #sony #nintendo #microsoft http://t.co/IhgFnfRIV8": 0, "FOR SALE!!! #xboxone #xbox #forsale #sale #hitmeup #ps4 #playstation #getyours #microsoft #live http://t.co/Aevy8p5VoO": 0, "Most voters think Microsoft t-shirts could outsell its gadgets. What do you think of Microsofts anti-Google merch? http://t.co/zTkSTAzM2g": 0, "Microsoft adds load balancing as Azure availability stutters http://t.co/vD5OEs2vJC": 0, "They're in the NBA and make millions, sooo why does Sony and Microsoft send free consoles?": 0, "Lol at Microsoft #XboxOne. You should of waited for the #PS4": 0, "Does anybody have Microsoft office they can share with me?! I'll give you money for it!!!": 0, "@Gigastormz Ha! I DO see what you did there! You used Sony's effective slogan because Microsoft doesn't have one! ;)": 0, "fuck you @Microsoft": 0, "The only 1080p game Xbox One got is Forza 5 when PS4 has the same games and most of them in 1080p. Fail. @Microsoft": 0, "RT @verge: Xbox One review: a game console with much bigger aspirations http://t.co/D43lDQkvbu": 0, "Microsoft Lifecam Studio webcam 19.99 at http://t.co/2TZU1s2qnk http://t.co/JCq7qTMK1a": 0, "The Foreign Bureau: WSJ's Global News Update http://t.co/dauquKCatq via http://t.co/3cVMRz99nh #worldnews": 0, "Microsoft, Washington state partner to offer free IT courses http://t.co/Uf9r2WPSRs #OnlineLearningNews": 0, "If Microsoft ships Windows without web browsers, it wouldn't have been sued, would it?\n\nhttp://t.co/Z0HQUys8vl": 0, "Where to Obtain Licensed Microsoft Word for Your Non-Profit Org http://t.co/EJH1xBU4p7": 0, "#iPadAir #NewNexus7 #iPadMini #iPhone5S #Microsoft #Surface2 What new devices and gadgets are you hoping lands under your tree this year?": 0, "RT @wesmaniam: Microsoft should put their Azure status page on AWS http://t.co/3uAr42qIl2": 0, "Enable self-service password reset for users.  http://t.co/hb8cNXktO5 #Azure 4 thumbs up!": 0, "RT @MicrosoftEMEA: @MSFTDynamics #CRM apps now available for Windows Phone, iPhone and Android http://t.co/LqhjWSccoG": 0, "@PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits get a room!": 0, "Introducing my Microsoft Xbox One.  System along with #NBA2K14 #MaddenNFL25 #CallofDutyGhosts http://t.co/Wer2RzVQHI": 0, "Microsoft printed LOTS of cards saying \"Xbox One is sold out\". They sold out on launch day (11/22/13) at midnight. http://t.co/pryz6nVLqK": 0, "Fuck you Microsoft": 0, "Help UCLA game design students in learning how to use feedback from players, use this link: http://t.co/WsLE7fK1Ne #Win8 #FunApps": 0, "@otterN9NE Microsoft Store in the Galleria had plenty earlier today.": 0, "RT @noog: One, 360, one - Someone at Microsoft counting to 3": 0, "Microsoft Xbox One gaming and entertainment system launched worldwide: Microsoft made a big s... http://t.co/x0sL7yuxA8 #DigitalTechNews": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/SZS8ikyz3k": 0, "@ItsChrisMoreno Where did you get your 3-10 days from? Microsoft phone support?": 0, "Microsoft xbox 360 white console SPECIAL CONSOLE LOOK HERE!: Price 75.0 USD ( Bids) End Time: 2013-11-23 17:21:24... http://t.co/ijB9rCsFZy": 0, "hey Microsoft where's my #xboxone Day Two Edition?": 0, "@BestShotHere (C) //CHOSEN ONE! IT WAS SAID I WOULD DESTROY MICROSOFT, NOT JOIN THEM! BRING BALANCE TO THE CONSOLE WARS, NOT LEAVE THEM (C)": 0, "I finally found someone worse than AT&amp;T for phone service. NEVER try to talk to http://t.co/jyNeK85wHE. 2 hours and counting!": 0, "Xbox One Launch Party Glows Green With Super Fans - Microsoft invited a thousand super fans to join the company Th... http://t.co/WLsYKlrpZq": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/Zm98V7qa7b": 0, "Rumor: Microsoft looking to shake up music streaming with Deezer? - http://t.co/MVmrfFQ7uL": 0, "O'Neill Peru: Backside Days !! http://t.co/cKyIkkmrug via http://t.co/mn3EFmuNyP #surfing http://t.co/zp1RCBSX7t": 0, "Video: Sneak peek: Cal for Windows Phone 8  - @Microsoft http://t.co/UeY9V29zax via http://t.co/7w1iqVHZ1T": 0, "Microsoft announces 1 million Xbox One units sold in first 24 hours http://t.co/4YvxRy7dBi by @beijingdou": 0, "RT @Microsoft_Gov: How We Can Reduce Street Traffic in One Beautiful GIF http://t.co/Y0GTKHa2Ji #ecohackmtl #mtl": 0, "I liked a @YouTube video http://t.co/NqyuQcNvq5 Microsoft Xbox One Console Overview - Newegg TV": 0, "RT @PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits": 0, "@Microsoft I need an XBOX ONE stat!": 0, "@DwightHoward @Microsoft yea wheres mine at": 0, "@MSFT4Work @MicrosoftStore Thank you. This is why I buy #Microsoft products, personal &amp; #business. #Office365 Business my latest purchase": 0, "@DwightHoward @Microsoft Dang Microsoft, where is my Xbox One? I can't hit my free throws either.": 0, "RT @qz: The Xbox One is Microsofts attempt to build you a better Wii http://t.co/b7s5QwSkUg by @phantomath": 0, "The Xbox One Launch Party In NYC Was Every Gamer's Dream: Microsoft went all out for the reveal of the Xbox On... http://t.co/qiXL3DsVrw": 0, "Apparently Microsoft are going to take care of its customers who are having problems. I wonder to what extent taking care of means -_-": 0, "hehe http://t.co/Wj7iBKYAkm Those tricks might work with the average government, but Microsoft is ten times smarter, a hundred times ...": 0, "@Microsoft This makes me want to play #Halo4 on my 360": 0, "VIDEO: Rumor: Microsoft Might Step In And Buy AOL's Winamp - http://t.co/Rg19TE67e5": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/duOurhhmat via @smallbiztrends": 0, "Microsoft has announced a successful Xbox One launch with over 1 million units sold worldwide in the first 24 hours.": 0, "@Twitter made a new version of its #WindowsPhone app available to smartphones running Microsoft's operating (cont) http://t.co/3HoJYFxFRj": 0, "#Microsoft se une a las promociones del Black Friday http://t.co/etDjdzaAOO": 0, "@CoolBlackGuy @HARD8TIMES @Microsoft I don't know anything about the launch yet. What went wrong with it?": 0, "Would Alan Mulally Be A Good Fit At Microsoft?: By Jacob Steinberg:At first, it started out as a speculation a... http://t.co/bx3HLx5iCN": 0, "That means using pen &amp; paper rather than Microsoft word. Fuck You elite stupid pyramid, im writing my book.": 0, "@DwightHoward: Thank you to @microsoft for the #XboxOne, been checking it out today...WOW\n\n-Can it teach you how to wear a condom?": 0, "RT @carolynmichelle: I've said it a million times but I still think it would have been amazing if Microsoft (MS) had called the new Xbox Ms": 0, "RT @The_Real_ReD_X: for anyone still looking for #xboxone there listed as in stock on the microsoft store": 0, "\"Microsoft in a Beef with Google, is like your Dad in a Rap Battle!\" - The latest Vergecast is hilarious! http://t.co/RTQVXM4FCY": 0, "@CozyBoyB: @forlorn_i That's a lie we ain't Microsoft that's what I heard, it's cheaper than Xbox one though": 0, "This is the Xbox One controller that Microsoft staff now own with their exclusive white consoles. http://t.co/IU5qfooXUg via @9GAG": 0, "RT @microcenter: RT if you want to win a #PS4 or #XboxOne ! Sign up here to win http://t.co/N5tK3pqJqS. #Microsoft #xbox #Sony #Playstation": 0, "I'm giving away: Microsoft Office FrontPage 2003 Bible. Check it out - http://t.co/wtyfKREXc7": 0, "RT @VideoGamesFacts: The white Xbox One that was auctioned off for charity by Microsoft. http://t.co/CwBylL7uST": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/hSuQWGcd3P #businesstrend": 0, "\"I got a Windows 2-in-1. It's like a laptop and a tablet.\" I thought Microsoft Surface was the one like a laptop and a tablet.": 0, "I liked a @YouTube video from @detroitborg http://t.co/yL4NKJFIIE Microsoft Xbox One: Unboxing": 0, "I'm giving away: Microsoft Office Access(TM) 2007 Inside Out (Microsoft Office Access Inside Out. Check  http://t.co/0VWCuRtvx4": 0}