{"This is for MLC Microsoft's New Xbox One Sells Out - Microsoft said it sold more than one million units of its Xbo...": 0, "Let there be ads.. my friend is installing Microsoft Advertising SDK :D\n#DVLuPday @dvlup @ParasWadehra @Salcedo_George": 0, "RT @lawdotcom: Sony's PS4 battles with Microsoft's XBox One #Legal #News http://t.co/hKYjzpjJkP": 0, "Microsoft video attacks Google's Chrome as surveillance technology http://t.co/HwRrnY9NpW": 0, "Forex Trading apps for Microsoft phones at Forex Trading Unlocked": 0, "RT @Microsoft: Have a great weekend playing #XboxOne, everyone! http://t.co/53SLjZCuLm": 0, "Microsoft's New Xbox One Sells Out - Microsoft said it sold more than one million units of its Xbox One videogame ... http://t.co/ztSyhnD2MX": 0, "Winamp may not be dead after all. Rumours are Microsoft want to buy. Interesting.": 0, "\"@Microsoft: Want to see what goes on behind this door? Right this way: http://t.co/f6rXfYM56B http://t.co/0S9xDwk409\" (HR my card please.)": 0, "on your PC and ps4 and pretend somehow that it's better just because Microsoft fucked up on marketing and turned down the retardation of the": 0, "Apple surpassed Mic... http://t.co/icJLrIuqn4 #technology #tech #technologyfacts #technologyfact #techfacts #techfact #facts #fact": 0, "And with Microsoft moving to a follower system all they really need to do is get their own streaming and messaging service internally": 0, "I should work for Microsoft": 0, "The uses of Microsoft Access for database design http://t.co/1LO2R4LzEy\n #accesstraining": 0, "Join Microsoft employees supporting ISHA Foundation and other youth causes #GivingHero: http://t.co/iUYR664Gtx http://t.co/bQAsjMH31A": 0, "Check out these funky dance moves! http://t.co/MsRiKIO8S4 #jd2014 #ubi #jdtv": 0, "About to gronk spike this controller into the ground. Microsoft piece of junk": 0, "Microsoft Solitaire Collection, Call of Duty, and Adobe Reader Touch apps for Windows 8.1 receive updates": 0, "Have an Xboxtastic day ahead! Wow, Microsoft tech support is hilarious today. Good job, guys.": 0, "RT @AJLinux: Check out these alternatives to Microsoft Outlook!  http://t.co/2EZmx7Q69g": 0, "RT @kaleigh_f: Whoever stole my copy of Microsoft Office is in big trouble. You have my Word..": 0, "Microsoft Flight Simulator 2000 (PC, 1999) 2 disc Software and Manual: $10.00 (0 Bids) End Date: Saturday... http://t.co/Yo8ZjgptwD": 0, "I added a video to a @YouTube playlist http://t.co/8ahKYb83tT Best of E3 Microsoft XBOX 360 Kinect": 0, "Help UCLA computer science students in learning how to use feedback from players, use this link: http://t.co/rad5IaoRsW #Win8 #FunApps": 0, "@XboxSupport1 \"Sorry, we can't change your Microsoft account right now\" Then it tells me to go to http://t.co/wlZHFSsjpl but that page died.": 0, "laughs because this is the 360 microsoft sent me": 0, "A bold campaign by Microsoft challenging Google .. How will they respond? http://t.co/BkIoQipn9g": 0, "@KittyBonkers dicks. One person msgd them because their console power supply was faulty. Games response? You need to contact Microsoft.": 0, "really, every business decision microsoft is making with the xbone comes across as disgustingly greedy with no respect for consumers": 0, "Thanks for the Defective Xbox One, Microsoft!: I knew Microsoft's (NASDAQ: MSFT ) new Xbox One wouldn... http://t.co/51erOle3ck #XboxOne": 0, "Microsoft appointment prep enhances drive pertaining to employees: QAxcj": 0, "South Park: \"MOM!! http://t.co/cPgpuBtLnb via http://t.co/tXjObGiDiU #tvshows": 0, "@KittyBonkers swap it for you, failing that, we suggest you contact microsoft for support!' Or something. The guys store sorted him out tho": 0, "RT @jhibbets: Munich tries to quit Microsoft, The Weather Channel goes open source, and more: http://t.co/laa8g0rab5": 0, "@cyberman1956 Hi, thanks for your feedback. If you would like to address these issues, feel free to email bizspark@microsoft.com. Thanks!": 0, "Couldn't get #XboxOne today so ordered it off Microsoft! Hopefully won't take long!?! #Waiting": 0, "RT @reddit_tech: Microsoft apparently negotiating to buy Winamp and other nullsoft tech http://t.co/RNST0JcHhx": 0, "Does anyone know how to use Microsoft Access?": 0, "I liked a @YouTube video from @thegamer2323 http://t.co/3Sjhp3DEcD Who Will Win This Generation? Sony Vs Microsoft (PS4 Vs Xbox One)": 0, "Don't know who to blame. EA or Microsoft.": 0, "fashion lady: new image http://t.co/vPcnKkDV3N #fashion via http://t.co/qiQqBbpNxe": 0, "RT @anitaboerboom: Found a bug in SharePoint? Get it prioritized into the agile backlog w the Microsoft product group: http://t.co/2OtPWqxP": 0, "I'd like to use this tweet to remind that software patent reform died in the House thx to IBM + Microsoft http://t.co/KEICYsmukA": 0, "just randomly attended a Macklemore concert in Jacksonville. thank you #microsoft": 0, "@Capcom_Unity dude... Dead Rising 3 is amazing! Great Job Capcom and @Microsoft": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/ynxxTI8GdB #microsoft #xboxlive": 0, "Drop 59% Price: Rs. 1,939.00. Paperback: Microsoft Office Outlook 2007: Introductory Concepts and Techniques (... http://t.co/ldsanF4fgz": 0, "@ILove2Run The Microsoft Store was the only one open. They had a midnight launch party for the XBOX One": 0, "RT @Cinderkin: Can't download a FREE game without a credit card? Are they fucking serious @Microsoft I hate @xbox now http://t.co/8G7GaUgxwT": 0, "RT @klonkadonk: I think I share this guy's feelings towards systems programmers. They're the real wizards. https://t.co/pqdCE9JZfs": 0, "ha, microsoft losing @GAFollowers Xbox One sold 1M units worldwide its 1st 24 hrs. The PS4 sold 1M units in the US &amp; Canada its 1st 24 hrs": 0, "Enhancing tread options in addition to microsoft software courses: MRZEHog": 0, "@PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits&lt; pure class": 0, "Advantages only applications in re microsoft outpace cultivation up-to-the-minute late fortnight: KLvnYeq": 0, "Holy shiiit thank god for autosave on microsoft word": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store http://t.co/4jK2kaBtsY #news": 0, "@iCrackUriDevice basically it's because Microsoft has proven to be a money hungry fool, especially with Windows Phone": 0, "RT @SocalSam: UCLA computer science students by reviewing their apps use this link to download the Win8 Store app: http://t.co/fPXpFHLZnR #": 0, "I added a video to a @YouTube playlist http://t.co/980axlFQhf Why I love my Microsoft Surface RT, Part 2": 0, "Drop 57% Price: Rs. 3,233.00. Paperback: Microsoft Office Word 2007: Complete Concepts and Techniques (Shelly ... http://t.co/yi0E9K0H6n": 0, "@deliasalcido: Did they make the new 100 bill with Microsoft office ?! http://t.co/WEGNRL60o1RT": 0, "10 things that you should know about Microsofts Xbox One http://t.co/0tEaFhFXHW": 0, "Googlers Love Microsoft's 'Scroogled' Gear. Mugs and Shirts Sell Out.  http://t.co/GQ6tunjO88 via @kashhill @lainnafader": 0, "RT @WindowsSupport: @Kiedd_ Thanks for reaching out. There is some troubleshooting info at http://t.co/IF8loaSS4U you can try. Keep us upda": 0, "$50 Microsoft GC giveaway from @UtahMomsLife: http://t.co/iC2pNdRaFZ": 0, "RT @CNETTV: What you need to know before buying the Xbox One: http://t.co/LNJxfHPOS0": 0, "@tim_cook Actions return to us sooner or later http://t.co/ojhUhaszsf Best way to break Android is through Chrome http://t.co/jZnwTo8Twu": 0, "I added a video to a @YouTube playlist http://t.co/Q9bDt0GKr9 Microsoft XBox 360 Kinect Funny People Playing Games in Pods": 0, "Microsoft to get EU nod for $7.3 billion Nokia deal: Sources http://t.co/B3DKNTH9HW": 0, "@abrasion it's an idiotic Microsoft campaign against Google: http://t.co/KeQJmpKAdO": 0, "UK MPs to move their files to Microsoft cloud service: http://t.co/tCeHc7Ey1L Has #Snowden taught them nothing?": 0, "'Keep Calm While We Steal Your Data': Microsoft takes shot at #Google. Learn how here: http://t.co/srAZHJM6xp": 0, "@PLongstreet leave it to #microsoft for shitty customer service.": 0, "RT @CambridgeTeache: Great day at Unconference at Microsoft Office Center. Great seeing Meg, Lenny, Paul, and Tim. Karyn - we missed you!": 0, "RT @EZXboxVIP: Welcome to #DayOne of #XboxOne! Thanks for celebrating launch with us! Check out our launch day blog &amp; enjoy #DayOne! http:/": 0, "@pushsquare @presidentevil40 Ouch Microsoft...": 0, "Thanks for a great event on Indie Game Development! #gamingonthesurface #jessefreedmeman @microsoft": 0, "UCLA computer science students by reviewing their apps use this link to download the Win8 Store app: http://t.co/fPXpFHLZnR #Win8 #FunApps": 0, "@Xbox if u ever decide to release the ONE without that spy cam/mic u call #kinect I'll continue to support microsoft...but only then.": 0, "you should be happy somebody does give a damn about you Microsoft. Because spiketv cant do it, nor your ad agencies.": 0, "RT @wehatesab: @chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/2Y8": 0, "Xbox One sales hit 1 million on first day: (AP) Redmond  Microsoft says more than 1 million Xbox One consoles... http://t.co/3olmJV3YUj": 0, "To spin or not to spin: Does Microsoft need Xbox? - By RYAN NAKASHIMAAP Business Writer LOS ANGELES (AP) -... http://t.co/YVapMs0PrR": 0, "Microsofts Major Nelson Thinks PS4 Remote Play Sounds Like a Great feature, Clarifies Previous Statement http://t.co/OcDY4ykyku": 0, "@AngryJoeShow just focus on ps4 no one in Europe is gonna buy shitbox 1 after the shit microsoft wanted to pull on US": 0, "Just met @SUGARRAYLEONARD in the Microsoft store in Las Vegas still can't believe it. #legend http://t.co/9siaM807fw": 0, "Book of Quote: new image http://t.co/Cm4OuA0qKH via http://t.co/gxktWhKfbI #quotes": 0, "#Microsoft severs ties with YouTube personality following #Xbox One event: #GameSpot: \"At the #Xbox One launch... http://t.co/lK10o2ViHu": 0, "RT @thimmyt: :d RT @lilwiziani: !!!!!!!\"@Boobs_r_big: WE REALLY DONT CARE BRUH \"@thimmyt: Dear Microsoft Word, I'm pretty sure I spelled my": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console Ready to SHIP w/receipt: $499.99 (0 Bids) End Date:... http://t.co/gT4ReBf1Ty": 0, "Color-cycling mouse for Microsoft Windows 7 and Mac OS http://t.co/5M52X97LGE": 0, "Microsoft Devices Head Says We Wont Have 3 Windows Versions in the Future @samsabri http://t.co/mu4qFfWHHy": 0, "Sony returns the love to Microsoft; sends congrats on Xbox One launch http://t.co/gh8oV5GTMU": 0, "Xbox One problems affect only a very small number of customers, says Microsoft http://t.co/4vpKj9yb0J": 0, "RT @Forbes: Microsoft's \"Scroogled\" Google-bashing gear proves popular with its competitor's employees http://t.co/nCUbYPn460 http://t.co/Q": 0, "I added a video to a @YouTube playlist http://t.co/i4Oy2W35ds Microsoft E3 2010 XBOX 360 Kinect Multiplayer Adventures Demo": 0, "For Microsoft/Haier/mobiado/Eten/Velocity Cell Phone:Desktop Mount Stand Holder: $14.87 End http://t.co/JFVUyMjZ4L": 0, "Microsoft should pull a Nintendo and name all of their XB1 games with One in the title to confuse buyers.": 0, "Microsoft's devices head: We wont have three Windows versions in the future http://t.co/qX0GuSOmIj": 0, "I added a video to a @YouTube playlist http://t.co/AVp18J54af E3 2009 INSIDE FINAL DAY Microsoft XBOX 360 Booth PavillionC": 0, "Ah, Chromecast through Xbox One, only because the guide features SUCKS. Keeps my HDMI clutter clean though. Thanks Microsoft &amp; Google &lt;3": 0, "this vt looks like it was put together with microsoft paint": 0, "gsyncit (3.8.49): gSyncit is a Microsoft Outlook add-in that allows for the synchronization o... http://t.co/K513YdiDFv #chocolatey #new": 0, "I just need to do this damn assignment. I need Publisher to do it. Only Microsoft Office program I don't have.": 0, "70-664 microsoft lync waiter 2010, configuring blue book is specially calculated cause professionals pertaining...": 0, "Now the #Guardian web pages are accesible agian in the #Chrome &amp; #Microsoft browsers. #FireFox": 0, "I added a video to a @YouTube playlist http://t.co/Qy2Z0Wb4DD 2012 CES News Microsoft Keynote Kinect TV Demo": 0, "Kesha: Exactly. #mycrazybeautifullife http://t.co/KrRZpoyTB0 via http://t.co/lZ21fxpl5d #celebs": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/Bw5Pb3bRc2 via @AppleInsider": 0, "RT @reiley: It's baffling to me how Microsoft can be so dedicated to pushing their awful Metro interface into every market unless they live": 0, "Microsoft Surface Pro 2. I'm officially broke but so far I like it http://t.co/N9y692mjcz": 0, "@themizarkshow yo son, stop messing with that Microsoft shit. Go get your PS4 so we can play some games": 0, "End of a era\n@EconBizFin: Soon 32,000 Nokiansincluding the former chief executive, Stephen Elopwill be Microserfs http://t.co/boVVr8mrtC": 0, "Remember what Microsoft expects your living room to look like, and what your voice to sound like, and what your body looks like": 0, "@Xbox Definitely the console for me, and I tried PS4..it was a major contender. But Microsoft wins; the TV link, mot http://t.co/RVX1zJVFzk": 0, "RT @appleinsider: iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/IWjj5Of0EK": 0, "Microsoft Xbox One (Opening Night!)- 500 GB Black Console: $650.00 End Date: Tuesday Dec-3-2013 16:02:44 PST Buy... http://t.co/BPR52dU3qq": 0, "RT @t_v_s_h_o_w_s: The X Factor: What's the time? http://t.co/X5dIB2w504 #tvshows via http://t.co/tXjObGiDiU http://t.co/QMnVwdbnN9": 0, "Microsofts Xbox One | First Look http://t.co/Ww1HyrcMkX #CONSOLE #GAME #GregKumparak #XboxOne": 0, "Just spoke to the @XboxSupport1 about my kinect problems, I might have to send it back to microsoft if I can't do the trouble shoot , (cont)": 0, "RT @ancientnose: Note to Microsoft: The only time I need a \"tablet\" is when I've got a Jeffing HEADACHE from using your dodgy OS #Microsoft": 0, "Microsoft should be congratulated for creating the first machine that suffers from pareidolia. #XboxOne": 0, "Check out these funky dance moves! http://t.co/IRaizfdQP5 #jd2014 #ubi #jdtv": 0, "Funny Videos: Baby doesn't like kisses! http://t.co/lKfzO1v2ND #funny via http://t.co/fnTDKnNbKt": 0, "Erik Spiekerman about Arial. Microsoft are terrible people, 35 billion dollars in the bank and they wont pay license fees (for helvetica)": 0, "Microsoft 70-672 oral examination check out eidolon: rVc": 0, "RT @allthingsd: Microsoft sold more than one million Xbox Ones in the console's first 24 hours. -by @heyheyesj http://t.co/TQE1DrF5dv": 0, "@Xbox Can get a free xbox one so me &amp; my sis can enjoy all the best games Microsoft has to offer?": 0, "RT @TechCrunch: Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours, But Takes 11 More Countries To Do It http://t.co/v3r2uF87": 0, "Lol microsoft had to promote Xbox one bc that shit wasnt even trending": 0, "I liked a @YouTube video http://t.co/YLeJla3oUE Xbox One Launch Party in the Houston Microsoft Store (Travel Vlog)": 0, "RT @PirateOrg: You like your coffee bitter? #Microsoft now sells the perfect anti-#Google mug &gt; http://t.co/NdLUS23Rfy": 0, "RT @MSFTResearch: Video of the Week: research makes key contributions to #XboxOne audio enhancements #MSRVOW #MSRLuminaries @Ch9 http://t.c": 0, "#Microsoft employees selling their I made this #Xbox One consoles on eBay #Tech #Gadget http://t.co/s0HYw3CNuw": 0, "I liked a @YouTube video from @hiphopgamer http://t.co/ceSXFqjgEK Xbox One Unboxing: Microsoft Has Finally Launched": 0, "Stupid Funny Pics: new image http://t.co/FLNKiV15RA via http://t.co/fnTDKnNbKt #funny": 0, "No videos till my microsoft account is fixed . Sorry!": 0, "UCLA computer science students better game design by using this link: http://t.co/n2nGwmlqng #Win8 #FunApps": 0, "Harness the power of data &amp; create a solution that best meets your customers needs with Microsoft Dynamics CRM #MsDynCRM #TheArtOf": 0, "#Repost Last night at the microsoft store. Loved these little guys! Jammed with us the entire set! http://t.co/tlzJaiRAui": 0, "Microsofts New Devices for the New Windows Ad Features the Nokia Lumia 2520 http://t.co/uZqrbe9Vbz": 0, "Think Positive to Make Th...: View more quotes at [http://t.co/FMRtHa6iN4] http://t.co/m3XTehwXFV via http://t.co/gxktWhKfbI": 0, "I liked a @YouTube video http://t.co/ume69g6M3z GS News Top 5 - Good Guys Sony and Microsoft + does PlayStation \"define gaming\"?": 0, "RT @tbhfuckoffpls: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/D7o77zVsE5": 0, "@chippy how much is microsoft paying you? lol": 0, "@chrisremo I'm not going to bother checking, but I bet the product website is found at http://t.co/68EsRssjnZ or similar.": 0, "You Are My Life: new image http://t.co/j9w1dNh2h9 via http://t.co/gxktWhKfbI #quotes": 0, "RT @MunsterMicky: @xboxuk hey my Xbox One came Broken in Box so I took it back for a Full Refund and will be getting a PS4 thanks again @Mi": 0, "@naairundis lmaoooo thats hilarious....also your boy Pierre Garcon should be at the Microsoft store": 0, "Windows Azure. I will conquer you. Be Warned. *right after I finish three more exams* #Microsoft #MVA": 0, "BookDesignTemplates @BookTemplates easily create beautiful books right in Microsoft Word. Get 30% off all November with the code: NANO30": 0, "Fashion: Which parts would you like to change?\nOvercoat&gt;&gt; ht... http://t.co/2lFB13eOf3 via http://t.co/qiQqBbpNxe #fashion": 0, "Yay, every new console is problematic. http://t.co/4mn3FcBHrl": 0, "Best British TV Shows: Always ^_^\n\n-TheGirlWhoWaited http://t.co/rvKk3NBQQ8 #tvshows via http://t.co/tXjObGiDiU": 0, "RT @PaulSlakey: Googlers Love Microsoft's 'Scroogled' Gear. Mugs and Shirts Sell Out.  http://t.co/GQ6tunjO88 via @kashhill @lainnafader": 0, "I'M BOUTA. DANCE AT OAK PARK. MALL ON THE XBOX BY THE MICROSOFT STORE": 0, "Halo - Xbox One (Video Game) newly tagged \"games\":               Halo - Xbox One (Video Game)By Microsoft     ... http://t.co/8ZAD2k559Z": 0, "Photoset: buzzfeed: Every Pixar movie summarized in terrible Microsoft Paint drawings. http://t.co/YW54FavG9k": 0, "Evaluate and give pointers to students by installing this Win 8 app http://t.co/Durvmwgmuw #windows81 #seo #CallOfDutyGhosts": 0, "RT @GamerNewzDaily: Microsoft has announced that the #Xbox One has surpassed 1 million sales in 24 hours worldwide http://t.co/k0ciemWiLw": 0, "I added a video to a @YouTube playlist http://t.co/4WSDB6npXZ MICROSOFT ANNOUNCES NEW XBOX 360 S KINECT PRICE HARDCORE GAMES 2011": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs... http://t.co/xVFSZzqnT8": 0, "Bellevue Directory  Real Estate Listings Bellevue Washington and the East Side microsoft http://t.co/lhGp22UnaM": 0, "@wingmanradio seriously? That's gotta be a huge overlook by Microsoft": 0, "Sony &amp; Microsoft Both Sell Over 1 Million Consoles Each in 24hours.: http://t.co/jfk1kwpo4o": 0, "Report: Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/JNoiVbMdrh": 0, "@bizspark MS 8.1 is crap you shuld be ashamed MicroSoft!": 0, "I Love Funny Pics: new image http://t.co/tl09191RfT via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft sells 1 million Xbox One consoles on launch day - Microsoft says the launch of the Xbox One on Friday ha... http://t.co/eeLkgRxsUe": 0, "Microsoft Addresses Xbox One Hardware Problems http://t.co/SZiywHwCgM": 0, "@quinndelhoyo @ASTROGaming anybody figure the work around yet? What a Microsoft joke!": 0, "#XboxOne Xbox One Sells 1M Units in 24 Hrs: The brand-new Xbox One celebrated Microsofts biggest game console... http://t.co/aMlS0LUEJ6": 0, "Help UCLA game design students in learning how to use feedback from players, use this link: http://t.co/GWSXN0xXem #Win8 #FunApps": 0, "@XboxSupport can Microsoft speed up the release of the headset adapters please?": 0, "Microsoft and Sony are on the right track with Twitch integration and streaming, Nintendo just needs to realize the future of media.": 0, "Microsoft plans Office 2013 SP1 release, updates SkyDrive app for iOS 7 - IT News from http://t.co/IfyzjRp443 http://t.co/41HhEiiluk": 0, "RT @ITProPortal: Ballmer stresses importance of a unified Microsoft in final shareholder address: Microsoft... http://t.co/DeIcwj7zuR #tech": 0, "VIDEO: Microsoft Sells 1 Million Xbox One Units In First 24 Hours http://t.co/ZOWVI5CRJe": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/7ZNaa1yuiy": 0, "I liked a @YouTube video http://t.co/VQ5XazLreL The Making Of Yoteslaya Limted Edition Microsoft Xbox One (Only Model)- 500 GB Black": 0, "#4: Microsoft FrontPage 2000 [OLD VERSION]: Microsoft FrontPage 2000 [OLD VERSION] by Microsoft Software Platf... http://t.co/D2J5wJyWFn": 0, "@ms_TUFFANY inb4 Microsoft makes a headset worse than the stock one and demands money.": 0, "I'm entering a giveaway on http://t.co/NBBjcku30O.  You should too. http://t.co/sMQrKDYwoG": 0, "@XboxSupport no. I live in canada. Apparently our cable companies have not reached a agreement yet with Microsoft": 0, "Microsoft sells over 1 million Xbox One consoles in less than 24 hours - Pocket-lint\n\n http://t.co/HnumzMPe2y": 0, "HA! RT @chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/dmOqkCIlL2": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console New In Box: $539.99 (0 Bids) End Date: Saturday... http://t.co/fBK5EG3xJb": 0, "RT @bill_slawski: Steve Ballmer is begging his successor not to kill the Xbox http://t.co/cuC1UyRiE5 (I question Microsoft selling off Bing": 0, "@Random_Factor the dude at microsoft whose name escapes me literally thought \"the eurozone\" was one country": 0, "41 Xbox One | Microsoft's Xbox One hits store shelves | Review: Xbox One falls short of promised revolution |... http://t.co/bL4peF9zMd": 0, "Well, let's just say I think that is the right direction for Microsoft to take with advertising. None of that Scroogled crap!": 0, "@LizzumsBB @GAMEdigital Microsoft have sorted it but just disgusted by games response": 0, "@deeWaffle and The rams on ps4 GGDR5 was faster before Microsoft added enrezem feature to the rams of x1": 0, "AND IT HAS A FULL CHARGE HAHAHA THIS IS AWESOME TAKE THAT MICROSOFT": 0, "MMA Fight Club: new image http://t.co/jVh1Dj1O01 via http://t.co/ABUaH7ML8Q #mma http://t.co/yoSNfT14eM": 0, "Chicago Did Y'all Raise Enough Hell To Get Me Into http://t.co/nWggjy519g Trustee Department? I Wonder If Their Support Team Knows Me Or&gt;&gt;&gt;": 0, "@PlayStation @Xbox @Microsoft aaahh healthy competitive friendliness :-) now again, JOIN FORCES &amp; MAKE THE ULTIMATE CONSOLE EVER!!!": 0, "Microsoft Word keeps auto-correcting 'Allah' to 'Alan' #NotQuite #NotSureMyIslamicTeacherWouldGetTheJoke": 0, "Collection of cool, nice,...: new image http://t.co/LyLvdXjXkt via http://t.co/fnTDKnNbKt #funny": 0, "iOS: The iPhone 4 is 3 years old, but well give you iOS 7. \n\nAndroid: The lucky ones get updates. \n\nMicrosoft: No phones can upgrade. None.": 0, "I like how @plibin of Evernote aims for products whose perceived value increases with time. Microsoft Windows fails that test. @founding": 0, "I think it's time to betray Microsoft, they just could not compete with Sony in terms of marketing their product well.": 0, "@Xbox @Microsoft Just reached another gaming milestone! http://t.co/olB24XzyqV": 0, "\"FREE eLearning: Virtualizing Microsoft SQL Server 2012 with VMware [V5.X] Fundamentals\" http://t.co/yb2Awr6hP5": 0, "#DiduMissThisOnKokonsaGH: Microsoft set to move in to Nokia's Espoo headquarters http://t.co/D53YgNPPuZ": 0, "RT @jmtd: https://t.co/TqjU7mlcTl I enjoyed this love letter to systems programming": 0, "RT @HuffPostTech: Microsoft sells over 1 million Xbox One consoles in 24 hours http://t.co/bxMjIA8i6w": 0, "Microsoft's New Xbox One Sells Out - Microsoft said it sold more than one million units of its Xbox One videogame ... http://t.co/Cex17ipYww": 0, "COME AT ME film essay, I will make Microsoft word my BITCH #suckerpunch #die #thishasbeenmysaturday": 0, "Check out these funky dance moves! http://t.co/sY7rU4ItXE #jd2014 #ubi #jdtv": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/Gm6JZqYKn2": 0, "Microsoft severs ties with YouTube personality following Xbox One event http://t.co/iw9ojfi3Bt": 0, "@CuriousClive strange they are different. I got mine through microsoft store...?": 0, "Here are some astounding Wallpapers From the Artist CygX1 http://t.co/0PByS9KQdk": 0, "Awesome game I didn't know existed... #organicpanic #gamingonthesurface #microsoft http://t.co/BoxrbeIGRm": 0, "RT @findingdealz: ACT FAST! There R some Xbox One still available! http://t.co/f8EAdGVSR2 #gaming #console #xboxone #xbox1 #microsoft #syst": 0, "#XBoxOne #TheGreybackpack launch party #killerinstinct #gamers #microsoft @ The Gamerz Watchtower http://t.co/5ORVknTDnd": 0, "Just a microsoft watch. With BSOD. [pic]  https://t.co/NC2UShA7MD": 0, "If Microsoft got anything anything right, it's their collab. with Pizza Hut: I'm now Forza's biggest fan.  #callmefat": 0, "Sony would do something, Microsoft would try to match it with something similar and fail miserably.": 0, "I added a video to a @YouTube playlist http://t.co/bRRZ9JlBZy 2012 CES Microsoft Booth Breaking News Tech": 0, "Handing out a box of Microsoft swag to the family. http://t.co/IWY8pZzpe2": 0, "Missed it?: Video: Was iOS 7 Created in Microsoft Word? http://t.co/qs8aNtrTN0\n #iPhone #iOS": 0, "I added a video to a @YouTube playlist http://t.co/vsWt3FwxlG Microsoft XBOX 360 Kinect": 0, "#Sony returns the love to #Microsoft; sends congrats on #Xbox One launch #Tech #Gadget http://t.co/SIi8DowoKB": 0, "#BanginGummies #XBoxOne #XBox #DayOne #Microsoft #XBoxController #GameOn #Kinect #IGotOne #WeGotOne http://t.co/LISf2N8pQc": 0, "I added a video to a @YouTube playlist http://t.co/KgOYiCd2hz Your Shape Demo Microsoft E3 2010 XBOX 360 Kinect Fitness Video Gaming": 0, "227's YouTube Chili' Microsoft Office 2013 Activation [NOVEMBER 2013]-www.keygen4u.com: \n\n... http://t.co/3m0bX0e89Q Jamaal Al-Din - NBA": 0, "Microsoft employees selling their I made this Xbox One consoles on eBay http://t.co/1dR266Q2CI": 0, "#PS4 #Nextgen Microsoft's Major Nelson Thinks PS4 Remote Play Is \"a Great feature,\" Clarifies Previous Statement http://t.co/RFr2mw2geg #fb": 0, "RT @Joe_Gatto: Hey @Microsoft , thanks in advance for the #XboxOne .... setting it up now! #gameonbitches": 0, "Microsoft Excel's best secrets, saving you time &amp; frustrations http://t.co/nopao9CESS": 0, "@hellodlo Microsoft is the anti-pattern of everything, really.": 0, "RT @microsoftcanada: Harness the power of data &amp; create a solution that best meets your customers needs with Microsoft Dynamics CRM #MsDyn": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/hDiUqsf4FS": 0, "I like Windows 8. But, Metro doesn't make sense on a PC and desktop makes little sense on the Surface RT tablet. Easy fix #Microsoft #2cents": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs: One of the first concerns fac... http://t.co/CRAdqfeL13": 0, "*facepaws when he sees people walking around with an xbox one in their bag* I'm not even a fanboy but c'mon, Microsoft sucks, again!": 0, "The NEW MICROSOFT SURFACE 2 TABLET is Available Now on Amazon at http://t.co/qvJhu31MHc": 0, "did i tell y'all im certified for Microsoft Word now?": 0, "Microsoft Corporation: 111 (+0.36%) http://t.co/VMHghcR6Wq $MSFT #Microsoft": 0, "Microsoft Project 2010 Course Monday Only $499 save big time...\n\nI have a two day course on Monday in Microsoft... http://t.co/NHg7d4sOWh": 0, "We'll Microsoft suspended me again god knows how long it will take to get xbox live back": 0, "@bomani_jones @kenan14 At the last minute Sony opted to take off the camera and sell their units for 100 less than Microsoft.": 0, "Just played Xbox One with @SUGARRAYLEONARD at the Microsoft store in Las Vegas. Thanks for being a good sport. http://t.co/c4OS7yszgp": 0, "UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/5qHpLDoHMO #Win8 #FunApps": 0, "MMA Fight Club: new image http://t.co/1icBck3n0a #mma via http://t.co/ABUaH7ML8Q http://t.co/817cLbFK2p": 0, "\"Biggest Xbox launch ever: Microsoft says it sold 1M Xbox Ones in less than 24 hours\"  http://t.co/gPl9vy2AR6": 0, "One Direction: If you didn't just see this on your screen then you're no... http://t.co/DTnmEh9gJY via http://t.co/ZY1cU2DvHH": 0, "RT @dankurka: Munich now completely ditched Microsoft in favor of Linux and it is working great. Proud of my city and its devs: http://t.co": 0, "Google employees are rushing to by the Microsoft gear that makes fun of Google http://t.co/M4ucpAPOPk http://t.co/pmjj2Fsx4f": 0, "@kinaton In the meantime, mind letting us know how we're doing here on Twitter in a survey: http://t.co/IluZpFoxpl? Thanks! ^DJ": 0, "Enable users to sign into your #ImagineCup apps via social accounts with the @WindowsAzure Getting Started Guide. http://t.co/qlTmefWZLS": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs [apple] - AppleInsider - Frontpage .. http://t.co/e9mt7gHwQ6": 0, "Sony Congratulates Microsoft on Launch &amp; New Titanfall 'Surprises' Coming Soon http://t.co/BoaPF07DC1": 0, " http://t.co/vorJ37hflx 2 Xbox One | Microsoft's Xbox One hits store shelves | iphone4 case | black christian people meet": 0, "Microsoft takes over Times Square for Xbox One launch Console... - http://t.co/C2MQcPANUp via @shareaholic": 0, "PARALYMPIC_crew: Brazil football 5-a-side Team - 2013 Paralympic Award \"... http://t.co/s22fTUfLCI via http://t.co/jDAwU42y28": 0, "No not in the slightest @sarahcuda: Is David Sacks the Marissa Mayer of Microsoft? http://t.co/wXhLIrHF32 via @pandodaily": 0, "Ballmer Defends Xbox, Bing as Key Microsoft Components - Tom's Hardware Guide http://t.co/XcujibaBwL": 0, "RT @LMAOComedyPics: That awkward moment when Microsoft Word informs you your name is spelt wrong. http://t.co/fPV23e0Z2k": 0, "RT @PaultheNerd: BUT after Microsoft got shitty with the 'Congratulations on your launch, Sony' thing I find it funny that they screwed up ": 0, "F*ck you Microsoft! -.-": 0, "Xbox One review\n http://t.co/UnsH1VGpme": 0, "Microsoft's New Xbox One Sells Out - Microsoft said it sold more than one million units of its Xbox One videogame ... http://t.co/CmQYdahnu9": 0, "The next incarnation of #Nokia, though much shrunken after parting way with its devices division, will be no minnow http://t.co/0ELrpuGaBG": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs: One of the first concerns fac... http://t.co/kskUDCfGYl": 0, "@XboxSupport3 yes I did. Is this a problem at Microsoft or is it my xbox one?": 0, "RT @SFPublicLibrary: Amazing lineup of courses/tutorials #LearningExpress. Including popular softwares. #photoshop #dreamweaver #microsoft ": 0, "UCLA game design students improve their design chops use this link to download the Win8 Store app: http://t.co/cQVS970exd #Win8 #FunApps": 0, "RT @IMJulieWatson: Microsoft Shows off XBox One. I'm just a Wii bit jealous. http://t.co/7RbtMFvfuQ": 0, "Enter to win a 1-Year Microsoft @Office 365 Home Premium so you can #GetItDone! Via @BayAreaMommycom! http://t.co/11PZ0J4NsW": 0, "2 Reasons Microsoft Needs a New CEO Now http://t.co/l1lUzVs1aA http://t.co/tpBU3rmUDi": 0, "Scott Walker: Great shot of the ax!  Congrats #Badgers! http://t.co/tLBwBBBNgh via http://t.co/hdZI6v6ii9 #uspolitics": 0, "@tim_cook  Actions return to us sooner or later http://t.co/ojhUhaszsf  Best way to break Android is through Chrome http://t.co/jZnwTo8Twu": 0, "Cineminha por conta do Skype!!! Tnks Microsoft (@ GNC Cinemas for Thor: The Dark World 3D w/ @zigorpaim @lpg_br) http://t.co/remHdARuBi": 0, "#XboxOne #Nextgen Review: Ryse: Son of Rome For the glory of Microsoft! | Clearance Bin Review http://t.co/8flJKPmL8G #fb": 0, "Just in for PC:\n\nMicrosoft Plug and Play Sidewinder control Pad\n\na simple but effective controller, works... http://t.co/zO1hmw0JzH": 0, "Microsoft severs ties with YouTube personality following Xbox One event - GameSpot http://t.co/ln6hwM96DH #Youtube": 0, "Nokia, once the world's biggest mobile-phone maker, is reinventing itself. Again http://t.co/jwP37Cc1cK": 0, "Whoever stole my copy of Microsoft Office is in big trouble. You have my Word.": 0, "RT @OXMUK: An unlucky few Xbox One owners are reporting faulty disk drives. Microsoft working to help those effected: http://t.co/wh97Z8tUz4": 0, "What the Xbox One means to Microsoft http://t.co/edUfYK45vr": 0, "Microsoft has announced that the #Xbox One has surpassed 1 million sales in 24 hours worldwide http://t.co/k0ciemWiLw": 0, "RT @Retron8: I've got to hand it to Microsoft. As Lottie as I care about the XBone, that was one smooth launch.": 0, "RT @Jordan0Bradford: @zStarGames be hilarious if microsoft decide to send you a brokenbox one": 0, "@Xbox Definitely the console for me, and I tried PS4..it was a major contender. But Microsoft wins; the TV link, motions, and sounds..wow.": 0, "Microsoft's Major Nelson Thinks PS4 Remote Play Is \"an excellent feature,\" Clarifies Previous Statement - http://t.co/wZXAdZbGpp": 0, "UCLA game design students in learning how to use feedback from players, use this link: http://t.co/B1NNUa0HBX #Win8 #FunApps": 0, "RT @Survious1977: http://t.co/UtVkkHl0sr Saying #sony lack of games but quotes Ryse on the #xboxone.": 0, "Assist UCLA game design students understand usability in games by reviewing their game, use this link: http://t.co/Rjt4KJFp8R #Win8 #FunApps": 0, "Lines long for Microsoft's Macklemore &amp; Ryan Lewis concert at St. Johns Town Center http://t.co/VQyBjHb5xe": 0, "RT @Jason_81_: If Microsoft gave me 0.1% of all the money they have spent advertising XBox One I would be a millionaire": 0, "I think I share this guy's feelings towards systems programmers. They're the real wizards. https://t.co/pqdCE9JZfs": 0, "Microsoft Solitaire Collection, Call of Duty, and Adobe Reader Touch apps for ... - WinBeta http://t.co/1aycuX2iNS": 0, "Seriously Microsoft? You can't get Silverlight on the Surface RT. Sigh...": 0, "Google scoffs at Microsoft's Scroogled merchandise attack with 'wearables' t http://t.co/rQe7iY6eiU http://t.co/LSKsmgqbEc": 0, "I made a new Microsoft account when I got my Xbox One, so tweet me your gamertags so I can add you guys.": 0, "@tomwarren Microsoft should have exchanged their Android licensing $ for a deal to use Google voice recognition on the Xbox.": 0, "RT @ducidni: Microsoft, I love you http://t.co/KZxDvtN1nl": 0, "RT @WindowsSupport: @Kiedd_ You're welcome. There's also performance improvement info you can try at http://t.co/D7ovI2a26x. Let us know ho": 0, "Having a brother-in-law in Microsoft's game division might mean a coveted white X-Box controller's in the family now. Jealous/proud.": 0, "@seb851 pas possible. http://t.co/ywLcVPIjpQ": 0, "I liked a @YouTube video from @hiphopgamer http://t.co/U0L0Pro6fZ Xbox One Unboxing: Microsoft Has Finally Launched": 0, "Software comp cant make better product so they resort to diff MKT and merch approach.one job,make software #mang3778 http://t.co/7GtBd9it5h": 0, "#TipOfTheDay: To help minimize the risk of online predators, use family safety settings in your PCs &amp; gaming consoles http://t.co/lZJf0Mfuf6": 0, "Love Life And Life Will L...: Yummy http://t.co/E7XGd5Lxe3 via http://t.co/gxktWhKfbI #quotes": 0, "Microsoft, we have a problem: Microsoft launched the Xbox One Friday, and the damage reports are already coming in. http://t.co/A6letqffhU": 0, "Microsoft Research Connections Blog - Site Home - MSDN Blogs http://t.co/ht6EjZFT3p": 0, "Hopefully my parents bring me Microsoft points for my gamer tag change &amp; movies Sunday  + my hair dye, but it's ok about the hair dye. ha": 0, "@ChimeraLeague3 Microsoft bought exclusive rights for it for there launch": 0, "AP Top Stories Nov. 23 P http://t.co/FTmtGErvh2 via http://t.co/3cVMRz99nh #worldnews": 0, "RT @techiblog: What the Xbox One means to Microsoft http://t.co/fFrG3vDPr0": 0, "Redmond Pie RSS Office Remote For Windows Phone Lets You Control Microsoft Office Documents On Your PC http://t.co/mKp5UMiwLw": 0, "Microsoft wants to sell you anti-Google mugs and t-shirts http://t.co/9WRfB0sJcz via @verge": 0, "The #Iroquois use the term #marijuana to refer to #Cannabis #sativa. http://t.co/phGDqAKlSH": 0, "I liked a @YouTube video from @austinnotduncan http://t.co/fctOXaiCbw Microsoft Xbox One Unboxing!": 0, "\"Figure 2: our new protocol is clearly better.\" -  http://t.co/iMUhHy2x3c": 0, "#Microsoft fuck you. Everyone should be using #Apple .... #iMac for the win. Maybe MacBook pros, MacBook Air and MacBook White too.": 0, "@BestBuy_Deals fuck xbox one and Microsoft.": 0, "Hey @Microsoft, my #XboxOne and my #Xbox360 both broke within 48 hours of each other, getting a refund for both and upgrading my PC. Thanks.": 0, "Assist UCLA game design students better game design by using this link: http://t.co/OXWtlVz8ho #Win8 #FunApps": 0, "@karissajoyyy Yeah I guess you could say I'm pretty much a master of Microsoft word photo editing...": 0, "I liked a @YouTube video from @austinnotduncan http://t.co/liGUUF0G9S Microsoft Xbox One Unboxing!": 0, "Remember when I got kicked out Microsoft at mall if America for hounding the chair! HAHA @_walford_": 0, "Universal Document Converter 6.2 (Demo) - Universal Document Converter enables Windows users to save Microsoft Wor... http://t.co/KNljNKpbRE": 0, "I can't wait to graduate and get a real job... Hopefully with Microsoft": 0, "The Golden Age of Watching Other People Play Video Games: Its too soon to know whether Microsoft or Sony will... http://t.co/JyHOboB1bh": 0, "PS still have those weak controllers. Ima stick with Microsoft on this one.": 0, "RT @NeowinFeed: Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/ynxxTI8GdB #microsoft #xboxl": 0, "TortoiseForum: Any  Puter' Geeks?: Anyone know how to open this kind of file ? \nMicrosoft.... http://t.co/55aNU0Cote #reptiles #tortoise": 0, "Nintendo congratulates Sony and Microsoft! http://t.co/8lJpAxVizE": 0, "Microsoft wants your Xbox One wireless controller designs http://t.co/TlrpkqC68q via @slashgear": 0, "Microsofts New Xbox One Sells Out: Microsoft said it sold more than one million units of its Xbox One videoga... http://t.co/2hIxOsP7yr": 0, "Guess I'm going dry tonight": 0, "After PS4, Microsoft sold more than a million Xbox One consoles in a day http://t.co/0cUWorBg0z": 0, "Post Edited: VIDEO: Microsoft Sells 1 Million Xbox One Units In First 24 Hours http://t.co/4fHoJPhOAP": 0, "Here are some Celebrity Pencil Drawings from Various Artists See: *** http://t.co/1ImoLWlR7r": 0, "Xbox One Microsoft strategy analysis: dry run for One Microsoft | BGR  http://t.co/oHwgn90OT1": 0, "Digital River question: Order Of Microsoft Office. I need to have my product key for my download of Microsoft Offic - http://t.co/PnRLUr6Bw7": 0, "Report: Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsoft's Kinect http://t.co/y8mL2bMiGo": 0, "Microsoft, call your bank, etc.": 0, "Microsoft needs to sort their shit out yeah? Yeah": 0, "I liked a @YouTube video from @thegamer2323 http://t.co/HK4ByPUdg6 Who Will Win This Generation? Sony Vs Microsoft (PS4 Vs Xbox One)": 0, "So, apparently the XBox contingent are a lot classsier than the http://t.co/LWItr71Wdd http://t.co/YtlM0QPSWg vs http://t.co/VagKhh6POT": 0, "That one annoying kid that hogs the Xbox One in the Microsoft store.": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/d5VaD5uf0e": 0, "RT @CherryGtTht_TNT: @chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http:/": 0, "RT @cupcakelynda: Microsoft Word just suggested that I change \"you're\" to \"you is\" so yes, I am very very afraid of what the future of educ": 0, "XBOX ONE SELLS 1 MILLIONS UNITS IN 24 HOURS #XboxOne #Microsoft #Xbox http://t.co/AEvd1Y4wUR": 0, "#scroogle campaign from @microsoft is just embarrassing. Never thought needed attention in such a poor way!": 0, "I added a video to a @YouTube playlist http://t.co/39fG66tN1A CES 2012 News Ryan Seacrest Kinect XBox Highlights Microsoft Keynote": 0, "Microsoft founder Paul Allens new $27 million mansion http://t.co/qfH94UDEbX": 0, "BIRCHBOX: We got an exclusive behind-the-scenes look at the making of de... http://t.co/UCC8ho0I1A via http://t.co/qiQqBbpNxe": 0, "Download Microsoft Office 2010 to Your Computer Now to Increase Productivity http://t.co/hqvSCc5ZBx": 0, "#Microsoft employees selling their I made this #Xbox One consoles on eBay #Tech #Gadget http://t.co/2QchJHbl7q": 0, "Huge day for Xbox!\nhttp://t.co/lTvYdE4LeW": 0, "Apple almost acquired the technology for Kinect before Microsoft, but they were described as \"a pain in the ass\" in negotiations. #applefail": 0, "RT @eurogamer: YouTuber KSI dumped by Microsoft after Xbox One launch appearance - http://t.co/VRKwu0Lad6": 0, "Xbox One Key To 'One Microsoft' - InformationWeek  http://t.co/RKo1qGa3d2": 0, "Can I really get on board with a campaign taking jabs at Google coming from a tiny little start-up like Microsoft? http://t.co/cX9bXUn4hC": 0, "8 hrs with Microsoft and still cannot fix Outlook/BCM for Windows 8.1 Five people later on hold for an hour still! #Microsoft MAC time": 0, "Microsoft Windows 7 Home Premium: 9 Offers for Microsoft Windows 7 Home Premium from $68.59 http://t.co/GVmuU5yu8q": 0, "Microsoft, Skype, and Xbox Being Used To Spy - Exposing The Truth http://t.co/5vjfon4oHm": 0, "Bah, Humbug! Microsoft Wants You to Stock Up on Anti-Google Merchandise http://t.co/xJ0FlqXBB3": 0, "I added a video to a @YouTube playlist http://t.co/3NRgtrZz3N Microsoft Kicks Off 2009 CES Breaking News": 0, "RT @Pureinfotech: ICYMT: The Xbox One video #Microsoft didnt want you to see  Pureinfotech http://t.co/c8MvZc6uIz #xboxone #xboxonelaunch": 0, "New post: Source: Microsoft In Talks To Buy Shoutcast http://t.co/aU5K6zaF1B #Web #Internet": 0, "@Microsoft made the #XboxOne way too achievement heavy. The constant alarms of meaningless achievements is extremely distracting.": 0, "Ballmer Defends Xbox, Bing as Key Microsoft Components - Tom's Hardware Guide http://t.co/YY597bnRMT": 0, "Thank you to @Microsoft for your commitment to diversity at work. https://t.co/rtSh0Nwobp": 0, "@iamdetboi: Whoever stole my copy of Microsoft office is in big trouble.. You have my word &gt;: ( haha my kind of gag": 0, "I added a video to a @YouTube playlist http://t.co/j1MMAlDVNA Microsoft Kinect E3 Bathroom Marketing LA Convention Center": 0, "http://t.co/UtVkkHl0sr Saying #sony lack of games but quotes Ryse on the #xboxone.": 0, "[DailyHerald Biz] Google, Microsoft modify search in Britain to exclude child porn results http://t.co/e1HAjnsFO9": 0, "Microsoft hops on 3D printing bandwagon with Win 8.1 app": 0, "RT @applenws: iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/ZMGyfre9UL #apple": 0, ":/ RT @RezilientKas: Microsoft Word tho. RT @rihluminati: Me: http://t.co/QsqnoR25RY": 0, "@rayf2f My cell is +1-904-465-3577. Can you Skype an int'l # for free? My job uses Microsoft conferencing software so I don't Skype much.": 0, "#Microsoft Store #app for #Windows Phone adds ratings and reviews in latest update #Tech #Gadget http://t.co/uMxH4tw9xp": 0, "Yahoo slams Microsoft Outlook in eccentric memo, even though most of them use it http://t.co/bNZbCgm6gl": 0, "What the Xbox One tells us about the new Microsoft' http://t.co/fBQwM1GrcH via @Appy_Geek": 0, "Video: Microsoft and Nokia ready for long fight http://t.co/NbwzpC7G80 via http://t.co/k9ajYFzHCd": 0, "#Xbox One Key To 'One #Microsoft': InformationWeek: #Microsoft sold more than 1 million #Xbox Ones within 24 h... http://t.co/wpUsU8vrLS": 0, "Front Faceplate Face Plate for Microsoft Xbox 360 Pink  http://t.co/v4nZei0mzE": 0, "Loving the new Xbox. Still can't believe the @EBGamesCanada that blatantly threw Microsoft under the bus in effort to sell me the warranty.": 0, "RT @MelhemMaher: #XboxOne top ten features. http://t.co/QevE99wdrr #gaming #microsoft": 0, "will download microsoft office 2010 again..-___-": 0, "RT @martyjdurbin: .@Microsoft and @eBay turn to natural gas to increase data center efficiency, decrease emissions. http://t.co/KAmpMOQXf8": 0, "RT @dippicus: Big S/O to Microsoft's advertising department, they know how to attract their target audience": 0, "#Sony returns the love to #Microsoft; sends congrats on #Xbox One launch #Tech #Gadget http://t.co/7mwNsO9EQP": 0, "@chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/SafGX78rCp": 0, "227's YouTube Chili' Microsoft office 2010 key - Microsoft office 2010 crack /serial/keyge... http://t.co/y7zVz3WIdo Jamaal Al-Din - NBA": 0, "Microsoft sells over a million Xbox Ones in under 24 hours http://t.co/XaE5smoiTF": 0, "RT @chanelwhale: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/l27kkc5jyp": 0, "@maximilian_ @berserker_mike dedicated servers man ... What a beautiful thing for #Microsoft to include for developers to use": 0, "RT @Forbes: Microsoft sold 1 million plus units of the Xbox One in its first 24 hours on sale http://t.co/EVXJcq4RqT": 0, "Sony Congratulates Microsoft on Launch &amp; New Titanfall 'Surprises' Coming Soon http://t.co/IWRAmzSv9z": 0, "RT @GeorgeBray: One million #XboxOne's sold *globally* (except for Japan) -  #Microsoft can't be happy when the #PS4 did that number in Nor": 0, "The X Factor: What's the time? http://t.co/X5dIB2w504 #tvshows via http://t.co/tXjObGiDiU http://t.co/QMnVwdbnN9": 0, "5 Key CEO Qualities of the Microsoft Ballmer Successor http://t.co/DURNmaOA1W": 0, "Why does Microsoft word love to fuck up right when I got to type up my essay SMFH": 0, "@JonSlaviero what's going on tonight that's cool??": 0, "Microsoft's New Xbox One Sells Out - Microsoft said it sold more than one million units of its Xbox One videogame ... http://t.co/YXeWGRZJhu": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/FIIDaL5r7M": 0, "I added a video to a @YouTube playlist http://t.co/zAmdXMBpzp E3 2010 Best Dancer on Microsoft XBOX 360 with Kinect": 0, " http://t.co/IjWQYDBbfH 93 Xbox One | Microsoft's Xbox One hits store shelves | ios 6 1 3 jailbreak |": 0, "RT @BrittsTVTweets: Anyone know if Microsoft has a free trial for software? I need Publisher.": 0, "@leodon1050 Thanks for clarifying. The steps at http://t.co/3rWnAZB2f7 should help. Give them a try and let us know how you make out. ^JVO": 0, "70-647: how are the teaching materials at loose ends so as to microsoft executor 2008, methodology responsible ...": 0, "Needa get live, get Microsoft points, and buy some songs.": 0, "Insanely Funny Shit: new image http://t.co/6vLr3O3tvr via http://t.co/fnTDKnNbKt #funny http://t.co/15GZwRpBG5": 0, "@Microsoft why would you not create software to sync the 30gb Zune with a mac? That has to be a major part of Zune's failure right there.": 0, "RT @yenerm: difference between microsoft and google campaigns... google asks your vision #ifihadglass where microsoft trys to belame others": 0, "Sally Fitzgibbons: Bend at the kneesI dont think he believes its under w... http://t.co/akhgoGzeuf via http://t.co/mn3EFmuNyP": 0, "RT @VentureBeat: Biggest Xbox launch ever: Microsoft says it sold 1M Xbox Ones in less than 24 hours http://t.co/gmmaEVqZ2Q by @deantak": 0, "Microsoft Defends the Xbox One's $500 Price Tag http://t.co/fabkS8tMrB": 0, "RT @KMacMusic: Sony sold 1 million PS4 in the US alone in 24 hours. Microsoft sold 1 million XBox One units in 13 countries in 24 hours. PS": 0, "Xbox One Key To 'One Microsoft' - Microsoft's Xbox One isn't just about taking over the living room. It's a provin... http://t.co/cBV2IrM076": 0, "Microsoft delayed launch of Xbox One in Asia. Welp. That makes my decision easier then.": 0, "An perspicacity into microsoft backing up exams: RNHjLmk": 0, "@DAME1612 @iAnthromahe What Microsoft 'thinks' for marketing purpose is not my issue. You are not a Macedonian, but a Slav from FYROM :)": 0, "Front Faceplate Face Plate for Microsoft Xbox 360 Pink  http://t.co/5ZfAtoPG1b": 0, "By the time I die, I will have spent a cumulative total of 7 days wrestling with formatting on Microsoft Word.": 0, "@rjygraham @Microsoft @Xbox awesome! Can't wait for mine to come :)": 0, "Microsoft to win EU okay for $7.3 billion Nokia deal: sources http://t.co/7I7accAAzx": 0, "I liked a @YouTube video http://t.co/8KTppEOKZ4 The Making Of Yoteslaya Limted Edition Microsoft Xbox One (Only Model)- 500 GB Black": 0, "This google vs. Microsoft escapade is getting old It sucks having to find alternative YouTube apps because google can't be the mature one.": 0, "@OMGSweetCheeks @PlayStation I don't get it? Microsoft did the same on Facebook.": 0, "I liked a @YouTube video http://t.co/vsOsfD1WbV The Making Of Yoteslaya Limted Edition Microsoft Xbox One (Only Model)- 500 GB Black": 0, "RT @sebimbert: Microsoft sells 1 million Xbox One units in its first 24 hours http://t.co/tnslc2FxqI via @thenextweb": 0, "#auskepcon Facebook, Google, Microsoft, Oracle all led by Jews.": 0, "Whence so that lay open yours ascending by dint of microsoft breeding!: xSUYAgFq": 0, "@mzlondon See http://t.co/qVNusRA1Zn to optimize your browser and http://t.co/ysLWHBFDAf to update Silverlight. Does this help, Emma? ^JVO": 0, "Finally got Microsoft office downloaded onto my computer. I can actually do my work...yay": 0, "@StSkipper There are some additional steps at http://t.co/6psHvmivIK that may help with the slowness. Give them a try and let us know. ^JVO": 0, "Microsoft releasing Windows 8.1, a year in making -  LOS ANGELES Microsoft is releasing its long-awaited Windows... http://t.co/UDSTQzkUAo": 0, "#xonegames Microsoft to sever all ties with KSI http://t.co/zchrS3xENq": 0, "GO! WITH MICROSOFT: ACCESS 2010 INTRODUCTION (Cleveland) - $5: \n      This is a used soft cover textbook with ... http://t.co/eUXooUv5tl": 0, "@ProSyndicate you are a syndiball coming at me with ur boooobies and the xbox one can see ur penis lol dick Microsoft can see your dick shit": 0, "The new microsoft store is so awesome": 0, "Help UCLA game design students better game design by using this link: http://t.co/O6BRNqNYvM #Win8 #FunApps": 0, "Bernie Sanders: Read a list of bills that would have passed the Senate i... http://t.co/RLvfdPGJR9 via http://t.co/hdZI6v6ii9": 0, "One million #XboxOne's sold *globally* (except for Japan) -  #Microsoft can't be happy when the #PS4 did that number in North America alone!": 0, "Us Weekly: Two years and going strong! Lady Gaga recently gushed about he... http://t.co/UrQ3b8driW via http://t.co/lZ21fxpl5d": 0, "Microsoft sells over 1 million Xbox One units in less than 24 hours http://t.co/GVOGvXQ7TX": 0, "RT @BrandonSoriano1: @karissajoyyy Yeah I guess you could say I'm pretty much a master of Microsoft word photo editing...": 0, "Software patent reform just died in the House, thanks to IBM and Microsoft http://t.co/djRcoQtVg7": 0, "For a limited time. TabletMark for free! #benchmark #tablet http://t.co/RZDVJ6FPrI": 0, "RT @chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/m6LsBlW3Av": 0, "RT @busait: .. and M. ARIO ADIMAS (Digital Marketing Manager MICROSOFT INDONESIA)  #BUSAIT2013 #SainsTheExplorer": 0, "RT @sarahcuda: Is David Sacks the Marissa Mayer of Microsoft? http://t.co/JjiuJ2Ukba via @pandodaily": 0, "Funniest pictures ever: new image http://t.co/HjWEe5TPHz via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft lost around $4 billion over the 4 years of the first Xbox. #xboxfail #shittysystemanyways": 0, "@sergesc Glad to hear it, Sergio! We see you're training for a half marathon; have you seen the health &amp; fitness app? http://t.co/CKZbB1eWro": 0, "Microsoft Windows XP Home Edition - Upgrade: 2 Offers for Microsoft Windows XP Home Edition http://t.co/Jaq2d9W6vj": 0, "Just found out Microsoft sold over 1m consoles in 13 country's and Sony sold over 1m consoles in the USA and Canada!": 0, "It's baffling to me how Microsoft can be so dedicated to pushing their awful Metro interface into every market unless they live in a bubble.": 0, "Ok @Microsoft is kinect really that specific? Can we agree when I say amazon video I mean amazon INSTANT video? Jeez! #xboxone #betatester": 0, "Microsoft Streets and Trips with GPS Locator for laptops: $19.00 (0 Bids) End Date: Saturday Nov-23-2013 17:23:53... http://t.co/M557r9uc1T": 0, "Dalma Energy deploys first Microsoft Office 365 Hybrid Cloud in Oman - Zawya (registration) http://t.co/BSjAZ2gRz5 #adopt #benefit": 0, "RT @Michaela_Brook: I like my men like I like my Microsoft Word documents ... Saved.": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/8pgItGPaZ4": 0, "@InTransit74 Yeah it's really a shame Microsoft is reluctant to compete.": 0, "Battle of the consoles: It's Sony vs Microsoft http://t.co/o6J72IewU2 via @DailyMailUS": 0, "Lmfao #thegreybackpack this is what we do! #gamers #microsoft #xboxone @ The Gamerz Watchtower http://t.co/eovpwHZ0TW": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/iJ4AQLI8Ok": 0, "The Xbox used to be Microsoft's ugly stepchild. Not any more. http://t.co/MJST8auUf2": 0, "I'm suing microsoft for not building a restart button for human brains. And hearts of course.": 0, "Provide pointers to students by installing this Win 8 app http://t.co/Gm1x50NPVI #windows81 #seo #CallOfDutyGhosts": 0, "#XboxOne Xbox One sells one million consoles in 24 hours: Just like the PlayStation 4 last week, Microsoft nex... http://t.co/VBrSf1S2u1": 0, "Assist UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/4NK2BeKg1L #Win8 #FunApps": 0, "\"Microsoft Launches Node.js Tools For Visual Studio\" good read http://t.co/p4NuzmqHoZ": 0, "No sherin from Microsoft tech support I don't want to do your survey after you permanently ban me from xbox ..... #DontCallMyHouse #rattled": 0, "WHY IS THE SECOND DEAD RISING ONLY FOR XBOX ONE WTF nice marketing move, Microsoft, cause it looks badass": 0, "RT @vudufans: VUDU is proud to be a Day One launch partner with Microsoft's Xbox One! http://t.co/WFbDHTMU9F": 0, "Microsoft made 500 million dollars yesterday": 0, "Microsoft severs ties with YouTube personality following Xbox One event - GameSpot http://t.co/W8wd5ru0o9": 0, "#Microsoft selling anti #google mugs &amp; t-shirts for #datamining. http://t.co/F4dXuPXqKZ": 0, "Microsoft Xbox One Day one Edition 500 GB Black Console: $435.00 (21 Bids) End Date: Saturday Nov-23-2013... http://t.co/cHvqMjKapx": 0, "Microsoft's Major Nelson thinks that the PS4 remote play is a great feature to have in the next generation of consoles! (Brad)": 0, "RT @dontusethiscode: .@chiangf @ferdef Microsoft NERD is a fantastic venue! I hope the next Boston @PyDataConf is there; great layout &amp; loc": 0, "Downton Abbey: How beautiful the great house looks in the half-light. A w... http://t.co/9Dcq1piTa9 via http://t.co/tXjObGiDiU": 0, "Dear #microsoft:  I want to like you.  Really I do.  I think Jensen Harris is a god.  But your marketing staff aren't helping you.": 0, "@StephSaysIt Thanks for the feedback, Stephanie. You can also submit it at http://t.co/BnLgJELkM5. Can we help with anything else? ^JVO": 0, "What's going on tonight?": 0, "Microsoft deff outdid Sony when it came to launch day... So dope!!! #ForzaDiscovery": 0, "Microsoft Xbox 360 Elite 250 GB Matte Black Console (NTSC): $72.00 (0 Bids) End Date: Saturday Nov-23-2013... http://t.co/9mV3Ikvger": 0, "Fashion: BuyTrends: how about this match?\nshop http:... http://t.co/f5A0q6NlS3 via http://t.co/qiQqBbpNxe #fashion http://t.co/U9ZM9siA0j": 0, "The Borgias: Goodnight.. http://t.co/JXQGvDG688 via http://t.co/tXjObGiDiU #tvshows http://t.co/teeL1aSi4M": 0, "RT @surfer5671: Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/nMt21gmCsk": 0, "You Are My Life: new image http://t.co/HrfqKSDIIA #quotes via http://t.co/gxktWhKfbI http://t.co/qMFDtULB2d": 0, "@Joe_Gatto @Microsoft  Joe what's your gamertag??": 0, "Miles mastered video games &amp; helping others in the ASAS program. Now, he teaches others about Xbox @Microsoft #proud http://t.co/lMb8hQHLBo": 0, "Microsoft Surface is amazing": 0, "@MicrosoftStore So you'e not going to do anything. Way to set the bar low @Microsoft. BestBuy, Amazon and Walmart have done better than you!": 0, "RT @raviolyravioly: @danielgotskillz microsoft and google are watching you constantly.": 0, "micrisoft excel 2010 (Rochester) - $25: \n   Microsoft Excell 2010 150 new. 25 dollars now. text or call giod c... http://t.co/8YbKXQn4CW": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/dCdFzZH1gv via http://t.co/gxktWhKfbI #quotes": 0, "Microsoft's New Xbox One Sells Out - Microsoft said it sold more than one million units of its Xbox One videogame ... http://t.co/tmuKhWfUBa": 0, "Waves: new image http://t.co/o7RhwQ4QLX #surfing via http://t.co/mn3EFmuNyP": 0, "RT @BizTalk360: Whats New in Microsoft BizTalk Server 2013 http://t.co/7axKy10POW from @pluralsight free 7 days access includes @BizTalk36": 0, "Macklemore n' Ryan Lewis #respectnlove #awesome #microsoft #freetickets #thankyousecurityguy http://t.co/TMoeD525Mf": 0, "Microsofts Major Nelson Thinks PS4 Remote Play Is a Great feature, Clarifies Previous Statement http://t.co/CpDTBoR59L": 0, "@XboxSupport2 Alright, will do... Just waiting for Microsoft to answer the phone right now to try a replacement first.": 0, "\"I got one word for you, Ben Braddock...Microsoft.\"  coulds been a much different movie": 0, "RT @gripegal: Microsoft is offering Office for iPhone. Because Excel on a 3\" screen sounds like a good fucking time.": 0, "@CheapyD *such a Microsoft shill!* (* denotes sarcasm font)": 0, "I added a video to a @YouTube playlist http://t.co/EOAgQGAUqc International CES Playing Kinect Game Microsoft Booth XBOX 360": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/dX32ZWvWuU": 0, "Microsoft Sells Over 1 Million Xbox One Consoles In 24 Hours http://t.co/O8DVDE1G87 via @HuffPostTech": 0, "@Clarknova1 ALL THAT DIRTY MICROSOFT MONEY!? WHAT DO YOU THINK YOU ARE, [AS]? A COMPANY OR SOMETHING?!": 0, "PARALYMPIC_crew: Alex Zanardi - 2013 Paralympic Award \"Best Male Games D... http://t.co/ntBevutPvp via http://t.co/jDAwU42y28": 0, "Review: Ryse: Boy of Rome For that glory of Microsoft!  Clearance Bin Review - http://t.co/oyLCX5wEhH": 0, "Played about 45 seconds of FIFA before I wanted to blow my brains out. Why would you bundle THAT with your console, Microsoft?": 0, "Microsoft Admits Windows Rt Is Inflexible, Could Disappear: \nMicrosofts's Executive Vice President of Devices ... http://t.co/DEPTfZbvUi": 0, "@chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/hI3U875bDnLMFAOO": 0, "#AFRSH: Microsoft Expects Difficulty Meeting Xbox One Demand -  Back in September, we ran an... http://t.co/tLW6OqJ26t #TechFresh": 0, "What console war? Microsoft sells 1M Xbox Ones in first 24 hours http://t.co/YfXhiiROMD via @CNET": 0, "@Stepto you're very vocal about your distaste for certain Microsoft products since you left. it's a little disconcerting.": 0, "Words To Inspire the Soul: new image http://t.co/hqac51G2Ag via http://t.co/gxktWhKfbI #quotes http://t.co/YgT4o7fubg": 0, "To spin or not to spin: Does Microsoft need Xbox? http://t.co/X2iJyp61ui": 0, "RT @SarahMJade: Linux is big sexy beast with a studded codpiece and Microsoft .....well the name speaks for itself.": 0, "@XboxSupport already contacted Microsoft it has to go back for a reapir": 0, "@VinceZampella Titanfall 2 on ps4 or stay exclusive to microsoft": 0, "Microsoft trying to say the Xbox matched the Playstation's sale numbers when it launched in 11 more countries than the Playstation *cackles*": 0, "RT !: HOW TO ADD HIBERNATE TO WINDOW 8 POWER OPTION - Not long ago Microsoft introduce the... http://t.co/j71oTSmEKN": 0, "I added a video to a @YouTube playlist http://t.co/W3iWnnAIRR E3 2010 Press Coverage Microsoft XBOX 360 Kinect": 0, "@Microsoft_Zach front row brad paisley!": 0, "Microsoft's Julie Larson-Green Hints At Further Windows Harmonization Across Device Classes http://t.co/QBxbZa7wzn": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/Y0ijSYqYaQ via http://t.co/gxktWhKfbI #quotes http://t.co/gsQnUWBl1R": 0, "Just whooped a bunch of kids and the sales guy at the new Killer Instinct game at the Microsoft store and won a t-shirt.": 0, "Who says a web site or program should work perfect day one? Ask #Microsoft or #Applfe! @Obamacare, #ACA is off and running,@msnbc@CNN": 0, "Are you looking for globally recognized certification courses to improve your job skills? Cisco CNNA, Microsoft MCSE, or even Medical......": 0, "TALBOTS: Things just got interesting! Add a little lace or sparkle this ... http://t.co/EwwqhRQ4KC via http://t.co/qiQqBbpNxe": 0, "Got my Microsoft Surface 2!!! #microsoft #surface #tablet #computer #soexited http://t.co/U7Xad4XsHc": 0, "Silicon Valley becoming the electric Detroit http://t.co/iZBSEYRTK1 via http://t.co/3cVMRz99nh #worldnews": 0, "Test4pass microsoft fight 70-177 viva dolefuls display questiond 4shared: MOcpRrP": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store - http://t.co/SDWSWlKaop": 0, "I added a video to a @YouTube playlist http://t.co/Qht8kABG9t E3 2010 Press Coverage Microsoft XBOX 360 Kinect": 0, "Faithful microsoft polychromize poundage acclimation: eujcp": 0, "VIDEO: Microsoft Sells 1 Million Xbox One Units In First 24 Hours http://t.co/Z5PgcoM5Nf": 0, "Microsoft takes over Times Square for Xbox One launch | The Verge http://t.co/N0FIuhgU3d http://t.co/1SzauNKWwm": 0, "@EconBizFin Now Nokia is bought out by Microsoft, I bought a new iPhone instead.": 0, "@Dinnerbone @Sepkehollanders Actaully, March 2014 is the Official unsupport from Microsoft (Listed on their website)": 0, "RT @MSLearning: Build a better app! Set yourself apart with Microsoft developer training: http://t.co/acTtKuv1Jh": 0, "@GoogleInstantly Actions return to us sooner or later http://t.co/ojhUhaszsf Payback in first in wealth http://t.co/jZnwTo8Twu  then Health?": 0, "Microsoft Selling Shirts and Mugs that Make Fun of Google Stealing Peoples Data http://t.co/IYSvKwjsE4": 0, "Found box with old (last century) Microsoft reviews, my Darth Maul light saber and my first MSFT badge http://t.co/FsnBGOia72": 0, "To spin or not to spin: Does Microsoft need Xbox?: IT'S A SOURCE OF INNOVATION: If Microsoft hadn't entered th... http://t.co/hxhUyYmSb8": 0, "I liked a @YouTube video from @hiphopgamer http://t.co/hD7ck0olvX Xbox One Unboxing: Microsoft Has Finally Launched": 0, "Linux provides freedom. Cost is secondary. How Munich rejected Steve Ballmer and kicked Microsoft out of the city http://t.co/fQ9VPRYV9k": 0, "RT @iOSReport: iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/PB0wVchrZY": 0, "At Bestbuy new surface keyboard already pealing off. Microsoft! See why you are not selling! http://t.co/Jh1o3O6BJZ": 0, ":( @bitch_navi: :/ RT @RezilientKas: Microsoft Word tho. RT @rihluminati: Me: http://t.co/7sGCem08al": 0, "To spin or not to spin: Does Microsoft need Xbox?: Microsoft Chairman Bill Gates donned a cool leather jacket... http://t.co/VvnYZD62LV": 0, "#OS #news - Windows Phone outsells iOS in Latin America - http://t.co/FvGLEIzCv9  #windows #microsoft": 0, "RT @VG247: Corrinne Yu leaves Microsoft to join Naughty Dog team  - http://t.co/PCTDHqLNFg": 0, "Thought if try to headset on the xbox one... Mic doesn't work kudos Microsoft #XboxOne": 0, "Photoset: buzzfeed: Every Pixar movie summarized in terrible Microsoft Paint drawings. http://t.co/3grwVO99uT": 0, "Insanely Funny Shit: new image http://t.co/IHD8pdUXRh via http://t.co/fnTDKnNbKt #funny http://t.co/c9ZsYZ5Jm5": 0, "RT @MichaelSteeber: iOS: The iPhone 4 is 3 years old, but well give you iOS 7. \n\nAndroid: The lucky ones get updates. \n\nMicrosoft: No phon": 0, "I added a video to a @YouTube playlist http://t.co/uRtbcQIQTE Kinect Microsoft XBOX 360 Car Racing Game People Playing": 0, "Microsoft: Xbox One will revolutionize the living room http://t.co/d7KIOLp9JC": 0, "Note to Microsoft: The only time I need a \"tablet\" is when I've got a Jeffing HEADACHE from using your dodgy OS #Microsoft": 0, "Microsoft Store with the cousins @christopear21. We betrayed apple! http://t.co/idKn33shlC": 0, "Those who mind dont matte...: new image http://t.co/ehK7fn2R3d #quotes via http://t.co/gxktWhKfbI": 0, "#TRUTHTELLER NEWS Microsoft Selling Shirts and Mugs that Make Fun of Google Stealing People... http://t.co/EXHY3YLVgs #SOCIALMEDIA #NWO": 0, "Win a Microsoft Surface from Sweepstakes Advantage http://t.co/AOjOOmbah2 via @PunchTab": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console - New unopened box: $400.00 (0 Bids) End Date: Sunday... http://t.co/vUIsAqBnPG": 0, "RT @EconBizFin: The next incarnation of #Nokia, though much shrunken after parting way with its devices division, will be no minnow http://": 0, "@applenws: iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/jfL6UlmI4A #apple": 0, "I added a video to a @YouTube playlist http://t.co/wWIf0yFsbI CES 2009 Microsoft Keynote Speech": 0, "Giggle Palooza: Family  Giggle Palooza http://t.co/N6mA7h9Gpc via http://t.co/fnTDKnNbKt #funny": 0, "#videogames Xbox One sales pass 1 million in 'under 24 hours', claims Microsoft http://t.co/GxLS6K0GyU": 0, "Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/nMt21gmCsk #Win8 #FunApps": 0, "Anyone know if Microsoft has a free trial for software? I need Publisher.": 0, "MMA BEAT DOWN: new image http://t.co/5H0dGOopk9 via http://t.co/ABUaH7ML8Q #mma": 0, "Want #MicrosoftXbox360  Fast Delivery! Buy now! Microsoft Xbox 360 http://t.co/3CxK49BzXt": 0, "I've never understood this approach for ranking employees. Drawbacks seem to be obvious... http://t.co/vC4uEqpJhf": 0, "Office Remote For Windows Phone Lets You Control Microsoft Office Documents On Your PC http://t.co/kASNsmI0VO via @RedmondPie": 0, "@terrycavanagh will you be attending the unity/microsoft hackathon this Friday?": 0, "I wanna thank the people of microsoft for my halo award, together we make the world a better place. #HALOawards http://t.co/tdWfN0GuWz": 0, "UCLA computer science students in learning how to use feedback from players, use this link: http://t.co/ROyxgDzxgy #Win8 #FunApps": 0, "#Vbnss Xbox's bid for the living room - Nov. 22 - Microsoft aims to make Xbox One the hub of the living room as it... http://t.co/p5XVKb3k68": 0, "Microsoft Confirms Sunset Overdrive For 2014 http://t.co/VaavKK4PBc": 0, "RT @Fa7hom: Quentin is such a star wars noob he thinks Microsoft owns it. Pshhhhh": 0, "PARALYMPIC_crew: Marlou van Rhijn Bladebabe - 2013 Paralympic Award \"Bes... http://t.co/qfbhS750IL via http://t.co/jDAwU42y28": 0, "@chrisremo your right http://t.co/k0CD6qa3ws is the correct choice": 0, "Did they make the new 100 bill with Microsoft office ?! http://t.co/HVCkWr9lpx": 0, "I added a video to a @YouTube playlist http://t.co/RYhZalJMOW Your Shape Demo Microsoft E3 2010 XBOX 360 Kinect Fitness Video Gaming": 0, "@_jasonmelancon And it remains regardless of level or boost?  Consider a Refresh: http://t.co/rhgrpzANWT": 0, "i fucking hate my computer, can never do work with it, takes ages to load up Microsoft word then just freezes on me": 0, "RT @TheBigEasyofOz: BREAKING: MICROSOFT FOUNDER BILL GATES PURCHASES 100% OF THE BITCOIN, DELETES IT ALL.  ASKED FOR COMMENT GATES STATED \"": 0, "#XboxOne top ten features. http://t.co/QevE99wdrr #gaming #microsoft": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/qt5iZpWj3d via @BloombergNews": 0, "I'm sorry @Microsoft but #xboxone is not rdy for me: am I supposed to pretend it is or just go on about my biz like its doin a good job?": 0, "#Xbox One Key To 'One #Microsoft': InformationWeek: #Microsoft sold more than 1 million #Xbox Ones within 24 h... http://t.co/Tgygc7h9W0": 0, "Cant wait to see the sales of PS4 next weekend, not looking great for Microsoft...": 0, "Just when I thought my Sat night couldn't get any worse, Microsoft decides to malfunction &amp; close itself. Hours of work, gone. Fucking cool.": 0, "Ultimate Fighting Champio...: In case you missed UFC 167 last Saturday, ... http://t.co/py6VXZEJrN via http://t.co/ABUaH7ML8Q": 0, "accidentally deleted Microsoft Office of my computer &amp;didn't keep my activation code. BUT S/O to my school for making MO free to students!": 0, "I Fucked Around And Built A New http://t.co/nWggjy519g Under Bill Gates Nose. http://t.co/DUe0HzB3OV": 0, "Spartacus: Ready yourselves for the final episode of Blood and Sand, foll... http://t.co/AReOLB2RBF via http://t.co/tXjObGiDiU": 0, "whats microsoft doing? nothing": 0, "RT @Xbox: @PlayStation @Microsoft Thanks! It's been a #GreatWeektoBeaGamer": 0, "@zStarGames be hilarious if microsoft decide to send you a brokenbox one": 0, "Amazing shoes and bags: new image http://t.co/SCLQoftW9M via http://t.co/qiQqBbpNxe #fashion": 0, "Insanely Funny Shit: new image http://t.co/Wgq8mvvBpq via http://t.co/fnTDKnNbKt #funny": 0, "Guide to using a nested IF Function in Microsoft Excel http://t.co/4b4bILxorX": 0, "F1Ladies: new image http://t.co/TtUY0iYbbV via http://t.co/u6brH2PXVg #F1 http://t.co/AOqY2NNppS": 0, "Microsoft sells over 1 million Xbox One consoles in less tha... via @verge http://t.co/OGMKkh2uIJ #microsoft #xboxone http://t.co/JrzWhNbs9r": 0, "@Krukester Reporting to the first party is reporting to Steam, Microsoft or Sony. MSFT/SONY will follow up on reports the same as ATVI does.": 0, "@Microsoft over 1 mil #ps4 sold in America's alone. Go do the math": 0, "dear @Microsoft please help @daveryankdwb ! answer to his question i cant answer thank u!": 0, "@gstarrs85 Awesome! Care to let us know how we're doing with a quick survey: http://t.co/AExMO0RoJb? Thanks! ^DJ": 0, "#VIRAL: Microsoft starts selling anti-Google merchandise http://t.co/73dstwEWq3": 0, "just discovered Microsoft MVA.... I've been wasting my time learning WP8 dev through scraps of tutorials online until today...": 0, "Microsoft, the longer you market your tablet for Office apps, the deeper the hole youre digging for marketshare.": 0, "RT @temitopeybnl: Oloun!\"@Boobs_r_big: WE REALLY DONT CARE BRUH \"@thimmyt: Dear Microsoft Word, I'm pretty sure I spelled my name right\"\"\"": 0, "X-box 1 sells 1 million systems first day. Doesn't burn up. A good time for Microsoft.": 0, "RT @Windows: Did you know that your #Windows8.1 Start screen is your apps, friends &amp; sites in one place? http://t.co/LQqxH8zSAI http://t.co": 0, "Soooo my XboxOne quit reading game discs. :(  On hold with Microsoft now. I'm sooo sad for her.": 0, "iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/ROuO2HlYEb": 0, "RT @verge: Microsoft sells over 1 million Xbox One consoles in less than 24 hours http://t.co/sH7qFqAIhf": 0, "@Trizzy_Sav NEVERRRRR THEY CAN TRY BUT NEVERRRRR SONY WILL ALWAYS BE THE BEST FUCK MICROSOFT CRAP BOX SHIT": 0, "Plot twist: Microsoft Word does what I want it to do": 0, "Microsoft's Xbox One | First Look http://t.co/YFHrzYVOWy #YouTube #News": 0, "RT @AppleMacGeek: AppleInsider - iOS productivity showdown: Apple iWork vs. Microsoft Office 365 vs. Google Docs http://t.co/uBK7JXxphc": 0, "Microsoft's next console box is going to have an all-vent exterior.  A processor suspended within a shell of fans.": 0, "Today was UNREAL. #Microsoft knows how to do it big!\n\nmacklemore @ryanlewis @alexikhom #FreeConcert http://t.co/kkmIhkETjt": 0, "Microsoft sells over a million Xbox Ones in under 24 hours http://t.co/gFHwr4tctE": 0, "@KittyBonkers really don't seem to give a fuck. Got an issue? No 'sorry to hear you have an issue' just 'Contact Microsoft.' to many folk :;": 0, "I added a video to a @YouTube playlist http://t.co/XNXFe7tRI9 Microsoft E3 2010 XBOX 360 Kinect Sports Demo Computers Video Games": 0, "Googlers Love Microsoft's 'Scroogled' Gear. Mug and Shirts Sell Out.  http://t.co/0crG85zmC1 via @forbes #amazing": 0, "Best English Quotes &amp; Say...: new image http://t.co/mJOceYXO9W via http://t.co/gxktWhKfbI #quotes": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/hmAUy3dEvX": 0, "Formula 1 HIGH RES photos: 1961 - Germany - Lotus - Stirling Moss http://t.co/DvFV6UvK4g #F1 via http://t.co/u6brH2PXVg": 0, "Almost Human: new image http://t.co/I1qeYxEu6t via http://t.co/tXjObGiDiU #tvshows": 0, "RT @Health_IT Not only can #healthanalytics improve #patientcare, it can significantly boost operational performance http://t.co/1qESdDi4H2": 0, "RT @Safer_Online: #TipOfTheDay: To help minimize the risk of online predators, use family safety settings in your PCs &amp; gaming consoles htt": 0, "RT @BrentPiaskoski: Microsoft sells over a million Xbox Ones in under 24 hours. Approximately 6 to women.": 0, "@ancientnose I was slagging off Microsoft AU for a promoted a tweet where they claim to have reinvented the PC. They've always been tossers.": 0, "Microsoft Xbox One also sold over a million within 24 hours: Sales easily surpassed day one Xbox 360 sales. Th... http://t.co/NsQMTpaFfp": 0, "Have some down time this weekend? Register today for our #webtech on Microsoft @PrivateCloudMS infrastructure http://t.co/fkzO6XwSpL": 0, "Microsoft accompanies the beat all hollow embarrass os wherewith bos salver 2012: RrEif": 0, "Damn! Funny: Revenge http://t.co/UFu08T5XN6 #funny via http://t.co/fnTDKnNbKt": 0, "Wow can't kick people from partys on #XboxOne smart move Microsoft": 0, "RT @EconBizFin: What was once the worlds biggest mobile-phone maker is reinventing itself. Again http://t.co/wdM55kSx8w": 0, "@KyleeerYT @TWiiNSANE_Liam It better not be cuz I'm not buying another 60 controller just cuz Microsoft screwed up": 0, "Xbox One sales hit 1 million on first day: REDMOND, Wash. - Microsoft Corp. says that more than 1 mil... http://t.co/nUB6TBwAWo #seattle": 0, "The Young Turks: JFK Assassination Anniversary And Conspiracies http://t.co/A9S5yF41kH via http://t.co/hdZI6v6ii9 http://t.co/2g55DrD7f2": 0, "RT @chrisremo: Has there ever been a more mind-bogglingly stupidly named product than \"Microsoft .Net\"? Are you serious, Microsoft? You imb": 0, "@MinnesotaBurns BURNSY MICROSOFT FUCKS UP AGAIN..XBOX LIVE GLITCH STILL NOT PATCHED http://t.co/I0jXFrGHdo": 0, "Funniest pictures ever: new image http://t.co/R1YBEjduiS via http://t.co/fnTDKnNbKt #funny http://t.co/wdpFYXoMny": 0, "More than 1 million Xbox One consoles sold in less than a day: Microsoft | http://t.co/bfHJ5KYESY": 0, "Quentin is such a star wars noob he thinks Microsoft owns it. Pshhhhh": 0, "RT @Newstalkfm: Microsoft says more than a million Xbox Ones sold within last 24 hrs.The firm claims the console is almost out of stock acr": 0, "Fashion: BuyTrends: will u like this match?\nshop blouse: h... http://t.co/hQfSDtREoj via http://t.co/qiQqBbpNxe #fashion": 0, "USA security service has already requested data requests on more than 64,000 accounts to Microsoft, google, Skype, YouTube, aol, apple, FB.": 0, "@JonSlaviero what's going on tonight that's cool?": 0, "Microsoft Selling Shirts and Mugs that Make Fun of Google Stealing Peoples Data http://t.co/2NBAmWVoQ6 #activist": 0, "\"Younite\" \"YOUNITE\" What the Xbox One means to Microsoft http://t.co/ORc1ckOipM": 0, "RT @WinBetaDotOrg: Microsoft admits Windows RT is inflexible, could disappear http://t.co/drFS7FgDGC #Windows81 #WindowsRT": 0, "RT @sfoshee1: Large % of #XboxOne consoles reportedly have broken drives &amp; controllers. Never buy any Microsoft product until it's been out": 0, "Microsoft moments is out! http://t.co/u79yftSspi Stories via @WindowsUK": 0, "I added a video to a @YouTube playlist http://t.co/GdsNhXsaUz E3 2010 Floor Coverage Microsoft XBOX 360 Kinect Hands Free": 0, "\"Accelerating Change at Microsoft\"  http://t.co/yWorjQNJFK here's hoping they find their legs": 0, "RT @Microsoft: Weekend Reading: Game on! http://t.co/KEPYOGBvxk http://t.co/nGjKAznpTa": 0, "What if... what if.. Apple... came out with there own game console so good that it would make Microsoft and Sony look like shit..": 0, "@SincerelyBhop haha I wish man. What games did you pick up? Microsoft hates us tried to look at your achievements says Xbox one and hoes me.": 0, "@XboxSupport how to I switch Microsoft account for my gt on xbox one?": 0, "well this is rich. microsoft is selling wares that chastise google for spying http://t.co/fl8jJbRQ5R": 0, "Front Faceplate Face Plate for Microsoft Xbox 360 Pink  http://t.co/OZlpri537d": 0, "#Microsoft Store #app for #Windows Phone adds ratings and reviews in latest update #Tech #Gadget http://t.co/egdffJgi1t": 0, "The Economist | Reincarnation at Nokia: Planning the next bounceback http://t.co/EeETHns60u": 0, "RT @ObeyEmber: JUST GOT A FREE XBOX ONE FROM MICROSOFT\n\nRT FOR A CHANCE TO WIN THE CODE \n\nMUST BE FOLLOWING http://t.co/abGiX6XKpW": 0, "Big S/O to Microsoft's advertising department, they know how to attract their target audience": 0, "In Loving Memory: new image http://t.co/kP0xNjIV2x via http://t.co/gxktWhKfbI #quotes http://t.co/othZMtWlkz": 0, "@laurapcd1 #Apple..#Nike...#Microsoft..#IBM   #FoxNews  #FOXSPORTS...#NASCAR ..": 0, "Office Remote For Windows Phone Lets You Control Microsoft Office Documents On Your PC http://t.co/75o7473tbm": 0, "#Microsoft severs ties with YouTube personality following #Xbox One event: #GameSpot: \"At the #Xbox One launch... http://t.co/Mp3Nrm80Rh": 0, "RT @VideoGamesFacts: The white Xbox One that was auctioned off for charity by Microsoft. http://t.co/CwBylL7uST": 0, "[Deal] Microsoft Surface RT 10.6\" 32GB tablet plus Touch Keyboard 249 @ Tesco Direct http://t.co/etQYWBHoaa #deal": 0, "Scroogled: the Microsoft attack ads that treat Google like a political opponent http://t.co/ajY7fpKk5E": 0, "RT @elearnnet: #microsoft #edu Chippewa Valley Schools CTE Community Partnership - The Times Herald http://t.co/7XWILMd0GG": 0, "@deeWaffle like what ? What did sony do Microsoft didnt do ? Lol multiplayer is better on x1 and for launch games x1 is way better": 0, "Bah, Humbug! Microsoft Wants You to Stock Up on Anti-Google Merchandise by @DanielZeevi  via @DashBurst http://t.co/ACitn3vbrc": 0, "RT @PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits": 0, "I need a download for Microsoft office in English, come on, help a brother out.": 0, "RT @TheNextWeb: Microsoft Store is selling a Keep Calm While Google Steals Your Data mug http://t.co/NVxsN7A5ag by @nattgarun": 0, "Over 1 million Xbox Ones sold in under 24 hours. http://t.co/Mz0LDt5LOb": 0, "RT @imaginecup: Enable users to sign into your #ImagineCup apps via social accounts with the @WindowsAzure Getting Started Guide. http://t.": 0, "@MonsterEnergy and @Muse all prepared for an all night coding session. @Microsoft don't fail me now!!": 0, "how do i turn kinect off on it? so when I actually kill myself microsoft doesn't know.": 0, "@SillyDave01 if I had to choose a next gen system it would be PS4. Microsoft really screwed themselves by their bad decisions this time": 0, "Microsoft Rumors Say Big Changes Coming in Windows 8.2 - http://t.co/9TffkYe1aU": 0, "Microsoft sells 1 million XBox ones in first 24 hours http://t.co/mqdXpRol36": 0, "Review: Ryse: Son of Rome  For the glory of Microsoft! | Clearance Bin Review http://t.co/N0UaY1c2gY": 0, "RT @SAMAATV: Microsoft sells over a million Xbox Ones in under 24 hours | SAMAA TV http://t.co/T3lmD2fsHm via @sharethis": 0, "Automotive Linux Leaves Microsoft and Blackberry QNX in the Dust ... http://t.co/LAbg6P2z4k": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $500.00 (0 Bids) End Date: Saturday Nov-23-2013 16:55:58... http://t.co/YYrzEsMJTz": 0, "@PsEG Microsoft wants to focus on SmartGlass and second screen as key parts of the Xbox One experience, I get the business side of it.": 0, "Fashion: BuyTrends: wow, so fantastic, i really like it\nshop shoes(left): http://t.co/vE6j2Gr5Od via http://t.co/qiQqBbpNxe": 0, "Microsoft's New Xbox One Sells Out: Microsoft said it sold more than one million units of its Xbox One videoga... http://t.co/6RZW5oHppO": 0, "Why Business Still Needs Help Managing Explosive Data Growth http://t.co/2QTWBgZQtO by @TheTechScribe #Enterprise #Data #Microsoft": 0, "Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours, But Takes 11 More Countries To Do It\n\nhttp://t.co/EBfNPAYcFD": 0, "RT @panzer: Microsoft Matches PS4 Sales With 1 Million Xbones In 24 Hrs, Takes 11 More Countries To Do It http://t.co/3K7MgJqs1D\n\nI acciden": 0, "RT @iStrainGuide: The #Iroquois use the term #marijuana to refer to #Cannabis #sativa. http://t.co/phGDqAKlSH": 0, "Scroogled: Why So Negative, Microsoft? -  The sold-out Surface Pro sure makes it look as if Microsoft... http://t.co/tXmIWEiuW8\n #GoogleApps": 0}