{"I am just so upset with Microsoft for ruining banjo kazooie ..": 0, "Microsoft Releases Security Advisory 2914486 - MSRC - Site Home - TechNet Blogs: http://t.co/EeEjJt4BS0": 0, "This hotfix (http://t.co/7XbprA6993) is available for the #grouppolicy issue I posted about here:http://t.co/3Ogo8eXgGg": 0, "@selop @nokia @microsoft @windowsphone this's Popular apps that we are in waiting for it ( @BBM, @Path, and official Facebook, Youtube )": 0, "RT @briantong: NEW PRIZEFIGHT PUNCHOUT! Sony #PS4 vs. Microsoft #XboxOne! Who will reign supreme? C: http://t.co/X59rcg49sZ YT: http://t.co": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/ypcT9a8xXm": 0, "@IvansGaming ...Microsoft Account associated to the gamertag, the account balance won't transfer over. It would stay on that MSA. ^EB": 0, "Microsoft ships its new Kinect gesture sensor to Windows developers - ZDNet http://t.co/lMR97iEilx": 0, "@majornelson so...I have a 300 headset.  My only choice at launch is to perform surgery to make them work.Shame on MICROSOFT.  From:everyone": 0, "Get business insights with Microsoft Dynamics Business Analyzer whether you are in the office or on the go http://t.co/2XBROdZ4vd": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/7mcmvylzV6": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/5bF7hpNi3D": 0, "RT @MSFTBusinessUK: Happy retirement XP! Check out this interesting infographic: http://t.co/MyAgEOMUHu #talkingbusiness": 0, "Microsoft alienates female gamers with a sexist letter to dudes http://t.co/TeEkEDfIfS #Tech": 0, "RT @SimoRoth: Windows RT to be mercifully put out of it's agony. http://t.co/PKEz0DZgni": 0, "\"@totalgaming: Microsoft apologizes for 'sexist' Xbox One promo http://t.co/5nK3nOrsHy\" @BlackGirlNerds professional back-peddlers.": 0, "Love Quotes and Sayings: new image http://t.co/dNsYWzMGj9 via http://t.co/gxktWhKfbI #quotes": 0, "Console review: Microsofts Xbox One makes a play for your living room: Microsoft has said for a long... http://t.co/mchxYO0SQz #XboxOne": 0, "Microsoft is working on a Remote Desktop app for Windows Phone http://t.co/JGIbRY9PQT": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One http://t.co/XRRB1CfGoM": 0, "Ford boss and Microsoft exec are ahead of Nokia's Stephen Elop in the race to replace Microsoft CEO, report says http://t.co/QwrcFgUMAQ": 0, "#Xbox One review: #Microsoft delivers a solid contender with unlimited potential: When Microsoft decided to fo... http://t.co/eAD4jCerIx": 0, "#Microsoft Releases #Security #Advisory 2914486: [#technet.com] Today we released #Security_Advisory 2914486... http://t.co/dyHO0j4sdd": 0, "Jordy Smith: Everyone has seen the devastation in the Philippines after ... http://t.co/feVaJVA7DG via http://t.co/mn3EFmuNyP": 0, "Apple has acquired the company behind Microsoft's Kinect. @briantong looks at the reasons behind the purchase (video) http://t.co/Fm4YYATzCL": 0, "MSRC Blog: Microsoft Releases Security Advisory 2914486: Today we released Security Advisory 2914486 regar... http://t.co/jTbGr7nN2C ^GM": 0, "@nintendemon But Javy only likes Microsoft games XD xbone one.": 0, "Foto: gamefreaksnz: Review | Killer Instinct Microsoft and Double Helix Games have resurrected the classic... http://t.co/rIJD0AkMW5": 0, "# ThingsImThankfulFor - having Microsoft as my first client. Honestly. I get to play just dance 4 for work. You mad.": 0, "*install , yes RT@LordMadsss_: is it possible to download Microsoft word on a mac book?": 0, "@Mr_iKeepitreal besides you don't suck Microsoft and Sony etc dicks like the bigger commentators that get free shit do.. Fuck that noise": 0, "Microsoft 'working to fix' Xbox Live connectivity issues http://t.co/fnr4XxihHp #News": 0, "Love Quotes and Sayings: new image http://t.co/SOWCC0y5x1 via http://t.co/gxktWhKfbI #quotes": 0, "RT @BingAds: Users get more done with #Bing, advertisers reach more solutions with #Microsoft http://t.co/0Mu5N2Oo3w": 0, "Entertainment Tonight: Hey guys, Rob here! I'll be chatting with you live... http://t.co/LD5HvhiQB2 via http://t.co/lZ21fxpl5d": 0, "Microsoft Xbox 360 250 GB Black Console: Price 100.99 USD (9 Bids) End Time: 2013-11-28 17:27:28 PDT http://t.co/zzF5hW0vFi": 0, "@TechCrunch: Microsoft Enlists Pawn Stars To Mock Google's Chromebook http://t.co/mTKdea9Sv7 by @fredericl hahaha": 0, "In Loving Memory: new image http://t.co/OcXvl66CO9 #quotes via http://t.co/gxktWhKfbI": 0, "RT @SecuredRetail: Anonymous DDoS attack snowballs, affects several Microsoft services http://t.co/P8cdTqa0t0 #DDoS #Microsoft": 0, "@PhinaVera man like microsoft can't keep awayahh l'amour": 0, "Gloves off: Microsoft slams Google and its Chromebook in new video http://t.co/2w0942p5ya": 0, "Fantastic #Socialmedia for Social Good tips by Heather Mansfield @nonprofitorgs at Microsoft in #Melbourne  #smsgAU http://t.co/bi0uEOLxUk": 0, "http://t.co/dPPUtsaukM - Microsoft books 'Pawn Stars' to power reality-distortion field http://t.co/1xfKC4XZLa": 0, "RT @khaled:    \nRT @guardiantech: Microsoft ready to kill Windows RT as Larson-Green says three is too many http://t.co/pj": 0, "@geekessays @introskeptive Yea, I'm not sure if 'perfect girlfriend' is Microsoft's name or just the uploader, but that's pretty horrible.": 0, "Microsofts New Xbox One Ad Criticized as Sexist: In the wake of mass praise for GoldieBloxs new ad ... http://t.co/okSkuDbgWf #XboxOne": 0, "http://t.co/2gAdJIZPcd http://t.co/cf25IMmSdl The Gears of War franchise has...": 0, "#Microsoft blocks censorship of #Skype in China: Advocacy group http://t.co/dPkf08GOtA": 0, "Funny Wall Photos: but they do anyway.. and a lot of it! http://t.co/feazKHBKe5 via http://t.co/fnTDKnNbKt #funny": 0, "RT @keithbucknall: Microsoft won't comment on plans for Xbox 360 Skype app: Microsoft Xbox exec Marc Whitten dodged a question in... http:/": 0, "@PearOsLinux on ASUS EeePC netbook with Microsoft Office 2010 installed through @playonlinux http://t.co/2y9vZ0bjYu": 0, "[opens up microsoft word so it looks like im doing homework]": 0, "@slayjauregui ok here's the thing, I don't like any new updates apple is making. It's to Microsoft like, and I don't like it": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/ZH73btBFNW": 0, "SDL Predicts Sony PlayStation 4 (PS4) Will Win the Black Friday Sales Battle Against Microsoft Xbox One | SDL http://t.co/0y5ef7mEis": 0, "Microsofts Xbox One | First Look http://t.co/W6D33KszpG #CONSOLE #GAME #GregKumparak #XboxOne": 0, "Microsoft Trashes Chromebooks in new Pawn Star ad http://t.co/m8Nqczazs9": 0, "just won $50 at the Microsoft booth at GSP for being someone at #KillerInstinct": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit http://t.co/iWrnE4Rs2K": 0, "@XboxSupport1 Pretty big loss to Microsoft if they don't. Losing half their customers and a huge profit just because they can't format it.": 0, "@NobodyEpic I think you need to put @Microsoft in their place with a rap battle!": 0, "Microsoft has finally made the offline diagnostic tools and mandatory update patch available for Xbox One owne... http://t.co/F0EG0q0H5Q": 0, "Dracula: Van Helsings serum is almost complete. http://t.co/zX1IKIZCCn via http://t.co/tXjObGiDiU #tvshows http://t.co/I1K59PzUcA": 0, "@blupharaoh It wasn't Windows Vista was it? Nobody could love that... oh wait, you said intelligent, well that rules out all Microsoft OS's.": 0, "CBC News: A well-preserved baby dinosaur skeleton --  the smallest intac... http://t.co/p73MJYtaWm via http://t.co/3cVMRz99nh": 0, "RT @MSAU: Thin and light, the Dell Venue 8 Pro gives you the processing power when &amp; where you want it: http://t.co/D7QS78H2u3 http://t.co/": 0, "Scar H BF4 Review - Winner of the Microsoft Point Card Giveaway!: http://t.co/p2rFt4xxpS via @YouTube": 0, "RT @MrMarcoDzn: $15 MICROSOFT CARD GIVEAWAY! To ENTER you must RT this tweet and be following! Picking a random winner in 24 hours. http://": 0, "@ElissaBeth: \"A company worth more than $300bil producing something this sexist and ignorant\" http://t.co/tTjqvd4nlB wow really? #microsoft": 0, "If somebody can tell me why Microsoft got a pass on XBL being fee based when you have ads, feel free to tell me why.....with a straight face": 0, "@jmphoff My wife already updated hers. SYNC is gone. I held off ... but now what? #KIES #Samsung @SamsungCanada @Microsoft": 0, "Microsoft May Finally Put Windows RT Out To Pasture: onyxruby writes \"Microsoft may finally be ready to put Wi... http://t.co/UkgzgB0vld": 0, "Those green squiggly lines on microsoft piss me off. I know what I'm doing don't treat me like an idiot.": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals: If your wallet can handle it, a number of retailers are having pre-...": 0, "RT @RenaChaos: \"@totalgaming: Microsoft apologizes for 'sexist' Xbox One promo http://t.co/5nK3nOrsHy\" @BlackGirlNerds professional back-pe": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/PHUNn55y5u": 0, "My postage meter was apparently made by Microsoft.  It needs updates.": 0, "Notable Buzz: OCZ Technology Group Inc. (NASDAQ:OCZ), #Microsoft: Market News Call: Shares of Microsoft #Corpo... http://t.co/Rmh7HVC9IJ": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/U6o2Vd1O7u": 0, "Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/Thzs35UpHf": 0, "@Windows Thank you SO much for accepting our app into your store! Santa's Advent Calendar! #CountdownToChristmas  http://t.co/wUveyUyZ5x x": 0, "@Darth_Tallis @SoulMasterKaze \nEh - Technically it's not the removal of the right to free speech. Skype is part of the Microsoft Network": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $620.00 (0 Bids) End Date: Thursday http://t.co/1VYi00tdYv": 0, "Learn more about making the Microsoft private cloud real: http://t.co/oYksU1Gfn0": 0, "Trying to decide if I should purchase Tomb Raider or save my \"Microsoft Points\" for later": 0, "@PsychoticLynx @Microsoft \"Fuckwit\" should be in Shakespeare somewhere. It has a fine Anglo-Saxon ring to it. \"Thou Gates-born fuckwit!\"": 0, "RT @FaZeLucid: I need a 1400 Canadian Microsoft points card! I'll add you if you can give me one!": 0, "Profile: Microsoft highlights business, social activities in Pakistan http://t.co/j1drR06HKS": 0, "Microsoft's new Surface ad calls out iPad over 'hands free' gestures, multiple user accounts http://t.co/Fs5qvU77QG": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional http://t.co/PjSHNDnjiz": 0, "Fuck you Microsoft.": 0, "Pinch us. Was it a dream or did this really happen? Has Microsoft lifted censorship restrictions for Skype in China? http://t.co/5wRW2auSYJ": 0, "Time Brasil: new image http://t.co/qJH967Vl9F via http://t.co/jDAwU42y28 #olympics http://t.co/YpvoGZtYQd": 0, "Brett Simpson: Haleiwa yesterday! http://t.co/mh0D2mXfku via http://t.co/mn3EFmuNyP #surfing": 0, "Microsoft's pivot on Skype in China could lead to increased privacy http://t.co/IwrBa6sLn6": 0, "@sie_kensou77 sexist or making a big deal outta nothing http://t.co/syu8FLEO2o": 0, "Twisted Tattoo Milwaukee: new image http://t.co/AQIRsxw2tj #tattoos via http://t.co/a3cv3RrZ94 http://t.co/duVkgJJYif": 0, "RT @pdipao: How Google and Microsoft Got Everybody Talking - Voice command software has been around for ages, but almost nobod... http://t.": 0, "@WWERollins @PlayStation @Xbox #Playstation4 ! Sony tends to out do Microsoft!": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/CwzBltjv9E": 0, "#Microsoft moves to unify #Windows, Windows Phone, Windows RT #Tech #Gadget http://t.co/u2vKQNwChV": 0, "Microsoft admits three operating systems is a crowd http://t.co/RSJqDSMH11": 0, "I'm sitting in front of my computer on Microsoft Word and I refuse to start writing this essay.": 0, "Microsoft Virtual Academy  Free IT Training, Online Learning of Microsoft Technologies http://t.co/4meaT3gVQu": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed ... http://t.co/Jn6QuK2AEH #iPhone": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/SuX5Yhyxyi": 0, "Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/wFbip9r4Ui": 0, "Windows 1.0: The flop that created an empire | Microsoft @cnet http://t.co/Nt8RqhFhBI": 0, "Got my Christmas present a little early from @nicspadilla. A @Microsoft Suface2! #besthusbandever": 0, "RT @HypArc: You just can't take Microsoft anywhere: http://t.co/jKrpaLuKqe": 0, "#Microsoft Surface Barely Registers On Web Usage http://t.co/6qNxdvd51U": 0, "That's a pic from Microsoft Surface 2\nit's on sale on BlackFriday for 199$  \nIts on my list, if u http://t.co/kyNTkdQpRB": 0, "#Amazon Is Crushing IBM, Microsoft, And #Google In Cloud Computing http://t.co/v1RmG8vO1O": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed... http://t.co/Jn6QuK2AEH #Android": 0, "Microsoft investigating MS Windows local privilege escalation zero-day: Microsoft issued a security alert and ... http://t.co/MUbk0lDjFl": 0, "RT @HuffPostTech: Gloves off: Microsoft reportedly wants to step up its fight against the NSA http://t.co/MbCKdBpaQs": 0, "#APPS + #GAMING: #Xbox, pause: #Microsoft waits to discuss #XboxOne apps http://t.co/TkJ1ezXX2j via @verge": 0, "Looking to sell my madden ultimate team for Microsoft points. Around a 88 Overall. Hit me up #MUT #Madden25 #Microsoftpoints": 0, "#Games: Microsoft have expressed interest in continuing Gears of War, Sony reckons that the PS4 will see profi... http://t.co/bAkvxmifra": 0, "Microsoft Taps 'Pawn Stars' to Scroogle Over Google Chromebooks http://t.co/FJpIU9glRJ via @DashBurst": 0, "Dont Worry, Microsoft And Sony Are Taking Care Of The New Game Console Glitches http://t.co/OfJYe1ftfb": 0, "Exam1pass microsoft 70-646 process tests: gpulaZ": 0, "Microsoft Excel's best secrets, saving you time &amp; frustrations http://t.co/ro5UkEsYXA": 0, "Microsoft's Xbox Video website is now live, though it doesn't stream in HD http://t.co/u4S1IlMs5f #Startup #Entrepreneurs #Ideas": 0, "\"Sexist\" Xbox One Letter Needs Some Changes: When the Xbox One launched, Microsoft tried to get clever and pro... http://t.co/EOnhsCDmaA": 0, "Convertible PCs: Why The Sun Won't Shine For Microsoft, HP - Forbes http://t.co/VsD86rNFBN": 0, "@tapbot_paul Not the best intro to Windows Phone, for sure. The good news: Microsoft lets you remove any app, including carrier fluff.": 0, "@shrubhog accurate except the last part. i /want/ microsoft to see.": 0, "RT @AlexDacome: Kanye West, along with microsoft, proved that trying to be different doesnt go well with fans and consumers": 0, "RT @BGR: Xbox One review http://t.co/6E0MMVI1YU": 0, "If this guy doesn't fix our Microsoft I might just sue them.............": 0, "@chuggaaconroy #ChuggaCrossing\nI'm sorry for the poor quality. I had to use Microsoft paint. http://t.co/jXQ84W7gq5": 0, "Think Positive to Make Th...: Never apologize for being sensitive or emo... http://t.co/ogyn6vyYTi via http://t.co/gxktWhKfbI": 0, "Deflating RT @necrosofty: Microsoft is having quite a bit of trouble with its marketing lately. This is just dumb. http://t.co/CVVX0t5JCJ": 0, "Oh, and Microsoft? Windows 8 is the most infuriating, intrusive piece of shit I have ever used. In danger of throwing my comp out a window.": 0, "Yo Microsoft/Xbox One how much is Angry Birds on your marketplace": 0, "And my assignment is finally done. Just need to find somewhere with Microsoft Word tomorrow to put it right and submit it #TMA02 #B120": 0, "Well played @microsoft - http://t.co/BP1rX8eqpz": 0, "@MrBong011 oh wow i ordered mine online so microsoft will send ,the new next week but i have to send this one in when i get the new one": 0, "What if Sony and Microsoft agreed with apple and Google to purposely destroy the console industry for a merge with the touch screen era": 0, "RT @rob_sheridan: This is super cool Microsoft, totally doesnt come off as sad or desperate at all: http://t.co/PIqLUoM3zp": 0, "Hey Microsoft where is my free SPACE INVADERS and PAC MAN for my GAMES with Gold?": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register  http://t.co/3RqFqOHsGk": 0, "RT @TacomaLibrary: Master Microsoft software with MS IT Academy @ the library. Free training. http://t.co/7hdaRjX008": 0, "RT @ggreenwald: Genuine reform or marketing ploy? RT @washingtonpost Microsoft plans to boost security over NSA fears http://t.co/Z2LAZl9HLo": 0, "227's YouTube Chili' Free Microsoft Points Working Microsoft Points Generator 2013 Updated... http://t.co/Dha0U33rSx Jamaal Al-Din - NBA": 0, "MS #Security #Advisory (2914486): Vulnerability in #Microsoft Windows Kernel Could Allow Elevation of Privilege -... http://t.co/3tsbS5ARwT": 0, "@AntDeRosa If it is for Twitter, that works, but I doubt Microsoft has an alternative for Chrome as is Google owned!": 0, "RT @net4tech: #Nokia confronts Indian justice for sell its factory to Microsoft http://t.co/vWuJD50uD6": 0, "Its no secret that Windows XP support is coming to an end, as Microsoft plans to pull the plug on the 12-year... http://t.co/eqxXyr7EJn": 0, "I'm getting tired of apple products, I think it's time to switch to Microsoft": 0, "RT @clparty: GUYS I JUST FOUND EROTIC FANFICTION ABOUT THE MICROSOFT OFFICE HELP ASSISTANTS. @fanfiction_txt http://t.co/qqPO3makgp": 0, "RT @lizgreenfield: You gotta be be kidding. This is sexist even for @Microsoft @Xbox http://t.co/wQ81OIn8HB #XboxOne #letter (via @chiller)": 0, "fashion lady: stylish design trench coat, would u rock it?\n\nDiscover &amp; http://t.co/aaEUpi76Oq via http://t.co/qiQqBbpNxe": 0, "RT @CNETTV: Sony PS4 vs. Microsoft Xbox One. Who reigns supreme? http://t.co/F65ENqrPf6": 0, "Insanely Funny Shit: new image http://t.co/trogQIO8O4 via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft's naive vision of the internet in the 90's. http://t.co/jjYzNMyVkQ": 0, "Microsofts New Xbox One Ad Criticized as Sexist - In the wake of mass praise for GoldieBlox&amp;#8... http://t.co/VFxZN3Dfho": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/Rl86F9yZEQ": 0, "Incident alert: Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time  (source: @SEQIncidents)": 0, "@LandonAB for now they will run both the #apple and #microsoft suite #DPS61": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/jiMCH5CB64": 0, "What business or company do you wish you owned?  Microsoft or VALVe http://t.co/cujFjG2ENv": 0, "Console review: Microsoft's Xbox One makes a play for your living room http://t.co/R2fNpfbzvo": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit - http://t.co/zh9PUxsNj5": 0, "Be thankful for your Apple products. Thankfully, you have options and do not have to live with Microsoft. Happy Thanksgiving everyone!": 0, "How much is a Xbox one because sony have just frozen my account #sony #Microsoft #lifemembernowswitching": 0, "LOL! This made my day... \"Nintendo congratulates Sony and Microsoft!\" http://t.co/biVIHGTd0X": 0, "Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic - The Washington Post http://t.co/jVsMktZjvT": 0, "gr8quotes: Shared by ~Gigi http://t.co/JbVSAsuQy0 via http://t.co/gxktWhKfbI #quotes http://t.co/VN20bWNUU5": 0, "RT Don't buy #Windows8 you have to pay extra for viewing #DVD. codecs have to b bought #tech #blog #CISPA is also supported by #Microsoft RT": 0, "Forget Doctors Note, Microsoft Now Allows You To Write Perfect Letter To Your Girl Fri... http://t.co/FsrvMc0FQr http://t.co/Wp1iCV98vU": 0, "@GamingAnarchist Feel free to laugh http://t.co/ynzkJjjz6v": 0, "RT @microcenter: RT if you want to win a #PS4 or #XboxOne ! Sign up here to win http://t.co/N5tK3pqJqS  . #Microsoft #xbox #Sony #Playstati": 0, "@bobpatters You can still buy Office as a stand alone. Here's more: http://t.co/sp8AxJwxS2": 0, "Xbox Ad Criticized as Sexist http://t.co/N69IOUJRE3": 0, "Microsoft, you lost me. Flat out threw my business away.\n\nIdiots.": 0, "UnderCurrent thinks this the best play on words ever is in this story... http://t.co/3C74LypyQe": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/R5VnILRoJy": 0, "S/o to #TwitterLess Zac and the Microsoft team for the free shirt": 0, "I can't believe how long it takes to install Xbox One games. I'm surprised Microsoft hasn't damage controlled it yet. http://t.co/GRqkYWpPVv": 0, "The Huawei Pal is incredibly easy to use. http://t.co/vvDEvNutno via http://t.co/EvmIlaxnxL #technews": 0, "RT @DigitalTrends: Microsoft's pivot on Skype in China could lead to increased privacy http://t.co/IwrBa6sLn6": 0, "RT @NotPhilSchiller: Trust me I am #Microsoft \n#myass http://t.co/JNdJKnuoka": 0, "I also wrote about a zero day for Zero Day: Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/LRNPaaJ3Xj": 0, "I would buy Microsoft": 0, "Insanely Funny Shit: new image http://t.co/lj4XalISaz via http://t.co/fnTDKnNbKt #funny http://t.co/5GnUvo5dVF": 0, "but you still play x-box? a microsoft product right? and the chairman of that is Bill Gates? a dropout? ...ok.": 0, "@SarahJLA Original letter with defaults including 'knit' can be found here: http://t.co/Y3d7FyysbV": 0, "Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/qt22VNYNd2": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying - Neowin http://t.co/3fHXypztvi via @neowinfeed": 0, "Hold Up Jon Stewart You Have A Primetime Show Idea For Microsoft HDTV For Later Evening Affairs And I Don't Even Know It?": 0, "MS Word document or PowerPoint presentation too big to load quickly? Try reducing the file size of a picture or two: http://t.co/me9i7p1IZA": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/9p2GcFpH7L": 0, "I hate Microsoft Word with a passion #GettingEmotional": 0, "New Post : Microsoft AJAX Library Essentials: Client-side http://t.co/WFwYeaGu8L AJAX 1.0 Explained http://t.co/b9AZxPHeZD": 0, "@______Henry Are you able to add a payment option here http://t.co/F3DtFEu9mX ^JN": 0, "RT @BJMendelson: Microsoft rejects the advances of an amorous fan the only way they know how: http://t.co/3PLj7ruJ5A": 0, "@SaraBareilles I'm sure I'm WAY behind but congrats on the Microsoft tablet commercial! Happy 'Brave' is so successful.": 0, "@SteelCurtainMUT same 15 gets u nothing and 25 is too much Microsoft just wants that extra $5 off you": 0, "#Games: GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed ... http://t.co/lSN8CYo9tJ": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit #microsoft #windowsxp http://t.co/Zn5BX1p5pL": 0, "Give pointers to students Win 8 app by installing from this link http://t.co/J4DRYaZv0U #windows81 #seo #CallOfDutyGhosts": 0, "Black Friday: $50 off Microsoft Xbox 360 4 GB Kinect Holiday Value Bundle http://t.co/fYv4547pLd": 0, "RT @ozbargain: easternculture: Microsoft Surface RT $229 ($130 off) @ Harvey Norman (or $199 with AMEX HN Deal) http://t.co/2OmRVs44Q9": 0, "I need a 1400 Canadian Microsoft points card! I'll add you if you can give me one!": 0, "Sony has won this console battle, hands down. XB1 sales poor, riddled with disastrous problems. Sad for XB and sucks for Microsoft..": 0, "Invest in the tweetlogix twitter app @microsoft": 0, "Blink-182: new image http://t.co/Hx61RwR7Xq via http://t.co/ZY1cU2DvHH #rockbands http://t.co/RYNZGx5JSY": 0, "shut up .. RT @Baba340: Y'all clowning Sharkeisha name but if y'all type y'all name in Microsoft word bet y'all got a red line under it...": 0, "@heyitsver: Not sure if you spelled the word wrong or if Microsoft Word doesn't know the medical terms THIS": 0, "Microsoft Xbox 360 Slim 320 GB Black Console: Price 56.0 USD (27 Bids) End Time: 2013-11-30 16:05:56 PDT http://t.co/WlZYJBKpzN": 0, "RT @BigBabaRob: @GrimKillingbeck U think they heard us chatting? RT:\"@totalgaming: Microsoft apologizes for 'sexist' Xbox One promo http://": 0, "RT @dailydot: Microsoft alienates female gamers with this sexist letter to dudes: http://t.co/urk5qt5dQP": 0, "why do i need microsoft surface?# https://t.co/Oy1ZGkWG37": 0, "UFC 2013 Ultimate Fight Collection - On Sale Now! http://t.co/TJCKAPtn0V #mma via http://t.co/ABUaH7ML8Q": 0, "@iShadava the policy team at Microsoft has obviously never gotten into an and lobby of cod before..": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/h3EJfWbFvE": 0, "@christinac604 2/2 Please take a moment to share your thoughts on our support at http://t.co/kxpuqdrrX0 . Thanks for your time. ^MG": 0, "RT @theappyslappers: @SANTACLOUSS check out Santa's Advent Calendar App - we designed it especially for you! HoHoHo! Hope  you like it! htt": 0, "Microsoft hits iPad Air in new holiday-themed ads geared towards family usage - 9 to 5 Mac - http://t.co/c7D5XDVqAb": 0, "New Local 0-day for Windows XP: Microsoft just published security advisory 2914486 describing a new, local vul... http://t.co/zEMRQyEdSq": 0, "Thank fuck I'm getting a PS4 and not a X-boxone seems nothing but problems with that machine so far. Microsoft are a joke!": 0, "Microsofts New Xbox One Ad Criticized as Sexist - In the wake of mass praise for GoldieBlox&amp;#8... http://t.co/PHeXtnSpYj": 0, "RT @sickipediabot: Whoever stole my copy of Microsoft Office, you're dead.\n\nYou have my Word!": 0, "@ingamechat Is it me, or does it seem like Microsoft hired Sega's ad team from the 1990's? http://t.co/BZEwCefGmA": 0, "RT @EverythingMS: Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit http://t.co/iWrnE4Rs2K": 0, "Assange lawyers demand clarity on his prosecution http://t.co/Ne8dRnuzQd via http://t.co/hdZI6v6ii9 #uspolitics": 0, "Sony PS4 vs. Microsoft Xbox One. Who reigns supreme? http://t.co/F65ENqrPf6": 0, "Microsoft investigating MS Windows local privilege escalation zero-day: Microsoft issued a security alert and ... http://t.co/S1ix6LjOiV": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let ... - TechCrunch http://t.co/ITAdfeVCO7": 0, "Insanely Funny Shit: new image http://t.co/rcFbBDdPJW via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft fails to get the MESSAGE. https://t.co/vlJT67Odq0": 0, "Xbox One review: Microsoft delivers a solid contender with unlimited potential http://t.co/nLDiahqXXN": 0, "Microsoft is working on a Remote Desktop app for Windows Phone Technology Blog http://t.co/EPDXqp8OxM": 0, "Microsoft's Xbox Video website is now live, though it doesn't stream in HD - http://t.co/DU4ymKo7ie http://t.co/Pj1zHnkmBm": 0, "\"Sexist\" Xbox One Letter Needs Some Changes - When the Xbox One launched, Microsoft tried to get clever and provid... http://t.co/SDz1IVEwRL": 0, "Good idea by the Xbox Microsoft team banning foul language. It leads to poor manners. Yours, Mrs G-M Featherstonehaugh-Woolfhardisworthy.": 0, "Led Zeppelin: **previously posted**\nON THIS DAY 28 NOV 1983\nI PLAYED A ... http://t.co/IxQNVA3WIz via http://t.co/ZY1cU2DvHH": 0, "@ShawnWildermuth is that a Microsoft product? First killer review of the surface I've seen": 0, "S/O to @Microsoft Word for freezing right before I finished my work, deleting half of my assignment. I hope your first child is murdered.": 0, "The #Xbox One app store will hopefully be open for developers &amp; help facilitate the next Windows App ecosystem boom. http://t.co/JnltplxrES": 0, "RT @tbhfuckoffpls: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/D7o77zVsE5": 0, "Kinect helps control your #XboxOne w/o a controller. Check out the complete list of Kinect gesture &amp; voice commands: http://t.co/RQeKqhdzgQ": 0, "This video seems like a waste of time. Not to discredit the author but b/c Microsoft specifically says they dont... http://t.co/1nwLK1MqQF": 0, "For free? No. \"@LordMadsss_: is it possible to download Microsoft word on a mac book?\"": 0, "Xbox One review http://t.co/6E0MMVI1YU": 0, "@MinecraftMainax Try the tips here: http://t.co/cS1g5ccNQv to improve your PC performance before updating. Let us know if this helps. ^KM": 0, "Assassin's Creed IV 101 Trailer | Assassin's Creed IV Black Flag [North ... http://t.co/YQJ01oD0XN via http://t.co/EvmIlaxnxL": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One | @scoopit http://t.co/huWQj0QiRu": 0, "@gmelika That's a good point. People just assume Microsoft made it with a woman in mind.": 0, "In 16th century #Egypt, balls of hammered #marijuana leaves called 'assis' were popularly consumed.http://t.co/phGDqAKlSH": 0, "RT @thomholwerda: \"Calling Google '90's Microsoft' is like calling Obama a socialist\".\n\nPerfect. just perfect.\n\nhttps://t.co/lN7dif25Xu": 0, "Microsoft May Finally Put Windows RT Out To Pasture http://t.co/BLm8G8kLtL": 0, " RT @melo107: Sheila is like that paper clip on microsoft word jodiendo la baina": 0, "Microsoft Delivers Huge PDF to Compile the Windows Server 2012 TechNet Library http://t.co/JkHm7IgeaN": 0, "Microsoft Targets Apple Again with New Surface 2 Commercials http://t.co/lPGuA78QWq #iPadAir #TechTronicShow #TechTronicShow": 0, "Microsoft's Xbox Video website is now live, though it doesn't stream in HD http://t.co/pnSD5eeOTz #startup #Dubai #GCC": 0, "Console review: Microsoft's Xbox One makes a play for your living room http://t.co/PqNGo29pqz": 0, "Happy Thanksgiving. http://t.co/gXtMtZoXbb http://t.co/OHhNEtzOVb": 0, "Stars enjoy a girls' night out http://t.co/SV7u5Ie42b via http://t.co/3cVMRz99nh #worldnews": 0, "For this first time in my life I have actually done some sixth form work at home, can't get myself of Microsoft word now cho": 0, "I completed the game Microsoft Minesweeper (Win 8) - http://t.co/cSk4bWm4fw": 0, "A microsoft aggroup tollgate is growingly save an documentation in re partners: RbBgjNbfG": 0, "I just sold a customer a #surface2 to run #act - You're welcome @Microsoft.": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying http://t.co/kuZrU8ztyf #microsoft #nsa": 0, "RT @iStrainGuide: In 16th century #Egypt, balls of hammered #marijuana leaves called 'assis' were popularly consumed.http://t.co/phGDqAKlSH": 0, "Microsoft Targets Apple Again with New Surface 2 Commercials http://t.co/WJ8krktrTq Via Technobuffalo": 0, "Giggle Palooza: Thank You  Giggle Palooza http://t.co/TtGbOh8hmB via http://t.co/fnTDKnNbKt #funny": 0, "Amazing shoes and bags: new image http://t.co/5vy7GVZMLX via http://t.co/qiQqBbpNxe #fashion": 0, "@jameskyle Microsoft is still the publisher of the game, regardless of the status of GFWL, so ultimately that's up to them.": 0, "Report: Microsoft plans to secure its internal communications against NSA spying http://t.co/YcML4ar0iC": 0, "Funniest pictures ever: new image http://t.co/ApQ3lvBiYL #funny via http://t.co/fnTDKnNbKt": 0, "Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/gtdAnZ6GY4 #InfoSec": 0, "@skipdrxvv looks like Friday all being well down to Microsoft": 0, "RT @Points4Free: Since we did not receive our 300 retweets by 12:00 ET. We have randomly messaged 25 of our followers a free microsoft code": 0, "Fable 2 for Xbox 360 http://t.co/FT46h8nbMv": 0, "\"@IGN: A Halo 4 programmer left Microsoft to team up with Naughty Dog http://t.co/Q1wp4FKcrB\" steppin up in the world.": 0, "Freedom Cry DLC Trailer Featuring Adewale| Assassin's Creed IV Black Flag... http://t.co/Ma4CluQ0q0 via http://t.co/EvmIlaxnxL": 0, "Microsoft Targets Apple Again with New Surface 2 Commercials: Microsoft released two new commercials for the Surface 2 yesterday, fal...": 0, "Microsoft Xbox One Day one Edition 500 GB Black Console: $650.00 (0 Bids) End Date: Thursday http://t.co/cSC61krZrp": 0, "Get Your Microsoft Points Utilizing Our Project Findings For A Limited Time http://t.co/kqxDQ0tExj": 0, "Insanely Funny Shit: new image http://t.co/1KgVoReF5j #funny via http://t.co/fnTDKnNbKt http://t.co/pFc0LR0sX9": 0, "ELLE Magazine (US): 5 food swaps for a lighter, yummier Thanksgiving: http://t.co/RCopDo13Ua via http://t.co/qiQqBbpNxe": 0, "As Nadella And Mulally Lead In #Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/R0N3B7loqN": 0, "Microsoft Has Responded To The Smoking Xbox One Console Claims | N4G http://t.co/O6o8OZIwGe": 0, "Microsoft offers free Dead Rising 3 download due to faulty Xbox One disc drive: Microsoft is offering new Xbox... http://t.co/gQpDni5CsX": 0, "Microsoft Takes On The iPad Yet Again With New Surface 2 Ads [Video] http://t.co/jAzWJPZyMV": 0, "RT @Microsoft_Xbox3: #Xbox One Release Follows Familiar Pattern: Best Buy employees unload #Microsoft #Xbox One #consoles from an a... http": 0, "Microsoft Xbox One (Latest Model)- Day One Edition 500 GB Black Console: $600.00 (0 Bids) End http://t.co/8LlTOzDbZj": 0, "@albedos_shadow do you know anything about the microsoft surface tablet?????": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals - PC Magazine http://t.co/nkbBenCHhv": 0, "#New  #Ps3  #Xbox #5: Gears of War: Judgement (Xbox 360): Gears of War: Judgement (Xbox 360) by Microsoft  167... http://t.co/kw36mDUJ3X": 0, "Donate on #GivingTuesday to @HafFdtn helping women pursing higher education &amp; @Microsoft will match it: http://t.co/mmzEGJuHXO @GlobalGiving": 0, "Microsoft to step up encryption to thwart NSA - http://t.co/wYLylwkuRJ": 0, "@Microsoft We get shit specs and i dont want to talk to my xbox, i just want to play siriously fuck sakes siriously.": 0, "#Microsoft #News: \"Microsoft bans users for 'excessive profanity' in Xbox One video uploads - The Guardian\" http://t.co/XtiJKw0teS": 0, "Report: Microsoft Mulls Stronger Encryption Amidst NSA Spying: Microsoft is the latest tech firm to fortify its network in the face o...": 0, "Microsoft Dynamics GP Consultant (#Dallas, TX) https://t.co/1IyNViOpXt": 0, "Fed Up With Cheating OEMs, Microsoft Trolls Chromebooks in New Ad  #dailytech http://t.co/JP2g80HT5O": 0, "RT @slashgear: Microsoft takes a dig at Samsung in Surface vs. Galaxy Tab commercial http://t.co/qgkGmtxlDL": 0, "@TechnoBuffalo: Microsoft Targets Apple Again with New Surface 2 Commercials http://t.co/kSpdzSBA6N I am so sick of them I mean ugh": 0, "@democracynow ... and it's totally not loaded with #NSA backdoors this time! Nudge nudge, wink wink, Microsoft BOB's your uncle": 0, "@burnie @AH_BrownMan My dad made Microsoft and I'm a hacker, she'll be offline by tomorrow.": 0, "Can't bring myself to buy #Forza5 with the current microtransaction economy making it worse to earn cars.... Come on #Microsoft ...": 0, "Raul Seixas FANfinity app for Windows in the Windows Store http://t.co/n14fz2Ev0k": 0, "How do I add page numbers in Microsoft Word 2010 with out having them on my cover page and table... http://t.co/Z9zIPndjvi": 0, "Latest Snowden Leak Says NSA Tracked Muslims' Porn Habits http://t.co/9NPqAKvc9m via http://t.co/hdZI6v6ii9 #uspolitics": 0, "@IvansGaming Sorry for the info in our last tweet. The account balanced is tied to the Microsoft account. If you were to change the...^EB": 0, "Ad for both a Microsoft tablet and the Grammys? That's so CBS #Survivor #BloodVsWater": 0, "227's YouTube Chili' Xbox Live Microsoft Points Generator Updated + Working Generateur de ... http://t.co/0vvahBewFF Jamaal Al-Din - NBA": 0, "$ Will Antel Defeat Wintel?: For years, Microsoft and Intel dominated the world of computing. Soon, Google and... http://t.co/CiO50eu2g8": 0, "@XxSoniaAslamxX Once Office is uninstalled you can reinstall it here: http://t.co/Z3QdZpvBlg. Please let us know how you make out. ^AEM": 0, "LG's connected Smart ThinQ oven http://t.co/rcGZpW4u3T via http://t.co/EvmIlaxnxL #technews": 0, "Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/otYimYd2IM #Win8 #FunApps": 0, "Microsoft Xbox One Day One Edition - 500 GB with Kincet and Headset!!! SHIP ASAP http://t.co/eGJo5a5jWp": 0, "@CVG_News: Microsoft apologises for 'sexist' Xbox One promo http://t.co/15lXkabDRv @_pip_pop_ some people need to hire a sense-checker....": 0, "Plzen coach pleased with performance http://t.co/POQJ3Qbh1k via http://t.co/3cVMRz99nh #worldnews": 0, "Appreneur Challenge, there are X-box One consoles up for grabs* (be quick as they wont last long!), and a... http://t.co/iIHv22YiIW": 0, "@TheOfficialElf Please check out Santa's Advent Calendar! Hope you like it! #advent   #CountdownToChristmas http://t.co/wUveyUyZ5x xxx": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/KljXZMqjJd": 0, "RT @NeowinFeed: Report: Microsoft to encrypt more of its data to prevent NSA spying http://t.co/kuZrU8ztyf #microsoft #nsa": 0, "@ellyberries @SailorSoapbox if you need to sell a privacy cover for your camera peripheral...there's something WRONG Microsoft.": 0, "New on Ebay Microsoft Xbox One - 1 - 500 GB Black Console with Ghosts -In stock! http://t.co/TQ5mOlfTbY http://t.co/d2aJ8TrRyJ": 0, "#Microsoft Delivers Huge PDF to Compile the Windows Server 2012 #TechNet... http://t.co/gMWgE4ouEq": 0, "Bellator MMA: The Good, The New &amp; The Record Breaking - Read the recap o... http://t.co/ZhZ2ABzDTj via http://t.co/ABUaH7ML8Q": 0, "Rettinger's Rants: Giving Thanks http://t.co/L5unpDsJPo via http://t.co/EvmIlaxnxL #technews": 0, "RT @notoriousBIDz: Hey @Microsoft: Is this actually how you market @Xbox to women? Thanks for the stereotypes and alienation!! http://t.co/": 0, "Congrats KendraK, #TwitterTuesday winner of FIFA Street, Soccer 13 &amp; #XBLG for commenting on the FIFA 14 #EZ course! http://t.co/8yuUmJCxIS": 0, "CBC News: 10 fun facts about America's Thanksgiving turkey pardon: http://t.co/4ESkbBuxoA via http://t.co/3cVMRz99nh http://t.co/XibZuFo020": 0, "Microsoft word is very intelligent, I wrote your name and it marked it1) Vodka is made from potatoes, 2) Potatoes are v": 0, "Apple acquires the company behind Microsoft's Kinect http://t.co/CIi1oCe4x2": 0, "@Totalbiscuit They should charge an additional $50 for every pasting of their links about Microsoft games and call it a \"viewing license.\"": 0, "Microsoft billionaire Paul Allen adds a $27 million home in Atherton, America's priciest zip code, to his collection http://t.co/dxzV2twloP": 0, "RT @kyee: If I want to call my buddy a fucking n00b when I kick his ass I will call him that. Fuck you microsoft.": 0, "The phone call my dad just had: \"You're with Microsoft.....well I ain't got a Microsoft thing in this house because I'm an apple guy. ADIOS\"": 0, "Why does Microsoft Silverlight get a free pass when we complain about the frequency of iTunes updates?": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/sW1QHyKn8V": 0, "RT @GamingNews24: GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have ... http://t.co/TLld84gUzH #G": 0, "RT @Juniper_UK: @JuniperNetworks + Microsoft #Lync = the Best Unified Communications Platform http://t.co/KTiT1X4djx": 0, "Microsoft investigating MS Windows local privilege escalation zero-day: In a new security alert Microsoft anno... http://t.co/2sx9WWOckx": 0, "Not Satisfied with Google and Apple, New Microsoft Ad Targets Samsung... (See+ on What: http://t.co/v5u0m4bqxu)": 0, "@PhinaVera @gennybaybiie will one of u tell me who Microsoft is ? ": 0, "Played some #XboxOne at the Microsoft store. Forza 5 is seriously fun. @ Microsoft Specialty Store http://t.co/FbyW4SUGv8": 0, "Microsoft Boosts Encryption to Guard Traffic Against NSA Snooping http://t.co/AypkF01RPI": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional: We were somewhat surprised... http://t.co/5KmQK8h3G1": 0, "RT @TechCrunch: Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One http://t.co/VhtPfxYBdX by @": 0, "Mother***ing a**holes over at Microsoft are trying to f***ing censor your game commentary http://t.co/m6YrdeRtRH": 0, "RT @silverbacklive: Microsoft's Xbox Video website is now live, though it doesn't stream in HD http://t.co/pnSD5eeOTz #startup #Dubai #GCC": 0, "Police warn about new twist on #Microsoft Tech Support scam http://t.co/Tz1ZNTxFZ8": 0, "Microsoft Releases Security Advisory 2914486: Today we released Security Advisory 2914486 regarding a local el... http://t.co/oEsxYLjOpV": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks http://t.co/jwDPDcXSXp #infosec": 0, "RT @HuffingtonPost: Gloves off: Microsoft reportedly wants to step up its fight against the NSA http://t.co/4PHhojEFu3": 0, "I love @bing so much that I've fully converted to it. I just wish @Microsoft would make @IE faster than Google Chrome.": 0, "@WWERollins @PlayStation 4 of course , sony is much better than microsoft": 0, "RT @Jennifer_Sky: I am thankful for innovative and forgiving editors, Microsoft word/Apple laptops, and beer. #amwriting": 0, "Microsoft SQL Server Integration Services (SSIS) Engineer: Not Specified, 2 yr of exp, posted on 28 Nov 2013 12:57:00 http://t.co/BFlG6sFaL4": 0, "RT @BenQAmerica: Congratulations to Evil Geniuses @JWonggg for winning the Microsoft Xbox one Killer Instinct tournament! http://t.co/JdFF0": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/kwR5ZA3a5p": 0, "Kayla Harrison, World Cha...: new image http://t.co/dxnm7aVSLq via http://t.co/jDAwU42y28 #olympics http://t.co/v7ULBzjSwr": 0, "Nokia Lumia 1020 Camera Features Video: Microsoft Windows Phone Launch New Advert for 41MP Lumia 1020 Smartphon... http://t.co/j56FxP3spj": 0, "Microsoft to step up encryption to thwart NSA - USA TODAY http://t.co/f2Yi7aL8yW": 0, "So happy that Microsoft has made Xbox Music finally free to use just like Spotify. I can now easily sync my... http://t.co/aNAmYiM1WV": 0, "Microsoft admits three operating systems is a crowd: UNITED STATES, Nov 28  The company accepts that having t... http://t.co/KN141TLyOu": 0, "RT @gadevarona: Microsoft Releases New Surface 2 Ad Targeting The iPad Air http://t.co/bdfE0fpMyw #entertainment #gaming #tech #gadgets": 0, "Insanely Funny Shit: new image http://t.co/uEDwCJOLuU #funny via http://t.co/fnTDKnNbKt http://t.co/Cjqn1yTnGk": 0, "@BrySkye In reality I don't have much against Microsoft. They have just never had many games for their platforms that I was interested in.": 0, "Dear @Microsoft thanks for the update that distorts all the Twitter pictures on my new laptop. Assholes.": 0, "microsoft word says concealer isnt a word    ok": 0, "Search sa Google + Copy + Paste sa Microsoft Word + ipapa-print = ASSIGNMENT": 0, "Here are some astounding Wallpapers From the Artist CygX1 http://t.co/0PByS9KQdk": 0, "Job: Senior Microsoft Systems Engineer http://t.co/jc9fMQCO4M": 0, "Microsoft apologizes for 'sexist' Xbox One promo: \"We meant no offense,\" says rep as firm i... http://t.co/7xCLFf6S85 #games #gaming #uk": 0, "RT @preginald: Microsoft bans users for 'excessive profanity' in Xbox One video uploads - The Guardian http://t.co/QaYwmaOmQJ #microsoft": 0, "RT @GAMING_LOUNGE: Microsoft 'working to fix' Xbox Live connection issues: Xbox Live outage forces users offline temporarily. Mic... http:/": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/Xzg4iodJf2": 0, "#Microsoft Explains Why 'Halo 4' Didn't Debut On #Xbox One: If there's a common refrain going around the gamin... http://t.co/u3bi5PPJIF": 0, "\"@TheBatmanbitchz: Wow, check out the new XBOX controller... http://t.co/UlHAi5RyJt\"\n\nI might have to switch to Microsoft... Nah  you @Sony": 0, "Microsoft May Finally Put Windows RT Out To Pasture - onyxruby writes \"Microsoft may finally be ready to put Windo... http://t.co/tLP4dacf13": 0, "@LadyInBlack689 2/2 Please perform the steps at http://t.co/I0vb9u1XRS to secure your account. Let us know if the spam emails stop. ^KB": 0, "@DuncanVarley @AntDeRosa Yes, Microsoft should just adopt Chrome or Webkit. Right? You seem to have a weak understanding of competition,": 0, "@Microsoft if you think I'm buying an Xbox One because of this, you're wrong": 0, "Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time http://t.co/5M5HtS7C9m QPS MEDIA": 0, "@almightygod thy will be done @ http://t.co/sN5lUJhOHU http://t.co/NxibvCvjrw": 0, "@googlechrome I know you and @Microsoft don't get along very well but PLEASE PLEASE make #Chromecast compatible with @windowsphone devices!": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/jqkkFDf95Q": 0, "BizzViz: Microsofts New Xbox One Ad Criticized as Sexist - In the wake of mass praise for Gold... http://t.co/0Bu24TLDUu": 0, "RT @peterjukes: NI contracted Essential Computing to go over to PST system for Microsoft Outlook \"only for the last twelve months\"": 0, "@mesastar Have a read! RT @mashable: Microsoft's 'Sexist' Xbox One Ad Stirs Controversy http://t.co/ou3YUxV300": 0, "is it possible to download Microsoft word on a mac book?": 0, "@neoookami @luckyturner True and thats probably valid in Microsoft's case.": 0, "RT @Jezebel: Microsoft knows women play video games too, right? http://t.co/GkOBmHcqba": 0, "I liked a @YouTube video from @angelysaras http://t.co/ITxjwJzJST Sony VS Microsoft | Playstation Holanda lanza una indirecta a Xbox": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/i6wxmJMUED": 0, "MMA BEAT DOWN: Are you watching? http://t.co/mHk79dHxIG via http://t.co/ABUaH7ML8Q #mma http://t.co/8bdysGPkTf": 0, "@alex You know, the letter from Microsoft you talked about never said anything about Nazi ideology being bad. They are nazis now.": 0, "Ffs microsoft stop being so stingy and put some bloody decent games on gold for a change!!! #xbox #damnyoumicrosoft": 0, "http://t.co/s2pgtCQZ1x found article on  http://t.co/EdUeuIq4Ul  Microsoft #releases Office 365 updates": 0, "Inked Magazine France: INKED Girl du jour\nContinuons la mobilisation !\n#... http://t.co/n02cO0EQhG via http://t.co/a3cv3RrZ94": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have exp... http://t.co/mWdruB9qlU #iphone #games": 0, "\"Sexist\" Xbox One Letter Needs Some Changes - When the Xbox One launched, Microsoft tried to get clever and provid... http://t.co/CF4ig1UlVm": 0, "#XboxOne Microsoft Launches Xbox Video Website: \nMicrosoft's video rental service is now available via browser... http://t.co/zjU6uNmXIt": 0, "Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic http://t.co/FA3YaKQahK": 0, "Haru, I want you to contact IBM.       I need software for killing Microsoft Windows": 0, "RT @WinBetaDotOrg: Earlier: Microsoft launches web version of Xbox Video, is similar to the Windows 8.1 app http://t.co/ukFioQFMyr": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One http://t.co/z0AdUi6lxw": 0, "#Tech Microsoft Targets Apple Again with New Surface 2 Commercials http://t.co/elsbqwrzyT #Onlireeks": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One http://t.co/FaovZgu9bu #TC #xbox_one": 0, "@kirby Is this on Xbox One? What were you doing when you received that error? Can you log in at http://t.co/vnMNLgBa8l? ^RZ": 0, "Bring your family closer together with @Adobe Revel for Windows: the private place to view &amp; share everyday photos! http://t.co/nHDnzSWBIA": 0, "NSA spygate concerns prompt Microsoft to encrypt its internet traffic  Tech News and Analysis http://t.co/0Sw61lGbll": 0, "\"Your most unhappy customers are your greatest source of learning.\" -Bill Gates, Microsoft #inspirational #business http://t.co/0T27KfcScC": 0, "Oh! One of the Mirage OS dev Steven Hand is joining @MSFTResearch . Good thing. :-) http://t.co/T9tyAfwK24 now at http://t.co/eRTuAeWt5W": 0, "New Techdirt Post Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional http://t.co/6r3naWEbgQ": 0, "@Healthykids please check out Santa's Advent Calendar! Healthier than chocolate, no allergies &amp; cheaper too!  http://t.co/wUveyUyZ5x xxx": 0, "Is Windows RT dead? http://t.co/GQ6fXO8nFH": 0, "88 Acres - Great example of brand journalism from Microsoft http://t.co/U1xUttSv5o": 0, "@MoshpitGames if only Microsoft weren't so bad": 0, "@Microsoft I really think the xbox team fucked up, It needs to sell with a connect, really? Do they not have imaginations.": 0, "RT @GreatFireChina: Pinch us. Was it a dream or did this really happen? Has Microsoft lifted censorship restrictions for Skype in China? ht": 0, "Rio 2016 Facebook: Somewhere over the rainbow..... http://t.co/176uiICYRO via http://t.co/jDAwU42y28 #olympics http://t.co/Z2KOVeSf14": 0, "RT @lee_stott: @JvanRij congrats on your Develop top 100 European Developers! http://t.co/181mHgPeyJ #WGA #Microsoft": 0, "UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/5qHpLDoHMO #Win8 #FunApps": 0, "Words To Inspire the Soul: new image http://t.co/WVE4mdKamB via http://t.co/gxktWhKfbI #quotes http://t.co/OdyCGUCxPK": 0, "Microsoft 'working to fix' Xbox Live connectivity issues http://t.co/2cVykk6hZv": 0, "An intelligent operating room uses #Microsoft technologies for more precise surgeries &amp; better training! Check it out http://t.co/Y2M1ZjUayb": 0, "Convertible PCs: Why The Sun Won't Shine For Microsoft, HP - Forbes http://t.co/OtTJWHe42o": 0, "Microsoft takes a dig at Samsung in Surface vs. Galaxy Tab commercial http://t.co/xswYYIARx2": 0, "RT @RT_com: Suspicious of NSA spying, Microsoft moves to encrypt Internet traffic - report http://t.co/U95DxZIOXg": 0, "@RaisedDongers Thanks for reaching out. Let's get you to go to http://t.co/ZhkRvEWBvn and check out the last drop down. ^KLM": 0, "Microsoft alienates female gamers with a sexist letter to dudes http://t.co/WTMoEUcZqM": 0, "RT @Pixelania: Gears of War y Shoot Many Robots gratis en diciembre http://t.co/tgw13iFzAc Microsoft da a conocer los juegos gratis de Game": 0, "@ExpertZone @Microsoft the surface! A firm favourite! :)": 0, "Microsoft Surface (RT) 32GB, Wi-Fi 10.6in Black with touch cover used for a week:  $255.00 (4 Bids)End Date: T... http://t.co/gnqzp3Llzn": 0, "Skype for China now talks directly to Microsoft, may reduce government snooping - http://t.co/6o2l41sZSn http://t.co/VbL9wG2eEZ": 0, "Windows 8.1 seems like a good improvement. Well done Microsoft. #Windows8 #Microsoft": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional (Mike Masnick/Techdirt) http://t.co/vIUphgLnc8": 0, "@ATVIAssist You are like the PepsiCo of gaming. Or Dell. Or Microsoft. Hey wai--": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional | Techdirt https://t.co/aYzDJ1VXj8": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying http://t.co/xCya9tcUmm #tech #news #web": 0, "Resolution 70-450 art form optimizing otherwise maintaining a database administrative expounding use microsoft ...": 0, "RT @Microsoft: Join Microsoft employees supporting Xbot Robotics and other youth causes #GivingHero: http://t.co/Sl1PuHslKA http://t.co/drG": 0, "it's bildford page http://t.co/7NrZ66S7Vu": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/jAE6fArwgv": 0, "RT @MarkSKrikorian: This Thanksgiving discuss Microsoft case before Board of Alien Labor Certification Appeals http://t.co/0uLoKWfJxJ #Gott": 0, "RT @MrMikeEaton: Are we still outraged over that Microsoft ad from earlier today? Well, here are my thoughts anyway: http://t.co/hx8oOU2gsd": 0, "I forgot to mention that the long install times on Xbox One might be another attempt from Microsoft to push digital over physical.": 0, "I am at the Microsoft Store in Prudential boy, it is not black friday yet and these guys are selling the XBOX like crazy! #hotstuff": 0, "RT @verge: Black Friday 2013: all the best deals from Target, Best Buy, Apple, Microsoft, and more http://t.co/PI9nwQYEfy": 0, "So, Micro$oft is banning people for swearing... \nGod dammit Microsoft, God dammit": 0, "Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/D7TZ4dsnBe": 0, "Gears of War - Microsoft discute el futuro de Gears of War: Phil Spencer, vicepresidente corporativo de Micros... http://t.co/cuqaUQ8FQ5": 0, "MS #Security #Advisory (2914486): Vulnerability in #Microsoft Windows Kernel Could Allow Elevation of Privilege -... http://t.co/ZBikyeK5Lk": 0, "RT @reuters: Microsoft blocks censorship of Skype in China: advocacy group  http://t.co/1xOuJDsYQ7": 0, "BookDesignTemplates @BookTemplates easily create beautiful books right in Microsoft Word. Get 30% off all November with the code: NANO30": 0, "Oh fucking lighten up kotaku. http://t.co/8cHwyh7jq0": 0, "Microsoft 'working to fix' Xbox Live connection issues - http://t.co/BSUIoxb6ts http://t.co/iMGgVvc34v": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/AnH1KZgzAS": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft hav... http://t.co/TLld84gUzH #Gamespotreview #GN": 0, "RT @DLSUD: DLSU-D joins Microsoft Partners in Learning | De La Salle University - Dasmarias: http://t.co/Pd2cUDbMiB": 0, "I am removing Microsoft Office:mac 2011 from my MacBook Pro and will not be reinstalling @Office": 0, "I'm a bit prideful when it comes to video game systems. I'm a Nintendo fan at heart. Microsoft and Sony are generic.": 0, "RT @slashdot: Microsoft May Finally Put Windows RT Out To Pasture http://t.co/ASk3V9b2Pb": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/XMSkVrcnJo": 0, "@JesterNJ @Bear_Commander @NSantilloxJLAx when I spoke to Microsoft support they ended up giving me a static IP address for my Xbox": 0, "@BalrogTheMaster And that is why your dad is a Microsoft guy.": 0, "Microsoft office 365 home premium version 2013 is absolute Gandh! Crashes every 2 weeks u bunch of luns. #Microsoft #Fuck you": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have ex... http://t.co/mWdruB9qlU #android #games": 0, "Microsoft moments is out! http://t.co/u79yftSspi": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have exp... http://t.co/UbHRhOSpaA #iphone #games": 0, "Tattooed Women: new image http://t.co/mlZoxwqaqV #tattoos via http://t.co/a3cv3RrZ94": 0, "@MGarvis @Microsoft - No big deal, Microsoft Lync, Office and other MS products run on Macs.MS is inclusive not exclusive": 0, "Mike Eaton channeled his inner Mike Eaton tonight RE: the Microsoft PR blunder http://t.co/eeKciBsnvt": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/t0qIb5L6yR": 0, "RT @megashaun: SERIOUSLY WTF IS THIS BULLSHIT http://t.co/WsTE5KH2xu": 0, "But fine w Windows backdoors RT @techdirt: Microsoft To Encrypt Data ... Says NSA Hacking Would Be Unconstitutional http://t.co/KfHXsECFCt": 0, "RT @halberenson: MSFT in \"take no prisoners mode.  http://t.co/Dippz2njKx": 0, "MMA Rankings: Danny Missin http://t.co/P9F2wjRNPh via http://t.co/ABUaH7ML8Q #mma": 0, "Textbook error. Presumably someone in marketing sacked. http://t.co/cEd2Ey9zQ7": 0, "I liked a @YouTube video from @sazardmlg http://t.co/h54rT5MJoX Giveaway - XBL 1 Month or 1600 Microsoft Points": 0, "Microsoft will combine all Windows operation systems in one. - http://t.co/obykwwzA6t http://t.co/0PlLHtVwfZ #gadgetifo": 0, "November 22. The best day for nintendo and microsoft gamers. Sucks that Mario Party is getting low scores. i was pumped for that game.": 0, "RT @washingtonpost: Microsoft plans to boost security over NSA fears http://t.co/VsfZZg3BGr": 0, "Black Friday 2013: all the best deals from Target, Best Buy, Apple, Microsoft, and more http://t.co/zaAJkUt81g": 0, "Damn! Funny: new image http://t.co/A2hZzFcd9F via http://t.co/fnTDKnNbKt #funny": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/ag0TwJOfQA": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/2XxyDNNeqx": 0, "you know you epically spelled a word incorrectly when Microsoft Word can't even figure it out:/ #10pagepaperkickingmybutt": 0, "@Xbox @XboxAustralia @giz_au Hey MSFT, this guy is stirring up claims about you being sexist. @lukehopewell http://t.co/R9xWT4QLTi": 0, "The Foreign Bureau: WSJ's Global News Update http://t.co/PeTP6xXd3K via http://t.co/3cVMRz99nh #worldnews": 0, "BBC News - Microsoft responds to Xbox problem with disc drive http://t.co/lKNXFW8fQq": 0, "Microsoft apologises for 'sexist' Xbox One promo http://t.co/WnX3qDn2nI": 0, "Microsoft 'working to fix' Xbox Live connection issues - http://t.co/VHeyc2WQ0E http://t.co/fPprd6aWlq": 0, "RT @securezoo: Another reason to upgrade Windows XP &amp; 2003...New 0-day Bug in MS Windows Kernel Could Allow Elevation of Privilege: http://": 0, "Amazon Is Crushing IBM, Microsoft, And Google In Cloud Computing http://t.co/55jHyes4M0": 0, "UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/UBBJDy4FCK #Win8 #FunApps": 0, "RT @SpaceDrakeCF: God DAMMIT, both Robin and I should be getting work done but Microsoft's comedy train today is RELENTLESS: http://t.co/vZ": 0, "Microsoft skirts China's censorship of Skype http://t.co/BvvO9Mjc5p": 0, "Microsoft May Finally Put Windows RT Out To Pasture - onyxruby writes \"Microsoft may finally be ready to put Windo... http://t.co/nv9fAajeZx": 0, "Microsoft Knows Women Play Video Games Too, Right? http://t.co/qUI2JsYWKE": 0, "Curious$: Microsofts New Xbox One Ad Criticized as Sexist - In the wake of mass praise for ... http://t.co/3icshTaC8x": 0, "Microsoft to acquire Nokia. Learn what advantages this will provide businesses - http://t.co/MpGbmKrYw7 http://t.co/gWMCHzQmIb": 0, "Shipped Out Of Luck from \"The Glitch That Stole Christmas\" | DADS | FOX BRO... http://t.co/vmRwijIGvW via http://t.co/tXjObGiDiU": 0, "@ThunderS7ruck MICROSOFT FUCK U": 0, "shared a link http://t.co/xH5al5LI8g": 0, "RT @Mr_iKeepitreal: I wish Sony &amp; Microsoft did give me free consoles. I spent  waaaaay to much money this month lol": 0, "Syrian FM: Opposition 'from Middle Ages' http://t.co/o1yDQVlSmM via http://t.co/3cVMRz99nh #worldnews": 0, "Apple Inc. (AAPL), #Microsoft #Corporation (MSFT): 'Most Valued' on Forbes 100: Next #iPhone News: It is there... http://t.co/G1L51l0mNh": 0, "Gears of War free on #Xbox Live in December: #GameSpot: #Microsoft today announced that the next set of free g... http://t.co/3oc55YC4Fq": 0, "ThinkGeek: Don't look, son: http://t.co/jjzK48xC9r via http://t.co/EvmIlaxnxL #technews": 0, "Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic -  http://t.co/qQoKFTDj4S http://t.co/dqYgNKgtIE": 0, "@delphijunkie Probably running Microsoft software I bet. That'll do it. :)\n\nI said it because you're known to make the same tweet re Apple": 0, "Microsoft will ban XBONE users from Live if they swear on uploaded recordings, ignoring games already full of cursing #DoubleStandard #LULZ": 0, "Microsoft plans to boost security over spying fears http://t.co/i2vNg0uNhU": 0, "@LitMattches Was that Microsoft's or Square's idea?": 0, "@SeroEternity no but if you give me Microsoft points I'm have a good chance to get it :D": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/yi1mFt3wwA": 0, "Xbox one for Sale: http://t.co/V33JhkDweT": 0, "@TheGolfbum If you'd like to be sure before you try it you can call your local support team: http://t.co/eIRsqX4Xpa. Does this help? ^KM": 0, "RT @CVG_News: Microsoft apologises for 'sexist' Xbox One promo http://t.co/WnX3qDn2nI": 0, "Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic via @washingtonpost http://t.co/uyqZ0ol5Ar": 0, "Gaming's Next Revolution Will Be Livestreamed, And The PS4 Has A Nice Lead http://t.co/h7UIawuwuj #Gadgets #Gaming #Microsoft": 0, "@KingsCrossingTr You may want to try some of these suggestions: http://t.co/43smoQlzUJ http://t.co/Kpnv41Jmfm": 0, "The education offer for Microsoft Surface endedbut JB Hi-Fi have a special deal http://t.co/KvVJgmmlYx #microsoft": 0, "#geek #nerd #gamer: #Xbox gamers suspended in cursing crackdown -  (CNN) -- What the... http://t.co/zmLp712eyJ\n #microsoft #UploadStudio": 0, "Plus with Microsoft's record with console's, you average co sole will be fucked in 3 months. Enjoy": 0, "Microsoft doesn't recognize half of the words in my bio lecture notes as actual words #shady": 0, "Microsoft 'working to fix' Xbox Live connectivity issues [Update] http://t.co/fgS6JWRBzR": 0, "Microsoft apologizes for 'sexist' Xbox One promo http://t.co/CeRyOVcMCb #News": 0, "Microsoft May Finally Put Windows RT Out To Pasture (Soulskill/Slashdot) http://t.co/YEADtYmOvb": 0, "@Jono2012Murphy Please check out the steps here http://t.co/tv2JFRwCbW to troubleshoot the app issues you're facing. Does this help? ^KB": 0, "Microsoft apologize for the letter and another day of press is secured http://t.co/rx0hWqm2EB": 0, "@ethanlevine Ahem, it was I love Microsoft and then followed with, why cant they get it right I never wanted a Pro! #factcheck": 0, "Guide to using Organisation charts in Microsoft #PowerPoint and Visio http://t.co/SMQ1Ullvys\n #FeaturedVideos": 0, "Microsoft bought Skype for 8,5 billion dollars, HAHA idiots! They couldow to love hurts you, Dont get it twisted,,, -TG": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/OFzApTdttY": 0, "Microsoft Corp sold over 1 million of its new Xbox One game consoles within 24 hours .. http://t.co/ZxISsSGSPB": 0, "FINISH MICROSOFT OFFICE": 0, "Microsoft Taps 'Pawn Stars' to Scroogle Over Google Chromebooks http://t.co/eLj0qXQwTM via @DashBurst": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/y9LHt3hx4k VIA @TechCrunch": 0, "$Land: Microsoft's New Xbox One Ad Criticized as Sexist - In the wake of mass praise for GoldieB... http://t.co/9RaSCuHYsq": 0, "Microsoft playing rough again...   http://t.co/OPcLbDKUFY": 0, "@AlienOptimist So many 360 users out there all think @Microsoft and @Xbox are the best. I'll explain y cause I'm running out of letters lol": 0, "Research suggests Microsoft has lifted censorship restrictions for new version of Skype in China http://t.co/sdRH7odgfo": 0, "New Post: Microsoft plays dirty with this anti chromebook ad [Video] http://t.co/f7eLrcOgyS": 0, "Job: Senior Microsoft Systems Engineer http://t.co/HNDrYtaEQb": 0, "@justin_kadafi We suggest trying the solutions posted here: http://t.co/Ym2oCWfSek. Please let us know how you make out. ^AEM": 0, "New on Ebay Microsoft Xbox One Console, Brand New, Sealed, In Hand Ready To Go!! Reading http://t.co/z3tcnPDiQM http://t.co/PdQVctrIjC": 0, "Microsoft's marketing strategies are so classless, they could be a Marxist utopia. #BURRRRRRRNNNNNN": 0, "Download and give pointers to students by installing this Win 8 app http://t.co/gNEzUmKkmm #windows81 #seo #CallOfDutyGhosts": 0, "Ridiculous! Welcome to the 21th century #Microsoft! RT @briecode: Microsoft Knows Women Play Video Games Too, Right? http://t.co/A93wvVQS7U": 0, "Vogue Australia: Five reasons to use an instant film camera - a #SpyStyl... http://t.co/RYfc9odlBy via http://t.co/qiQqBbpNxe": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/QVNJbMZ6Kp": 0, "Giveaway - XBL 1 Month or 1600 Microsoft Points: http://t.co/PCQHYldwgn via @YouTube": 0, "\"@BennieVaIentine: @gennybaybiie @PhinaVera  I'm confused are we talking bout Microsoft or ?\"ahhh here bennie": 0, "@_dml Not at the Microsoft Store where I bought it....": 0, "Gamespot - Android GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have... http://t.co/Bx4nijpmfB": 0, "Bout time @slashdot Microsoft May Finally Put Windows RT Out To Pasture http://t.co/fRFVZssiR5": 0, "Here are some Celebrity Pencil Drawings from Various Artists See: *** http://t.co/1ImoLWlR7r": 0, "Microsoft attacks Google Chromebooks with new Scroogled video advertisement - New Blog Update http://t.co/6ZKiblk2tJ #webdesigning": 0, "Microsoft 32GB #Surface, $199.99 for #BlackFriday. Double the device, not the price. http://t.co/Aj2rQqDxlj http://t.co/xdxseW06Yj": 0, "#Microsoft Enlists Pawn Stars To Mock Googles Chromebooks http://t.co/z667I2IVzR #tech": 0, "Microsoft said it sold more than one million Xbox One consoles Bits Blog Xbox One Release Follows Familiar": 0, "@RelUnrelated Didn't work, of course, but it was interesting to find out how easy it is to get into Microsoft stuff and mess with it..:)": 0, "#videogames Microsoft 'working to fix' Xbox Live connectivity issues http://t.co/Z1i9b1T5jl": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/cL0kDHuZzV": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/znDf4QTPlh": 0, "Approaches to Performance Evaluation: Microsoft, Culture, and Stack Ranking http://t.co/UK2eSQi3ca": 0, "Forget Doctors Note, Microsoft Now Allows You To Write Perfect Letter To http://t.co/V0Ddvujezj #wp8 #windowsphone": 0, "Love and Inspiration: new image http://t.co/wsoVRgxYDs via http://t.co/gxktWhKfbI #quotes": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let ... - TechCrunch http://t.co/18XNAqqcua": 0, "RegisterUK headline of the day: Microsoft very sore after backdoor access by NSA  will now encrypt networks http://t.co/VhiWTphFqX": 0, "Digital Home Base for the Living Room -  Microsoft's new Xbox One game is aimed at those who don't... http://t.co/BiXLC6LFWa\n #VolumeDelayed": 0, "Schedule an Appointment http://t.co/8jmrTsQ2mW #MSDYNCOMM": 0, "Will Google Docs kill off Microsoft Office? http://t.co/rLyZpmuxG9": 0, "Xbox Ad Criticized as Sexist http://t.co/1XE9l59sJy": 0, "http://t.co/TbzI0fMz06 Microsoft has released a tool to automate creation of looping videos.\nhttp://t.co/l7ibbbCrdJ + http://t.co/JBKDLZfviH": 0, "Microsofts New Xbox One Ad Criticized as Sexist (TIME): Share With Friends:  |  | Business News, RSS Feeds an... http://t.co/W9FAn6wJOV": 0, "RT @Windows: Announcing the Official @Facebook App for #Windows8.1! Get it here: http://t.co/UA5LxPWH5m http://t.co/N4HKG4v1Uu": 0, "@IgnatJames Follow the steps in this link: http://t.co/O8uv3UKsaQ \n\n-LA": 0, "@ejrinwitaj If you have a moment, could you please fill out this quick survey on our service today: http://t.co/aiCmFmDotv? Thanks. ^AEM": 0, "Microsoft Announces New Zero-Day Flaw Targeting Windows XP and Windows Server 2003 http://t.co/fBCbwr67ce via @WindowsITPro": 0, "I still get angry dudebros tweeting me about my snarky Sony tweet, Microsoft are you going to make me do one for you, too? OH MICROSOFT.": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying #microsoft #nsa http://t.co/G8JR4e6dI4": 0, "@bgarippo I'm busy owning Microsoft": 0, "#Microsoft, No apps? No thanks.": 0, "Microsoft Xbox One DAY ONE 1 Edition! 500 GB Black Console RECEIPT w/WARRANTY!!!: $689.99 End Date: Saturday... http://t.co/OJx6Xh89Qt": 0, "fashion lady: uxcious rings, which color du u prefer?\n\nThe order link http://t.co/xlW6YjsMzl via http://t.co/qiQqBbpNxe": 0, "Microsoft explains why 'Halo 4' didn't debut on Xbox One http://t.co/eVfitu4TN4 http://t.co/81lhxGMHN0": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/eaI8KjExZS": 0, "Xbox One: Microsoft launches controversial ad campaign - While it doesn&amp;#39;t explicitly state its focus is to con... http://t.co/OOpd3LhdgV": 0, "Microsoft Store Black Friday Deals Are Here Early!... http://t.co/iNcV9LxMQj": 0, "Microsoft store still has Xbox One's that available now.": 0, "Time won't make you forget, it'll make you grow and understand things,,, the Microsoft paperclip stopped mentoring me,": 0, "Microsoft made every entry on that dumb letter blank, by default. Unfortunately my demands were to fill every blank with \"Zoo Tycoon.\"": 0, "RT @Evowk: Dad works at Microsoft!\nRT &amp; ill randomly select \n500+ RT then ill giveaways \nYou'll receive a DM! http://t.co/HwDlUxMG6G": 0, "Skype for China now talks directly to Microsoft, may reduce government snooping (updated) http://t.co/NvJo87LJBy #gadgets #tech": 0, "Microsoft investigating MS Windows local privilege escalation zero-day: Microsoft issued a security alert and ... http://t.co/zuT4kzRlh6": 0, "227's YouTube Chili'  Microsoft Points Code Generator  2013  Free MSP codes : \n\n Micr... http://t.co/8dKmX4QdVP Jamaal Al-Din - NBA": 0, "RT @WindowsITPro: Not Satisfied with Google and Apple, New Microsoft Ad Targets Samsung http://t.co/Im0EpPsxYf": 0, "Oh for gods sake, Microsoft. Sort your shit out. I'm having a real hard time staying a fanboy over here.": 0, "Tech News: Fed Up With Cheating OEMs, Microsoft Trolls Chromebooks in New Ad  http://t.co/Z3ykXGciY3": 0, "@christinac604 Sorry about that. You can change the settings by executing steps by RimmerA or Andre Da at http://t.co/BEPGd7T3Ga. Helps? ^MG": 0, "Those who mind dont matte...: new image http://t.co/XWIDqm7UCf #quotes via http://t.co/gxktWhKfbI": 0, "Tattoo TV Trailer | Assassin's Creed IV Black Flag [North America] http://t.co/LuIkmiiuzA via http://t.co/EvmIlaxnxL": 0, "I wish Sony &amp; Microsoft did give me free consoles. I spent  waaaaay to much money this month lol": 0, "@dblake08 @xboxjobs We most certainly will! You can also keep an eye on our job listings here: http://t.co/6CFL7CivmI.": 0, "DLSU-D joins Microsoft Partners in Learning | De La Salle University - Dasmarias: http://t.co/Pd2cUDbMiB": 0, "The mcsa is the fastest-overdeveloped microsoft endorsement: faAagnpP": 0, "Bill Gates, IBM and OS/2: Best of the Web: The tale of how Microsoft founder Bill Gates got computer giant IBM... http://t.co/GPaTGTRReM": 0, "Analyzing Revenue and Sales Cycle Velocity in Microsoft Dynamics CRM 2013 - http://t.co/cCSVGLQ09V #crm2013 #crm #msdyncrm @adamspurr": 0, "\"@HuffingtonPost: Gloves off: Microsoft reportedly wants to step up its fight against the NSA http://t.co/rqQZzdMAXR\" // really?": 0, "Did I really just read this headline? \"Microsoft very sore after backdoor probe.\" http://t.co/gGe6Cvex1P": 0, "Microsoft Explains Why There Was No Halo Title for Xbox One's Launch. - n3rdabl3 http://t.co/H1pfaR1zYV": 0, "Gamespot - Iphone GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have ... http://t.co/Bx4nijpmfB": 0, "Gaming's Next Revolution Will Be Livestreamed, And The PS4 Has A Nice Lead http://t.co/e1F7fwla4k #Gadgets #Gaming #microsoft #cloud": 0, "I liked a @YouTube video http://t.co/rsZS5dQX5f Xbox One Initial Thoughts &amp; Problem @Microsoft - Ghosts KEM Gameplay on Xbox One": 0, "I liked a @YouTube video from @detroitborg http://t.co/FgbEgqTuSM Microsoft Xbox One: Unboxing": 0, "#cloud market expands to $2.5B this quarter. @csstars is one of the original private cloud pioneers of SaaS http://t.co/rj5MuIijKU": 0, "Stephen Elop's rise to Microsoft CEO seen as less likely http://t.co/z7loFPR7lm": 0, "UCLA game design students better game design by using this link: http://t.co/JOD9YChEUu #Win8 #FunApps": 0, "@NotPhilSchiller wait for the Microsoft employees to pull out their iPhones and iPads then go home to their iMacs and  TVs.": 0, "Microsoft Xbox 360 Slim 250 GB Black Console (NTSC) w/ Kinect and some games:   Price 112.5  USD  (39 Bids)End... http://t.co/S3LvyHTcWO": 0, "RT @findingdealz: ACT FAST! There R some Xbox One still available! http://t.co/f8EAdGVSR2 #gaming #console #xboxone #xbox1 #microsoft #syst": 0, "Oh my.. Microsoft you're tryng so hard to make fun of Google.": 0, "@Microsoft i can't access my microsoft account!! need help.": 0, "RT @FailboatSkipper: Mike Eaton channeled his inner Mike Eaton tonight RE: the Microsoft PR blunder http://t.co/eeKciBsnvt": 0, "RT @CNET: What console war? Microsoft sells 1 million Xbox Ones in first 24 hours http://t.co/DLiygaplyZ": 0, ".  @Microsoft to step up encryption to thwart NSA http://t.co/4sZD7yYZyb": 0, "@HuffingtonPost Don't Worry, Microsoft And Sony Are Taking Care Of The New Game Console Glitches http://t.co/45fY3JVcPz": 0, "#Microsoft moves to unify #Windows, Windows Phone, Windows RT #Tech #Gadget http://t.co/skkSavyh2w": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/mw02Ooesjh": 0, "Earlier: Microsoft launches web version of Xbox Video, is similar to the Windows 8.1 app http://t.co/ukFioQFMyr": 0, "Me walking past the Microsoft store and seeing a pile of Xbox Ones http://t.co/yi6uSIMzwR": 0, "Microsoft May Finally Put Windows RT Out To Pasture (Soulskill/Slashdot) http://t.co/gDPsg18cTD": 0, "Microsoft's 'Sexist' Xbox One Ad Stirs Controversy http://t.co/DlgNeqQQxa": 0, "RT @RealAlexJones: Microsoft punishing bad language after listening to private Skype conversations? https://t.co/z5U9umDEbD http://t.co/ZEo": 0, "The Cutest Quotes: new image http://t.co/aR5DJ51Tyj via http://t.co/gxktWhKfbI #quotes http://t.co/zo2y8tmFEp": 0, "Ford boss edging out Nokia's Elop in race to replace Ballmer at Microsoft, report says http://t.co/kU009rVeON": 0, "@seanm_nb The Xbox One supports the Play To feature where you can share your videos to your console. http://t.co/CSV57ElRTu ^EZ": 0, "@SamMaggs @SizzlerKistler Microsoft: Our marketing dept thinks it's still the 1950s.": 0, "Microsoft moves to counter NSA http://t.co/KvsMPOcLkN": 0, "Microsoft May Finally Put Windows RT Out To Pasture http://t.co/8Xy3D9fJau": 0, "Drinking While You Work from \"The Glitch That Stole Christmas\" | DADS | FOX... http://t.co/v8TDkJz9js via http://t.co/tXjObGiDiU": 0, "Delta to equip 11,000 pilots with Microsoft Surface 2 devices for their electronic flight bag: http://t.co/eFYBNA12AA va @youtube": 0, "Microsoft Announces New Zero-Day Flaw Targeting Windows XP and Windows Server 2003 http://t.co/Uoe6w72V3o": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $650.00 (0 Bids) End Date: Wednesday Nov-27-2013... http://t.co/aD47FaLVPd": 0, "Maybe not fair, but Mulally's brilliant. \"Mulally's Extended Dance With Microsoft Isn't Fair To Ford\" http://t.co/D1JV6kU51k": 0, "@Lovatics4Demi It's OK it happens Just so you know if it's on Microsoft Word there's usually a backup You should check &amp; make sure ....cont": 0, "Report: Microsoft Mulls Stronger Encryption Amidst NSA Spying... (http://t.co/APRNgrigJG)": 0, "Assist UCLA game design students better game design by using this link: http://t.co/b61vgkzvIo #Win8 #FunApps": 0, "RT @safetecinfo: Will Google Docs kill off Microsoft Office? http://t.co/rLyZpmuxG9": 0, "@delphijunkie Microsoft's QA has really slipped in recent years. :P": 0, "It's tough to masturbate with a Xbox One Kinect staring at me... Is this what you wanted Microsoft?!?!?": 0, "Hot video game on Amazon is Dead Rising 3 by Microsoft up % in last 24 hours http://t.co/PxGb5r0S7B": 0, "@Jacob_Turner_93 Greetings, I found some additional information for you to take a look at http://t.co/5cf2Muf73r": 0, "MT @csoghoian Until Yahoo &amp; Microsoft go green on this chart, their encryption promises are empty\nhttp://t.co/AAw4POV9iL": 0, "April 8 looms! RT @EverythingMS Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit http://t.co/Pck5cP8BCl": 0, "Microsoft alienates female gamers with a sexist letter to dudes: \nThe company released a form letter online f... http://t.co/vqgQneLeCw": 0, "Microsoft Boosts Encryption to Guard Traffic Against NSA Snooping: Following revelations that the spy agency t... http://t.co/asI5WdcVe0": 0, "$MSFT - Capita IT Services extends Microsoft relationship -&gt; http://t.co/pb3MmfA4ic #stock #stocks #MSFT": 0, "in the Microsoft store. #livetweet": 0, "RT @TheDevanLeos: Just got off the phone with Microsoft and they said my Xbox won't be here until Monday and as an apology the gave me a Mo": 0, "Microsoft to give $1,000 to winner of Xbox One controller art design contest http://t.co/OmuGMxeYKl": 0, "Formula 1 HIGH RES photos: 1978 - Canada Start http://t.co/HjtZdhaOt4 via http://t.co/u6brH2PXVg #F1 http://t.co/I4g7V4rVBR": 0, "Microsoft's tripos 8 aims all for green light screens: bQVZwn": 0, "RT @GAMING_LOUNGE: Microsoft apologizes for 'sexist' Xbox One promo: \"We meant no offense,\" says rep as firm implements changes. ... http:/": 0, "32 to buy the rarest care in Forza. 32 CUNTING POUNDS. 'But Microsoft and XBox are the best console devs'. Yeah, you keep kidding yourself": 0, "Freshly Inked Magazine: new image http://t.co/bArR62fanw via http://t.co/a3cv3RrZ94 #tattoos http://t.co/HUBRRFdE0Y": 0, "Does anyone have Microsoft office for Mac that I can download to my computer?? I don't wanna pay $140 .  Pleeeeease": 0, "Microsoft apologizes for 'sexist' Xbox One promo http://t.co/44i5F35luk": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/84sGpqEZu5": 0, "@Microsoft good job..just amazing. Like it.": 0, "Microsoft BI specialist - oDesk: Australian company looking for BI specialist to work long term par... http://t.co/8t9VJ2hEEC #dev #jobs": 0, "Microsoft Store Black Friday Deals Are Here Early!... http://t.co/liXm4ne6WY": 0, "Microsoft releases two new anti-iPad Surface ads. Interesting enough, but annoying music ... http://t.co/3e2TNO5zcq": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/OcJUfNZjQP": 0, "@DeeptiSharma1 @AWIB @Microsoft Anytime babe! Please find my contact info on my website or the Workshop handout.": 0, "Xbox Ad Criticized as Sexist http://t.co/L5ZfLMKENI": 0, "I'd love to get a @BBYCanada #MERRYSTRESSLESS I'm wishing for a @microsoftcanada @surface Pro 2 http://t.co/sP60W3jttj": 0, "@Microsoft again proving they're idiots.  http://t.co/zTOG90agAb": 0, "So pissed because I didn't get to attend the mini-LAN being hosted at my local Microsoft Store. #FML": 0, "RT @TechnoBarnes: @GoldSilverPawn Hope Microsoft paid you guys a lot. Because you obviously know nothing about technology. You lost one vie": 0, "RT @SocalSam: UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/UBBJDy4FCK #Win8 ": 0, "Microsoft issued a security alert and is investigating a report issued by FireEye Labs warning of an MS Wi... http://t.co/8oj5Ov7lr7 #FF": 0, "Says he failed to invest in walmart after having dinner with Sam Walton and sold Microsoft in 1987 bc it was \"overvalued\". Mistakes happen": 0, "I Love Funny Pics: new image http://t.co/V97PBsnI9V #funny via http://t.co/fnTDKnNbKt http://t.co/lX3nxc2x8b": 0, "RT @_dte: Maybe not disgustingly sexist, but definitely pushing it, Microsoft. http://t.co/QNrHEVA0dC": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/la00hmux1w": 0, "Microsoft Releases Security Advisory 2914486: Today we released Security Advisory 2914486 regarding a local el... http://t.co/5FblBPqiXG": 0, "RT @DNS_Doug: Even the major players like Microsoft are not immune to #DNS failures. http://t.co/wjo6fLYFQ2 Outages and slowdowns impact ev": 0, "Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time http://t.co/V1e1YW7kvK": 0, "Video: Microsoft Releases Epic New Sizzle Reel Of Upcoming Xbox One Games! http://t.co/fuw767KLxs": 0, "Microsoft Corporation (MSFT) Xbox Is Costly Than Sony's PS4, Google Inc ... $MSFT http://t.co/BSubbXyW8N": 0, "Not Satisfied with Google and Apple, New Microsoft Ad Targets Samsung http://t.co/Im0EpPsxYf": 0, "I liked a @YouTube video http://t.co/Z3fOWpqY0U Apple acquires the company behind Microsoft's Kinect": 0, "Microsoft vs apple who is authoritative the armed conflict favorable regard charlotte,nc?: XSOXBWGC": 0, "UCLA game design students better game design by using this link: http://t.co/cBYhami05q #Win8 #FunApps": 0, "Some critical tips for executing @Microsoft forest migrations from our professional services team http://t.co/pCdX7UmdhL #blog": 0, "Microsoft SQL Server Integration Services (SSIS) Engineer: Not Specified, 2 yr of exp, posted on 28 Nov 2013 12:57:00 http://t.co/4DOKLOnks2": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks - http://t.co/5ePrrqBYhY via http://t.co/PhZ3nzkKfA #News": 0, "Microsoft fights back against the National Security Agency - fortifies their security (via @WPCentral) http://t.co/TYxKU6umX7": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying #microsoft #nsa http://t.co/acpWDhv69y - via @NeowinFeed": 0, "Microsoft Xbox 360 Slim 320 GB Black Console: $45.00 End Date: Wednesday Dec-4-2013 16:22:51 PST Buy It Now for... http://t.co/IQ4NgSNM1R": 0, "RT @justsharepoint: #SharePoint #Link Security hardening for SharePoint 2010 farms (PowerShell) http://t.co/v2P29u32hz #PowerShell": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/3s7KC4oaML by @alex": 0, "Microsoft Is Getting Pathetic with the Anti-Google Campaign, Users Believe: Microsoft today unveiled a brand n... http://t.co/vi8zyGl1U2": 0, "@XboxSupport3 Only a few. In French, \"Aller en haut\" (Move to front, under My Pins) is inaccurate and confusing. http://t.co/e6ZK1uCZ2x": 0, "Microsoft assumes women are in the kitchen making them a sammich. http://t.co/0zuAK0z455 http://t.co/KfuNsNSLam": 0, "Microsoft Corporation (MSFT) Xbox Is Costly Than Sony's PS4, Google Inc ... http://t.co/zO3Iqc0MyM Invierta en GOOG...http://t.co/GaMZeX0sD5": 0, "\"Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional\" http://t.co/9ao9kqIEi7": 0, "Microsoft 'working to fix' Xbox Live connectivity issues [Update] http://t.co/EZ9sLh2s3X #videogames": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/GDKgKQQhW1": 0, "Microsoft Xbox 8 GB Black Console and xbox bag and 200 games (NTSC): $59.99 (0 Bids) End Date: Monday Dec-2-2013... http://t.co/5drePIZsz5": 0, "Microsoft challenges the public to compare Google v Bing  http://t.co/zi4DU7dPC3": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/c3c0G0KQAC": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/xsgusvkPNv": 0, "RT @m4dski11z: Preview: Microsoft's Xbox One off to strong start http://t.co/1T7QvOSdY7": 0, "WTF1 - The Alternative F1...: Easily confused http://t.co/MQLNd2NZk3 #F1 via http://t.co/u6brH2PXVg http://t.co/Km8cCEtjf3": 0, "News Bulletin - 20:30 GMT update http://t.co/abRcFH7Sh2 via http://t.co/3cVMRz99nh #worldnews": 0, "Microsoft Acknowledges Xbox One Disc Drive Issue http://t.co/QzMtZoSgOx via @pcmag #tech #gaming": 0, "RT @MinutePostTech: #TechNews Microsoft Starts Black Friday Early With Surface, Touch PC Deals via PC Magazine http://t.co/HmHeFJ2zZm": 0, "Is Windows RT dead? Microsoft hints at fewer versions of Windows | Fox News http://t.co/QYVI6PHZ6g via @foxnews": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals - PC Magazine http://t.co/F3xB8VISKL": 0, "Dream Cars: Rate this BMW out of 10??\n\nPhoto Credits: Andre Xander Photo... http://t.co/LS3d1yyaDY via http://t.co/I2O0v7cj9L": 0, "Oh #Microsoft and their sexist attitudes:\n'Sexist' Xbox One Ad Stirs Controversy http://t.co/MhnjQWzY2f\n#XboxOneAd": 0, "Following Yahoo's lead, of couse. Oh, wait... Microsoft and Yahoo... well... http://t.co/nu96V2cG56": 0, "I'm a   all fr rpping on chromebooks bt that microsoft scroogled commercial is the worst real fake real commercial I've ever seen:m": 0, "RT @news_watcher1: @QLDOnline Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time http://t.co/e": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks http://t.co/DjSDzP9NI7 #infosec": 0, "Apple acquires the company behind Microsoft's Kinect http://t.co/dnc2ybaHNs #tech": 0, "RT @tomwarren: Xbox, pause: Microsoft waits to discuss Xbox One apps http://t.co/6oIiekLvK0": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have ex... http://t.co/o0hkamkjka #android #games": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/y94fqB46CF": 0, "Microsoft bans users for 'excessive profanity' in Xbox One video uploads - The Guardian http://t.co/QaYwmaOmQJ #microsoft": 0, "I liked a @YouTube video http://t.co/D7C4Hbe7KQ Cuanto le cuesta a microsoft la xbox one? y Parche BF4": 0, "@AZba11in Also, care to let us know how we're doing here on Twitter with a quick survey: http://t.co/JGboajNIp6? Thanks! ^DJ": 0, "RT @chrisjscott: Hey, @Microsoft - when are you going to release @Skype for my @Xbox 360?! Dying to use my @Kinect w/ it! @XboxSupport": 0, "There's no shortage of Microsoft stuff that makes me scream, but Outlook 2013 is the cat's meow of email clients.": 0, "Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time http://t.co/wT6RbSUP2i": 0, "I am only now realizing tht ii dnt have microsoft office on mah laptop... &gt;_&lt;!!!": 0, "@OccupyAllMedia_ would love to win these! it's hard playing competitively with a basic microsoft headset! haha": 0, "@RaisedDongers We would love your feedback on our service. Go to http://t.co/NxIFno1XrW for a quick survey. Thanks in advance. ^KLM": 0, "Microsoft and Parallels Tap Ipeer to Test New Windows Azure Pack Services - http://t.co/aOFxY5kKjm http://t.co/OFjpCjtCs6": 0, "RT @dailydot: Microsoft wrote a form letter for men to convince their girlfriends to let them buy an Xbox. It backfired: http://t.co/urk5qt": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/SqKMFR8njb": 0, "Dear Microsoft:  seriously?   ... fucking... seriously?": 0, "Microsoft's 'Sexist' Xbox One Ad Stirs Controversy http://t.co/DJN1LjOjIb via @mashable": 0, "RT @TNWmobile: Nokia now controls 90% of the Windows Phone 8 market, with the low-end Lumia 520 accounting for 35% share http://t.co/ULIS6v": 0, "I'm giving away: Xbox Live 14 day trial ** Microsoft Xbox 360 - Xbox One **. Check it out - http://t.co/d3z741NpKw": 0, "@ben_seven @microsoft yeah, they changed it some.": 0, "Microsoft's 'Sexist' Xbox One Ad Stirs Controversy http://t.co/5jJ9J0M6wv": 0, "Microsoft should probably go on the offensive now. So diplomatic so far. Although maybe to stem communication issues early on.": 0, "Microsoft Xbox 8 GB Black Console and xbox bag and 200 games (NTSC) http://t.co/USrLSJ7hZZ": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals - PC Magazine http://t.co/5s4uCsR3QG": 0, "@BennieVaIentine @PhinaVera sure bennie  please just go with the flow microsoft joined the family man like microsoft": 0, "Kanye West, along with microsoft, proved that trying to be different doesnt go well with fans and consumers": 0, "RT @rahulsood: 10 Reasons to Give Your Startup the Microsoft Ventures Accelerator Advantage http://t.co/X1iAxFUKkb @ravignarayan": 0, "@JPFinch1 Hard to say, honestly, but I'm leaning on Microsoft. Remember the fact that KH3 was announced /after/ the XBone, which gives ample": 0, "10 Reasons to Give Your Startup the Microsoft Ventures Accelerator Advantage http://t.co/KswvvFKdm7 @ravignarayan": 0, "Microsoft 70-669 questions other answers dorts: uAMy": 0, "Microsoft hits iPad Air in new holiday-themed ads geared towards family usage - 9 to 5 Mac http://t.co/kGjVYJc8hq": 0, "RT @CIOonline: HP Private Cloud Service Leads the Pack, Followed by Cisco and Microsoft http://t.co/VIvkzJwNRv @CIOonline": 0, "Microsoft's velocity software brings ginger phylum crm in yours gag: ZIzwUc": 0, "Are we still outraged over that Microsoft ad from earlier today? Well, here are my thoughts anyway: http://t.co/hx8oOU2gsd": 0, "Julian Wilson: Cali vibes. Watch it here: http://t.co/LhzH5Q67qY #surfing via http://t.co/mn3EFmuNyP": 0, "#Microsoft Now Directly Deals With #Skype in #China With Possibly Reduced Censorship Restrictions http://t.co/R6cqIHGA0N": 0, "Download Microsoft Access PDF eBook and Notes - @icttrends. Click the link to visit --&gt; http://t.co/3QTRaayi0w\n #DownloadeBook": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft hav... http://t.co/TLld84gUzH #GameSpotScreenshot": 0, "Hayden Panettiere's Animal Noises http://t.co/vibDmhK8lQ via http://t.co/tXjObGiDiU #tvshows": 0, "Microsoft excel is honestly just a slut": 0, "RT @SecMash: Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/gtdAnZ6GY4 #InfoSec": 0, "@VisioMVP @Microsoft True, but this is really my first iProduct... first app I installed was Lync!": 0, "@dianareid22 Are you just starting to use Office 365 at your school? Already know about our @Microsoft_EDU resources? http://t.co/UwCAJHbYy8": 0, "Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic -  http://t.co/KXntfRraoh": 0, "RT @GameBurst: In part one of the #GBReplay special, we look at the racing and downloadable games from Microsoft and Sonys http://t.co/G4G": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying http://t.co/DqjgvrYLyn John Callaham": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/dNmE5SDxMl": 0, "Insanely Funny Shit: new image http://t.co/TVjuXIBJc6 via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft 'working to fix' Xbox Live connectivity issues [Update] http://t.co/wUDhBeM8L4": 0, "Which makes this hearing precisely wholesale harder than the of another sort microsoft exams: RCfJMpx": 0, "I'm lll   for ripping on chrombooks but that microsoft scroogled commercial is the worst real fake real commercial I've ever seen:": 0, "Microsoft Xbox 360 Slim 320 GB Black Console: Price 91.0 USD (8 Bids) End Time: 2013-12-01 00:08:45 PDT http://t.co/LdVkVi8CgJ": 0, "Pellegrini slams \"very bad\" defence http://t.co/wRiFhf246E via http://t.co/3cVMRz99nh #worldnews": 0, "#PS4 or #XboxOne? I like the PS4s new look and controller. With a touch screen, it brings in a whole new world. Good job Microsoft/Sony.": 0, "Join us for Lync Conference Canada in Calgary! http://t.co/ucn6rOo0Fk": 0, "RT @TheNextWeb: Nokia now controls 90% of the Windows Phone 8 market, with the low-end Lumia 520 accounting for 35% share http://t.co/OHA6o": 0, "Gears of War - Microsoft discute el futuro de Gears of War\nhttp://t.co/9UblGzvfft #Geek #GearsofWar #Gamer": 0, "@TheGreyHunter: Nokia : Microsoft and its users must think Instagram really just hit the stores. ": 0, "http://t.co/Bkzx1kURcJ\n\nEarlier this month, Microsoft sent out a notice to Xbox Video users notifying them that... http://t.co/PCoMUSoW1a": 0, "@Louzerllll you can rent an X1 lol, and Microsoft helped make the game so why would they give rights to Sony?": 0, "@NorthPolePost Please check out Santa's Advent Calendar! #CountdownToChristmas #santasadventcalendar   http://t.co/wUveyUyZ5x xxx": 0, "Just honestly but Microsoft, go away and fuck yourself. Go on.": 0, "#News: GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed i... http://t.co/UWlSztbZvx": 0, "Top TV Series: RIP BRIAN... forever? I think not... -&gt; http://t.co/azD3dqM7S7 via http://t.co/tXjObGiDiU #tvshows http://t.co/BvcImvN5vM": 0, "Must check! \"@Claire0h: 10 Reasons to Give Your Startup the Microsoft Ventures Accelerator Advantage http://t.co/gywCUGis8v": 0, "just finished watching thy kingdom come good movie.By the way I spent almost the rest of my Microsoft money on the movie. but worth it": 0, "How to fix Windows 8 apps that won't install or update from the Store  Pureinfotech http://t.co/8ULhkMCsEY #windows81 #microsoft": 0, "In this day and age... \"Microsoft Wrote A Sexist Letter To Your Girlfriend So You Can Buy An Xbox One\" -&gt; http://t.co/fxEuLGPAIr": 0, "Would that Microsoft Xbox One letter have been received better if it had dropdown boxes with the same options instead of finished mad libs?": 0, "UCLA game design students understand usability in games by reviewing their game, use this link: http://t.co/LdUNajTVB8 #Win8 #FunApps": 0, "http://t.co/r552K9doMc Microsoft Flight Simulator X: F-16 Fighting Falcon": 0, "Microsoft 70-669 questions else answers dumps: ETke": 0, "Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic http://t.co/x5t8j3aLaJ": 0, "\"Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One\"  http://t.co/Ag7KkWxKZW": 0, "Amazing shoes and bags: new image http://t.co/Un66sKzi6u via http://t.co/qiQqBbpNxe #fashion http://t.co/qO7AxFc7Gk": 0, "The Fallen Empire: When Apple Attacks Microsoft Using A Century Old Military Strategy by @pointiflex https://t.co/bPNS2faQSc": 0, "RT @rcooley123: Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic - The Washington Post http://t.co/jVsM": 0, "#Marketing Microsofts New Xbox One Ad Criticized as Sexist": 0, "@richardosman Possible basis for a question on Pointless: Standard fonts or typefaces on Microsoft Word as of November 2013... discuss.": 0, "Microsoft Xbox One Day one Edition 500 GB Black Console: $650.00 (0 Bids) End Date: Thursday Nov-28-2013 16:33:30... http://t.co/9AECFxeFyA": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have ex... http://t.co/UbHRhOSpaA #android #games": 0, "RT @mashable: Microsoft's 'Sexist' Xbox One Ad Stirs Controversy http://t.co/A0ovi4H7G4": 0, "@EShy @stuartmanning we are having a live tv show from SV. Come December 9 email dcrets@Microsoft": 0, "RT @PatrickCMiller: Microsoft very sore after backdoor access by NSA, will now encrypt networks  http://t.co/wObdWv20NO": 0, "While only a marginal difference, it is such a change of pace to see a Sony console have higher online players than a Microsoft one. #BF4": 0, "Microsoft msays  that thy want to clean up their online by banning people who use foul language, yet send that email around as marketing?": 0, "Microsoft Surface Pro 10.1\" 128GB Tablet - $899.99 - http://t.co/yZWsEOCFIC": 0, "I'm    all for rppng on chromebooks bt that microsoft scroogled commercial is the worst real fake real commercial I've ever seen:po": 0, "Should I get a @Microsoft @surface RT? #BlackFriday @MicrosoftStore": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals - PC Magazine: BBC NewsMicrosoft Starts Black... http://t.co/GI1HcNZXSm": 0, "RT @BANDofBROz: Ok,now Microsoft &amp; the Forza Dev say that \"Motor DLC will be discounted by 50% &amp; users receive 2 free cars\" See what happen": 0, "@almightygod=mc2777LORDe10 Make Me Filthy Wealthy @ http://t.co/sN5lUJhOHU http://t.co/NxibvCvjrw": 0, "Trust me I am #Microsoft \n#myass http://t.co/JNdJKnuoka": 0, "As far as I know, some parts of Photo Stream are hosted on S3 and Apple uses AWS and Microsofts cloud infrastructure.": 0, "That dude ain't making a windows phone app lmao RT @SteveJerkal: Invest in the tweetlogix twitter app @microsoft": 0, "You know Microsoft has a problem when even The Tech Guy can't explain Windows tablets. http://t.co/p8w4DuqhZP": 0, "RT @TechnoBuffalo: Microsoft Targets Apple Again with New Surface 2 Commercials http://t.co/IXVhyJo5sb": 0, "Inked Magazine: HOLIDAY SALE! Get 20% OFF everything in the #inkedshop! ... http://t.co/UPweubgmsH via http://t.co/a3cv3RrZ94": 0, "RT @ThunderS7ruck: Guys if i can ever get my LEGENDofTHUNDER account back from Microsoft security i'll upload some more Borderlands 2 Vids!": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/UFQWbEmiLQ": 0, "Behind the scenes of the Louvre http://t.co/fFbPnGdq9k via http://t.co/3cVMRz99nh #worldnews": 0, "@ChadThiele @3steveco33 if you have any problems email dcrets@Microsoft.com.": 0, "Microsoft Xbox One Day One - NORTH NJ LOCAL PICKUP ONLY - READ FULL DESCRIPTION: $675.00 End http://t.co/av62Im7Xr7": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/C8uOuUlNqI": 0, "fashion lady: leisure suit for daily life, want http://t.co/57rT9b7Lqb via http://t.co/qiQqBbpNxe #fashion": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/yq6VmO8nIA": 0, "Microsoft Boosts Encryption to Guard Traffic Against NSA Snooping via @TechNewsTube http://t.co/FJVwSndty6": 0, "Leah Remini and 'DWTS' Partner Tony Dovolani Go Wild After Finale http://t.co/Y6rDtQSMT6 #celebs via http://t.co/lZ21fxpl5d": 0, "RT @Rob_Crossley_: Microsoft apologises for 'sexist' Xbox One promo http://t.co/aHqZ9I5Tav": 0, "Sony's PS4 battles with Microsoft's XBox One #Legal #News http://t.co/hKYjzpjJkP": 0, "@v21 Microsoft did try to warn you.": 0, "BOSTON (Reuters) - Jonathon Jacobson's Highfields Capital raised its stake in Microsoft sixfold during the third quarter to 31 million share": 0, "Microsoft admits three operating systems is a crowd: UNITED STATES, Nov 28  The company accepts that having two... http://t.co/V2basFXTqL": 0, "RT @TygrScott: Microsoft won't comment on plans for Xbox 360 Skype app http://t.co/c08VBT2V3S\n Connect http://t.co/9FuDDwo3MZ": 0, "@FadeShotEdits What device are you using? Did you update to 8.1? http://t.co/FgmIOsYxIx ^SL": 0, "@the_chronicle_ Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time http://t.co/VsGNJlSEAT": 0, "RT @UpSearchBI: *  Introducing Microsoft Power Query  | @SQLServerMag Business Intelligence http://t.co/kVUAEOKPvS": 0, "#dailydot Microsoft alienates female gamers with a sexist letter to dudes: \nThe company released a form lette... http://t.co/kIVHwpyi06": 0, "Microsoft v Chromebook is more like Yawn Stars http://t.co/pL16XCsajq (UnderCurrent)": 0, "Cory Booker: Checking out the stores of supplies at the FoodBank of Monm... http://t.co/xFLPJuRE90 via http://t.co/hdZI6v6ii9": 0, "#Xbox One Release Follows Familiar Pattern: Best Buy employees unload #Microsoft #Xbox One #consoles from an a... http://t.co/EAq0o9piod": 0, "@Christmas_UK Please check out our app - Santa's Advent Calendar! #ChristmasCountdown #Windows8 http://t.co/wUveyUyZ5x xxx": 0, "Microsoft CityNext: Green light for a mobile Manchester http://t.co/Rpdp2mtbGs": 0, "Plz enable \"Play Through Headset &amp; Speaker\" function!! Youtubers cannot record others voices @xbox @xboxsupport @Microsoft #StoneMountain64": 0, "Microsoft's #Xbox 360 #Black #Friday 2013 deals | The Verge http://t.co/X2FRpFaXDT #gaming": 0, "@BBCNewsGraphics @BBCNews I thought Microsoft were releasing another update for Windows 8 Metro.": 0, "@gennybaybiie @PhinaVera  I'm confused are we talking bout Microsoft or ?": 0, "Pakistani politician outs CIA officials http://t.co/WmqPrrFyDm via http://t.co/3cVMRz99nh #worldnews": 0, "This microsoft surface is spot on. Love it! :)": 0, "Slashdot: Microsoft May Finally Put Windows RT Out To Pasture http://t.co/ZNbLBqlmfl": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit.. #tech http://t.co/PdrFsKrGMW": 0, "Microsoft Taps 'Pawn Stars' to Scroogle Over Google Chromebooks http://t.co/1PMdWGYqFX via @DashBurst": 0, "UCLA computer science students understand usability in games by reviewing their game, use this link: http://t.co/RaeoQkxceB #Win8 #FunApps": 0, "Microsoft Xbox 360 S Halo: Reach Limited Edition 250 GB Silver Console (PAL): Price 73.0 USD (8 Bids) End Time:... http://t.co/HtAIoNpgvS": 0, "\"Sexist\" Xbox One Letter Needs Some Changes: When the Xbox One launched, Microsoft tried to get clever and pro... http://t.co/5lv3MCtk27": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional http://t.co/e035q6lOZ7 #djlnr http://t.co/5zzU6kxxXf": 0, "Microsoft Brings Xbox Video To The Web Ahead Of Windows Phone, Forgets HD Playback - TechCrunch.. http://t.co/XMKdeaKzxV": 0, "I failed in some exams but my friend passed in all. But now I'm the owner of microsoft and my friend become my engineer. - Bill gates": 0, "No, a gaming PC might be all that I need to give Microsoft and Sony the bird.": 0, "@AntDeRosa 0_0  Can't help with Microsoft issues, but I thought it was Twitter related!  Sorry to ask!  :)": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit - Neowin... (See+ on What: http://t.co/v5u0m4bqxu)": 0, "Microsofts New Xbox One Ad Criticized as Sexist http://t.co/WNhHuLjKD2": 0, "Microsoft is working on a Remote Desktop app for Windows Phone http://t.co/PZ2Nd4IFgn": 0, "#Microsoft very sore after backdoor probe by #NSA, will now encrypt #networks @TheRegister http://t.co/djgdENp7kH": 0, "RT @totalgaming: Microsoft 'working to fix' Xbox Live connection issues http://t.co/HEoxcdDFcD": 0, "People complain about anything nowadays... http://t.co/yNBsleuqHm": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/jurzGnhCrd": 0, "Microsoft Corporation (MSFT) Xbox Is Costly Than Sony's PS4, Google Inc ... $GOOG http://t.co/BSubbXyW8N": 0, "Not Satisfied with Google and Apple, New Microsoft Ad Targets Samsung http://t.co/TPXBKVnTtT via @WindowsITPro": 0, "Y'all clowning Sharkeisha name but if y'all type y'all name in Microsoft word bet y'all got a red line under it...": 0, "Why you shouldn't be surprised Middle Eastern countries sent all women teams to Microsoft's Imagine Cup http://t.co/EnzYwyIXEo": 0, "Microsoft takes a dig at Samsung in Surface vs. Galaxy Tab commercial (Will Conley/SlashGear) http://t.co/9zF7QpCdkm": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/jMXsPn16VL": 0, "RT @EricLigman: Download #Free Muscle Cars #Windows theme: http://t.co/FZC5FCfIBh #MSPartner": 0, "fashion lady: which color is your http://t.co/EH99a2ZQbJ via http://t.co/qiQqBbpNxe #fashion": 0, "MICROSOFT XBOX ONE- 500 GB GET IT BEFORE THANKSGIVING!! Free Tshirt!!: $630.00 End Date: Saturday Nov-30-2013... http://t.co/sD926iWphW": 0, "MMA Fight Club: new image http://t.co/Sqabi7hM2y via http://t.co/ABUaH7ML8Q #mma": 0, "Test Microsoft May Finally Put Windows RT Out To Pasture - onyxruby writes \"Microsoft may finally be ready to put...": 0, "Microsoft SQL Server Integration Services (SSIS) Engineer http://t.co/z5w3gIcRcD": 0, "Microsoft admits three operating systems is a crowd http://t.co/MB9yK5vLED": 0, "Pick up the Lumia 520 for $49 off-contract on Black Friday for AT&amp;T - Neowin - Neowin http://t.co/ABUj3DwXFq via @neowinfeed": 0, "Xbox Ad Criticized as Sexist http://t.co/L2jntPmCMK": 0, "@MinecraftMainax The update from Windows 8 to 8.1 is free in the Windows Store. For more info on the update see: http://t.co/o3fPyk16f6. ^KM": 0, "Our fantastic offices in Redmond are looking for a Media Software Dev Engineer http://t.co/2L8AbhM3qc #Developer #Skypejobs": 0, "Microsoft appears set to abandon Windows RT http://t.co/04D0h0pBNT": 0, "I was glad to discover today http://t.co/KwpAtqgn7v, very nice @Microsoft, specially providing free virtual machines for testing": 0, "Will Antel Defeat Wintel?: For years, Microsoft and Intel dominated the world of computing. Soon, Google and I... http://t.co/ouXtHpdUJd": 0, "RT @thurrott: In the market for a Chromebook? Choose from these $249 Windows PCs instead. http://t.co/kTM35BlV5D": 0, "Apple acquires the company behind Microsoft's Kinect - We could see PrimeSense's tech in everything from an Apple ... http://t.co/VAfv2mwsoh": 0, "#Google and #Microsoft battle it out. http://t.co/TibnbLCL0o": 0, "RT @BarryEggers: Amazon not just leading, but crushing in  #cloud computing, according to a new report. http://t.co/Cq5Szjkj1T via @Julie": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals http://t.co/nL9MRKZKcr": 0, "Report says Amazon still crushing the competition in IaaS #AWS #IaaS #IBM #Microsoft #Google http://t.co/RIPALUCU2g": 0, "Microsoft XBOX ONE Console Limited DAY ONE Edition, 2013!: $0.99 (0 Bids) End Date: Thursday Nov-28-2013 15:17:03... http://t.co/jXwseBjoTh": 0, "Good guy Microsoft. Teaching old people how to computer. http://t.co/N3YO1J5X36": 0, "Wait what!? @Microsoft wants me to install #BingDesktop? #hahahahaha #GoHomeYoureDrunk #STOPITISaidNoBeforeItsStillNo": 0, "@jayblack55 @WakeUp__America yeah exactly and Microsoft is all assholes.": 0, "sitting here. on twitter. with a blank microsoft word open. my stomach is in a knot.": 0, "Report: Microsoft plans to secure its internal communications against NSA spying @geekwire http://t.co/tES0U2ZQor": 0, "Bing Rewards giving 5% discount at Microsoft Stores this weekend (US only) http://t.co/sGDXctJWEJ": 0, "Gears of War 3 http://t.co/BkZrX0pe1r #xbox": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One - TechCrunch.. http://t.co/3xheKfyNTV": 0, "#Tech #Crunch As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate... http://t.co/YvnZFrri6f #Technology #News": 0, "@YNOTtheTIGER Microsoft security essentials and an Adblock.": 0, "Check out http://t.co/YRpq1FeEby  email that gets you going. http://t.co/rc7P1X9jiJ va @outlook": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/KumdNrOk3S": 0, "RT @joe_elway: New blog post: Dell Management Packs Now Support Microsoft System Center 2012 R2  http://t.co/gA09Fs4pxJ via @FloKlaffenbach": 0, "Microsoft said to beef up its Internet encryption. http://t.co/XNoZDKK8P0": 0, "Microsoft Targets Apple Again with New Surface 2 Commercials http://t.co/xokQ6Pyw5d": 0, "The Tattoo Page: 20 more SCARY ZOMBIE TATTOOS AT http://t.co/72tcxOvHy3 via http://t.co/a3cv3RrZ94 #tattoos": 0, "RT @morisy: Now that it might hurt bottom line, $MSFT concerned about gov spying, encryption: http://t.co/L8kLxhA7ed": 0, "Report: Microsoft Mulls Stronger Encryption Amidst NSA Spying http://t.co/UMaM2bABot": 0, "#microsoft office 2010 download free http://t.co/LLxJN1aveO": 0, "If Microsoft Says Chromebooks Are a Con, Its a Compliment to Chromebooks http://t.co/9JoAvmjcSP via @techland": 0, "\"Calling Google '90's Microsoft' is like calling Obama a socialist\".\n\nPerfect. just perfect.\n\nhttps://t.co/lN7dif25Xu": 0, "As Microsoft Moves to Encrypted Search, Webmasters Could Lose More Keyword Data http://t.co/nEe5uwk9Vy": 0, "Preview: Microsoft's Xbox One off to strong start - Houston Chronicle (blog) http://t.co/52AfhuKlHt": 0, "Skype for China now talks directly to Microsoft, may reduce government snooping (updated) http://t.co/4IO1k0G8yh #startup #Dubai #GCC": 0, "\"@PhinaVera: Awwh Mickey Mouse \" say what Microsoft yeoow": 0, "No knitting option? Now that Xbox ad is knittist. Sound the klaxons! http://t.co/yYqXeMtSuN": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/6io8yH0ae5": 0, "Led Zeppelin: new image http://t.co/Jamc7Jsd3D #rockbands via http://t.co/ZY1cU2DvHH http://t.co/IREAt1gHVY": 0, "Book of Quote: new image http://t.co/kBt44LhXFF #quotes via http://t.co/gxktWhKfbI": 0, "MMA Fight Club: the countdown starts!\n\n#ufc168 http://t.co/UqVc7tvULH via http://t.co/ABUaH7ML8Q #mma": 0, "Microsoft Store Black Friday deals spotlight Grand Theft Auto 5, Call of Duty: Ghosts - http://t.co/xhDEyfytGe": 0, "RT @Claire0h: 10 Reasons to Give Your Startup the Microsoft Ventures Accelerator Advantage http://t.co/KswvvFKdm7 @ravignarayan": 0, "Don't worry, Microsoft and Sony are taking care of the new game console glitches http://t.co/d34hz3XHTa": 0, "If Microsoft are pushing microtransactions hard then they can go fuck themselves.": 0, "Hmm Microsoft randomly charging me 5.99 for something on xbox live when i didn't even own an xbox at the time... @Microsoft": 0, "RT @ReutersIndia: Microsoft blocks censorship of Skype in China - advocacy group http://t.co/7Lx2h6pokR": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/4Tv5tTKSgg": 0, "UCLA game design students in learning how to use feedback from players, use this link: http://t.co/l7pVcVN00U #Win8 #FunApps": 0, "@prinston_manutd   It's really sad. I have a lot of respect for Microsoft. But really, trying to compete like this is beyond comprehension.": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/cr8CkQm7x0": 0, "Sandra Bullock IS Entertainment Weekly's 2013 Entertainer of the Year- Holl... http://t.co/6B1wslSxoz via http://t.co/lZ21fxpl5d": 0, "Microsoft May Finally Put Windows RT Out To Pasture - onyxruby writes \"Microsoft may finally be ready to put Windo... http://t.co/imWcOrbsNb": 0, "UCLA game design students understand usability in games by reviewing their game, use this link: http://t.co/UifSliF6Pd #Win8 #FunApps": 0, "Microsoft investigating MS Windows local privilege escalation zero-day: Microsoft issued a security alert and ... http://t.co/HOIcoK2aWY": 0, "Microsoft Launches Xbox Video Service on the Web - PC Magazine  http://t.co/0hRFwaLcWy": 0, "Avril Lavigne: LOVE hearing everyones voices singing Keeping Holding On ... http://t.co/6sJed8qTSI via http://t.co/lZ21fxpl5d": 0, "RT @fark: Mother***ing a**holes over at Microsoft are trying to f***ing censor your game commentary http://t.co/m6YrdeRtRH": 0, "@ChiTownMUT changed on the one... Call Microsoft say you're 18": 0, "@protocollie \"XBox Turn On.\" \"XBox Play Dead RIsing 3.\" \"XBox Please Don't Send Pictures of My Dick to Microsoft\"": 0, "#videogames Microsoft apologizes for 'sexist' Xbox One promo http://t.co/K1AQiakygy": 0, "@matthias_art @BradyQuarles you got to see this.\nhttp://t.co/vLWkb9Avio": 0, "*  Introducing Microsoft Power Query  | @SQLServerMag Business Intelligence http://t.co/kVUAEOKPvS": 0, "RT @ZDNet: Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/9BFnnbBPEH": 0, "Xbox One costs Microsoft $471 to build on a $499 MSRP - http://t.co/9Nb2wDH4Ch": 0, "Microsoft May Finally Put Windows RT Out To Pasture http://t.co/Mk9BY3i8Rg #tech": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One http://t.co/IABIjUOk0o via @techcrunch": 0, "The education offer for Microsoft Surface endedbut JB Hi-Fi have a special deal http://t.co/Jh9WnRPjfq": 0, "Funny jokes &amp; pics: new image http://t.co/4230ZLLJZi #funny via http://t.co/fnTDKnNbKt http://t.co/k1M5vPe1Xx": 0, "RT @eurogamer: Microsoft slammed for sexist Xbox One ad. \"I know. You'd rather knit than watch me slay zombies.\" http://t.co/JBKxtkZNJ4": 0, "@Sender_aDv @Jus_Chino don't use Microsoft points anymore GG": 0, "#Tech Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/JiwIa2vvkW": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One | @scoopit http://t.co/p9YlQwUl0Y": 0, "@joseph_juseph is this the new Microsoft commercial? Haha very cool": 0, "Surface 2 review by some who says it doesn't replace the laptop or tablet. It potentially replaces both. #3layercake\nhttp://t.co/vJSUIsi5Rm": 0, "We Got Your Back: Heres How to Respond to Microsofts Incredibly Sexist Xbox One Email http://t.co/w0iCBNV9s1": 0, "Enter to win a copy of Microsoft @Office 365 and #GetItDone!  http://t.co/AKMknIIn1q": 0, "RT @AhrensDavid: #cloud market expands to $2.5B this quarter. @csstars is one of the original private cloud pioneers of SaaS http://t.co/rj": 0, "@Microsoft ummmmm i just got a new power box for my xbox 360 and everytime i plug evrything in like the coards it starts blinkin red and ma": 0, "Microsoft May Finally Put Windows RT Out To Pasture - onyxruby writes \"Microsoft may finally be ready to put Windo...": 0, "@r3p01012 @kaos_gunnplay And I thought microsoft were the software company ;-)": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/WjudNx0fUc": 0, "@ProgramX Does Microsoft have a map of an elbow and an arse?\n#whataretheythinking": 0, "The Young Turks: Jewish Barack Obama Donors Angry Over Iran http://t.co/pyS6ez6iLf via http://t.co/lZZNua5BaA #uspolitics": 0, "Microsoft Starts Black Friday Early With Surface, Touch PC Deals: If your wallet can handle it, a number of re... http://t.co/H2t6eD8jXM": 0, "Microsoft issued a security alert and is investigating MS Windows local privilege escalation zero-day http://t.co/lxd6WzAnD0 / @ZDNet": 0, "RT @EverythingMS: Microsoft fights back against the National Security Agency - fortifies their security http://t.co/2L6VV2vf6X": 0, "Suspicious of #NSA spying, #Microsoft moves to encrypt #Internet traffic - report http://t.co/DaHzoML93n via @southweborg": 0, "#Microsoft Gaming's Next Revolution Will Be Livestreamed, And The PS4 Has A Nice Lead http://t.co/mnqBmkP1uL": 0, "Microsoft 98-349 take-home examination: JVPvMGq": 0, "RT @Windows: Bring your family closer together with @Adobe Revel for Windows: the private place to view &amp; share everyday photos! http://t.c": 0, "RT @msftsecresponse: #Security #Advisory 2914486 released covering a local privilege escalation affecting WinXP &amp; Server 2003. http://t.co/": 0, "Microsoft investigating MS Windows local privilege escalation zero-day: Microsoft issued a security alert and ... http://t.co/ehKIeEc7hf": 0, "Microsoft very sore after backdoor probe by NSA, will now encrypt networks http://t.co/vVAQV57kzr": 0, "Journey through ancient Rome in a new EZ course to learn about the exciting new features in @RyseGame: Son of Rome: http://t.co/uLqp3E2K9d": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/U46LH8hu61": 0, "News from Wiseguyapps : Microsoft may be skirting Chinese censorship with new Skype - http://t.co/0h8CXACMLM http://t.co/rnkcCoZG3b": 0, "That was quick ... Windows RT (aka for ARM) goes to pasture http://t.co/HVcgyTOTMZ": 0, "IHS Teardown: Microsoft Xbox One sold at a loss http://t.co/RhWDpaedJX": 0, "Microsoft life cam vx 800 unboxing video nearly done.review video to come soon..it is worth the money/is it better than a more expensive cam": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/EWMvqNb86A": 0, "@Jono2012Murphy We suggest trying the steps outlined here: http://t.co/Azvx0S9xb4. Please let us know if this helps fix the issue. ^AEM": 0, "Sheila is like that paper clip on microsoft word jodiendo la baina": 0, "@Shervyn It's sort of become like Microsoft in the early 2000's - didn't really do anything bad, but everyone hated on them 24/7 anyway.": 0, "RT @SharePoint: Learn about Microsoft SharePoint 2013 platform options with this infographic. http://t.co/wznBRu4nzL": 0, "Microsoft alienates female gamers with a sexist letter to dudes: \nThe company released... http://t.co/1gBPLgZMS6 http://t.co/ZDFoBWsBHp": 0, "Lool RT @TheGreyHunter: Nokia : Microsoft and its users must think Instagram really just hit the stores. ": 0, "I'm ll   for ripping on chromebooks bt that microsoft scroogled commercial is the worst real fake real commercial I've ever seen:g": 0, "I wonder if anyone told @nokia and @Microsoft that the new #Lumia1520 is too tall and too narrow...": 0, "RT @RememberingMSN: Today, MSN Messenger is no more. After 14 years, Microsoft have closed the once popular instant messaging service. R.I.": 0, "Tomorrow I'm going to celebrate Thanksgiving in Munich at a Microsoft Surface press event. I'm already grateful if I don't break anything.": 0, "@Gaetano_Prestia to be honest, I'm more than impressed with the Xbox One, and I have never been a Microsoft fan.": 0, "Creating better customer value and respect. \"Microsoft offers free game for Xbox One owners burned by bad hardware\". http://t.co/Ai9WpDumIR": 0, "Miley Cyrus' guest appearance http://t.co/kn5ca32CrF #worldnews via http://t.co/3cVMRz99nh": 0, "Insanely Funny Shit: new image http://t.co/GscMnhqZNy via http://t.co/fnTDKnNbKt #funny": 0, "Inked Magazine: 20% OFF with coupon code \"Holiday13\"!!\n Come and get yours http://t.co/5M0cO3ahlk via http://t.co/a3cv3RrZ94": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional (Mike Masnick/Techdirt) http://t.co/jkU8DIY9mG": 0, "Microsoft Delivers Huge PDF to Compile the Windows Server 2012 TechNet Library http://t.co/X7kRziSUme": 0, "So Microsoft claim the 24 hour bans people were getting for swearing were all about Upload Studio and nothing to do with Skype.": 0, "Microsoft May Finally Put Windows RT Out To Pasture http://t.co/cmV6Tdqbvg": 0, "@GrimKillingbeck U think they heard us chatting? RT:\"@totalgaming: Microsoft apologizes for 'sexist' Xbox One promo http://t.co/IWrT0EqxIN\"": 0, "I liked a @YouTube video from @arsonall http://t.co/LrEPROXuNf Microsoft Beats Sony In Customer Service \"Free Xbox One Game\" \"Xbox": 0, "#Sitex begins tdy! Check out great retail offers for Surface, Xbox 360, Office and PC Accessories &amp; xciting activities we've got lined up!": 0, "The richest man in the US is not the president . . It's Bill Gates the owner of Microsoft !": 0, "Microsoft is missing the point with Chromebooks http://t.co/vpHviv5dJC": 0, "@Microsoft king a dinging noise you no how i get rid of it": 0, "70-685: what are the preparation gear handy open door preparing to microsoft mk-dos 7 performance desktop plug ...": 0, "RT @TechCrunch: Nokia Now Controls 90% Of The #Windows Phone Market http://t.co/1p4em0Tykz #microsoft": 0, "Microsoft and MTV hmmm think about it once. ;-)": 0, "I liked a @YouTube video http://t.co/E5kUZsduTy Apple acquires the company behind Microsoft's Kinect": 0, "Public warning victims of the Microsoft scam or tech Support Scam are defrauded a second time http://t.co/VsGNJlSEAT  QPS MEDIA": 0, "#TechFeed Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/03354hWs7A": 0, "@stax97 Let's get you in touch with Customer Service at http://t.co/FyQ8LnGyIz to see if they can assist you with the issue. ^KLM": 0, "MMA Fight Club: The Eagle http://t.co/DYn3oBfnQm via http://t.co/ABUaH7ML8Q #mma": 0, "Huh, 3.1 came with a built-in tutorial on how to use a mouse. It was a new system, new UI. Hey @Microsoft, 8.1 touch/metro tutorial maybe?": 0, "RT @will_luton: Microsoft apologize for the letter and another day of press is secured http://t.co/rx0hWqm2EB": 0, "Surprise Party Switch-a-roo from \"Extreme Howdy's Makeover\" | RAISING HOPE... http://t.co/PQXuPqe3vd via http://t.co/tXjObGiDiU": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/8GfmDZog32": 0, "Thank goodness.. RT @slashdot Microsoft May Finally Put Windows RT Out To Pasture http://t.co/9CkQHlEHzt": 0, "Looks like I DON'T have the Microsoft office disks anymore...": 0, "RT @xboxjobs: Unbelievably cool! &gt;&gt; A bridge to #Xbox: #Microsoft to fund $33M project connecting employees to light rail: http://t.co/HtKR": 0, "RT @NO2NSA: #Microsoft very sore after backdoor probe by #NSA, will now encrypt #networks @TheRegister http://t.co/djgdENp7kH": 0, "RT @Xbox_Repairer: NeowinMicrosoft won't comment on plans for Xbox 360 Skype appNeowinWhile Microsoft has made a big fuss about a... http:/": 0, "Microsoft 70-583 pdf rally hit and miss hydraulic engine: TtkPTK": 0, "RT @TheRocksGuy: #sitecore: Released #sitecorerocks 1.0.1 on http://t.co/eKe0KuuBvs. No longer in CTP - now officially supported by Sitecore": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/x70JwEfSTf": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expres... http://t.co/Jn6QuK2AEH #games #ps4": 0, "@minecraftking46 I forgive, Microsoft is really lolbad anyways": 0, "The man inside the Seahawks' mascot, Blitz! http://t.co/ExCojQmhGR @Seahawks": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/eFn4rLPdbY": 0, "Brighton College Partners with Microsoft IT Academy http://t.co/jKPj7ZPpba #Education": 0, "They put the red square back in the Microsoft logo :-) it was missing for a while.": 0, "#Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/maqKYRNYP0 #Security": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/walk9WpQ3A": 0, "Forget Doctors Note, Microsoft Now Allows You To Write Perfect Letter To Your Girl Friend To Buy Xbox One - http://t.co/NB7gMCmvcC": 0, "Amazon Is Crushing IBM, Microsoft, And Google In #Cloud Computing - Business Insider http://t.co/SP6SjIuZ3k #bigger #billion": 0, "10 Reasons to Give Your Startup the Microsoft Ventures Accelerator Advantage http://t.co/X1iAxFUKkb @ravignarayan": 0, "Um, ouch!! // Microsoft very sore after backdoor probe by NSA, will now encrypt networks  The Register http://t.co/L15lCRYYaC": 0, "Bill Gates Imposes Microsoft Model on School Reform: Only to Have the Company Junk It After It Failed | Alternet http://t.co/u0anaQqxth": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit http://t.co/QYCj2XgQna #tech #news": 0, "Microsoft Boosts Encryption to Guard Traffic Against NSA Snooping: Following revelations that the spy agency t... http://t.co/5mxEJEl5HE": 0, "RT @postpolitics: Microsoft, suspecting NSA spying, to ramp up efforts to encrypt its Internet traffic http://t.co/qj1HJJrPP4": 0, "Microsoft May Finally Put Windows RT Out To Pasture http://t.co/HAPl2MwXNA": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have expressed interest... http://t.co/H3IoA3v8s2": 0, "RT @TRLDistrict: TRL now offers the Microsoft IT Academy available free with your library card. Over 1,500 online, self-paced courses. http": 0, "Report: Microsoft to encrypt more of its data to prevent NSA spying http://t.co/laMX0GcSgm": 0, "Microsoft Giving Free Games to Compensate for Faulty Systems http://t.co/5FBTVn252q #Gaming #DeadRisin3": 0, "\"Microsoft Outlook would like to recall the message, '...'\"\n\nMe: http://t.co/YFbrYaBw8w": 0, "RT @ashk4n: New slide: MONKEYPUZZLE is GCHQ's Universal Targeting Tool for tasking Microsoft, Google &amp; Yahoo data at MUSCULAR: \n\nhttp://t.c": 0, "#BillGates Imposes Microsoft Model on #SchoolReform: Only to Have the Company Junk It After It Failed  http://t.co/UzmukXKaQ9 #edchat": 0, "So tonight, Microsoft Word has crashed on me twice, at the exact same point of typing up my show tracklisting. I don't need this right now..": 0, "Xbox Ad Criticized as Sexist http://t.co/gbRl8Wu98N": 0, "Microsoft's Scroogled Campaign Takes On Google's Chromebook http://t.co/NIG9jJ1JBQ http://t.co/lV5wIynMNB": 0, "@R11398Sr @yuen711 @MalenaMorgan I don't know Microsoft system PC is expensive in US?": 0, "As Microsoft Moves to Encrypted Search, Webmasters Could Lose More Keyword Data http://t.co/FLbh51L9MJ": 0, "About the ad, although the fool who wrote it should get most of the blame for such nonsense, Microsoft is still wrong for sharing it though.": 0, "@IgnatJames http://t.co/O8uv3UKsaQ Check out this link. It's another way to get to those preferences. -LA": 0, "looks like I'm gonna be staying up the next couple of nights to finish up my Microsoft stuff to study for my exam in a few weeks": 0, "I fukkin hate Microsoft": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit http://t.co/381Q6Zl2ha http://t.co/Wp1iCV98vU": 0, "http://t.co/lBkWjZr57R RT @DNLee5: wait does Excell NOT calculate standard error?": 0, "@the_wergst Please choose an option at http://t.co/InJDLaZccW, sign in with a working Microsoft account and fill out the contact form. ^KB": 0, "So Microsoft (?) give Jamie Ridge the new Xbox as part of their marketing strategy. Is this some next level strategy too genius for mortals?": 0, "RT @Microsoft_Xbox3: #Microsoft Explains Why 'Halo 4' Didn't Debut On #Xbox One: If there's a common refrain going around the gamin... http": 0, "@evleaks but by the time windows phone blue comes out, wont nokia be a part of microsoft?": 0, "RT @techdirt: Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional http://t.co/5Fywo2YCnP": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console (PAL) Bundle Great Christmas gift: $275.00 End Date: Monday... http://t.co/5LkxX7r0IW": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/ih8CV3L39d": 0, "Microsoft very sore after backdoor access by NSA, vows to encrypt networks - Register http://t.co/zv3IAbirbS": 0, "Microsoft wrote a form letter for men to convince their girlfriends to let them buy an Xbox. It backfired: http://t.co/urk5qt5dQP": 0, "Suspicious of NSA spying, Microsoft moves to encrypt Internet traffic - report http://t.co/0064p3xl5A #XKeyscore #NSA #PRISM": 0, "Single and ready to mingle with Microsoft.": 0, "@DT_7_ Go to smyths!!! Ive 2 anyhow, be about a week for a replacement pad from Microsoft (I hope)": 0, "Holiday Lights at Steep Heights in Seattle http://t.co/R5d0OXky7q via http://t.co/3cVMRz99nh #worldnews": 0, "Microsoft is working on a Remote Desktop app for Windows Phone http://t.co/zTEObhz22K": 0, "If I want to call my buddy a fucking n00b when I kick his ass I will call him that. Fuck you microsoft.": 0, "Microsoft apologizes for 'sexist' Xbox One promo http://t.co/2cVykk6hZv": 0, "227's YouTube Chili' Latest Xbox Live Code Microsoft Points Generator New May 2013: \n\nLate... http://t.co/n7n6BFNKX2 Jamaal Al-Din - NBA": 0, "As Nadella And Mulally Lead In Microsoft's CEO Hunt, The Internal/External Debate Continues http://t.co/ImwAWgxGDr": 0, "United States Table Tenni...: new image http://t.co/pxZu7LDXpF via http://t.co/jDAwU42y28 #olympics http://t.co/FwwxA5K3Sp": 0, "Microsoft To Encrypt Data Center Links; Says NSA Hacking Would Be Unconstitutional http://t.co/v3cVlQ0TAJ": 0, "https://t.co/gFqJE0PTrQ\n\n I'm not getting an xbox one then. Microsoft you just lost a customer.": 0, "#Microsoft's dilemma: their encryption is as reassuring as free mosquito net from Transylvania Tourist Board http://t.co/m6mS8hkjTr #GLWT": 0, "RT @Xbudz: Please fix the bumper buttons on the #XboxOne controller. @Xbox @Microsoft @aarongreenberg @albertpenello @thevowel http://t.co/": 0, "I've joined @Microsoft's @scroogled campaign!\nYOU SHOULD, TOO!!!": 0, "@PhinaVera: \" Taco Fries.. Round Bubble Nickiminaj crazy Aass Ass... Mc chicken Loving ...MICROSOFT Loving ....\" \n\nMicrosoft? ": 0, "RT @mwpreston: Hey Microsoft, why dont u grab a beer w/ us http://t.co/VunMnjOIes &lt; @discoposse @sixfootdad twitter links on the register!": 0, "RT @liveside: Microsoft launches web-based Xbox Video, Windows Phone app coming soon: Earlier this month,... http://t.co/YqGMlLzwi2": 0, "#Microsoft Releases #Security #Advisory 2914486: [#technet.com] Today we released #Security_Advisory 2914486... http://t.co/5ufyIhhiEB": 0, "RT @journeyfortruth: No, seriously, I REALLY hate Microsoft (which even now ... http://t.co/QuLGtd7XqL #Flickr #MicrosoftSucks http://t.co/": 0, "Xbox one http://t.co/pGlkSyPj83": 0, "Xbox froze. Now it won't connect to wifi. Fuck you @Microsoft.": 0, "#cybersecurity Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/kUoXKC1Cna #infosec": 0, "Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/TKjp6pRNFn": 0, "Britney Spears: Thank u InStyle for the beautiful flowers &amp; sweet note. L... http://t.co/ZYYda7tF64 via http://t.co/lZ21fxpl5d": 0, "RT @CVG_News: Microsoft 'working to fix' Xbox Live connectivity issues  http://t.co/Y1kbhzCsxM": 0, "Finals week: 9 unrecognized words (and counting) added to the Microsoft Word dictionary.......": 0, "GS News - PS4 profitability similar to PS2 + Gears of War may be returning!: Microsoft have ... http://t.co/TLld84gUzH #Gamespotpreviews": 0, "Did you know? Microsoft Office has a 95% market share. How does this affect your company? http://t.co/RU6Ncp49LX #ITCenter": 0, "RT @Franklynbrw: I failed in some exams but my friend passed in all. But now I'm the owner of microsoft and my friend become my engineer. -": 0, "RT @PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits": 0, "Microsofts new Xbox One ad is being criticized as sexist. Here's why: http://t.co/7Ao6nmB12A": 0, "RT @Applianceretail: Microsoft v Chromebook is more like Yawn Stars http://t.co/pL16XCsajq (UnderCurrent)": 0, "Help UCLA game design students in learning how to use feedback from players, use this link: http://t.co/QNHbtSw7xF #FunApps #Win8": 0, "Technology News Apple acquires the company behind Microsoft's Kinect http://t.co/fJAgxQLHqA": 0, "Console Wars 2013: Microsoft's Xbox One vs. Sony's PlayStation 4 -  The future is now! Last week, Sony... http://t.co/b7k1Jz8aWQ\n #XboxOne": 0, "Stolen Quotes To Share: new image http://t.co/cMDDyzQRIR via http://t.co/gxktWhKfbI #quotes http://t.co/LKmYlND299": 0, "Microsoft Xbox One Day One - NORTH NJ LOCAL PICKUP ONLY - READ FULL DESCRIPTION: $675.00 End Date: Friday... http://t.co/bmwzlmmayF": 0, "RT @awkwardflamingo: [opens up microsoft word so it looks like im doing homework]": 0, "Skype for China now talks directly to Microsoft, may reduce government snooping (updated) http://t.co/axRPuHFohb #Startup #Entrepreneur...": 0, "#CyberSecurity Microsoft investigating MS Windows local privilege escalation zero-day http://t.co/qsamwAOIoS": 0, "RT @NeowinFeed: Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit http://t.co/WWMnadchOi #microsoft #windo": 0, "Microsoft May Finally Put Windows RT Out To Pasture http://t.co/kdK7Ax0u9x": 0, "@yuen711 @IamLDemon I can't even hack her account like I wanted to. All the fun stuff is for Microsoft systems. :( I have a Macintosh.": 0, "@ReaLTeK_ That's odd! Alright, can you log in at http://t.co/vnMNLgBa8l and ensure all your payment/billing info is correct? ^RZ": 0, "@MrCoryMurphy Microsoft are lying, cheating thieves (aka 'a business'). Cory may or may not be retarded. Let's vote!": 0, "Microsoft Publishes Sexist Form Letter To Help Dudes Convince Women To Let Them Buy An Xbox One http://t.co/OUkXMjlumg via @techcrunch": 0, "@GamingAnarchist One last thing: sexist of making a big deal outta nothing http://t.co/syu8FLEO2o": 0, "RT @MagnifiKent_: @TheGreyHunter: Nokia : Microsoft and its users must think Instagram really just hit the stores. ": 0, "I'm b  all for rpping on chromebooks bt that microsoft scroogled commercial is the worst real fake real commercial I've ever seen,": 0, "#microsoft #l4l #apple #f4f #truth #igers #realtalk #instahub #tupac #igpic #tagsforlikes #loveit http://t.co/95q7srexsv": 0, "Designer explains absent multi http://t.co/vuS72NXkYt #Microsoft #multiplayer #Nintendo #PC #playstation #PS3 #ps4 #timbrowne #Ubisoft": 0, "In part one of the #GBReplay special, we look at the racing and downloadable games from Microsoft and Sonys http://t.co/G4GEGG3kNi": 0, "@seanparsons Well, I got it for free from Microsoft, so there's that": 0, "RT @gmelnik: In the spirit of true open source, Microsoft EntLib now accepts community contributions! Pull request for the win! http://t.co": 0, "@techdirt Dump Microsoft - it's the only way.": 0, "Ignition Completes Certification for Microsoft Audit Competency http://t.co/5Lq92aau7L": 0, "Microsoft issues security alert for new Windows XP and Windows Server 2003 exploit #microsof... http://t.co/njXyRVMYYq - via @NeowinFeed": 0}