{"RT @ohhlindsayelyse: Say what you want about the ps4, but I'm getting an xbox tonight!! Microsoft store at Scottsdale fashion square! come ": 0, "Source: #Microsoft In Talks To Buy #Shoutcast And #Winamp From AOL - http://t.co/PNWNIpSYFu": 0, "New on Ebay Microsoft Xbox One Day One Edition 500 GB Black Console Brand New  http://t.co/ME9h9DLYyQ http://t.co/7khVeH957N": 0, "Who's buying Madden25 for xboxone retweet #EA sports #xboxone #Microsoft": 0, "RT @abdelrady: Yes, #work_can_wait A brilliant response to #Microsoft campaign of #office365 \nWork can wait .. live you life :) http://t.co": 0, "RT @PRNews: Microsofts New Employee-Relations Initiative: Dump Stack Ranking http://t.co/sE4MBWyqOP": 0, "I think when Xbox One launches hit Europe and the US Microsoft is gonna have a bad time.": 0, "RT @guardiantech: Which PC should I buy to run a small business? http://t.co/NIlLenEaG4": 0, "Sony's acting like a bag of dicks. C'mon Sony dick bags, don't be a bag of dicks to Microsoft after they congratulated you on your console.": 0, "Reports Microsoft in talks to buy Winamp &amp; Shoutcast. The llama may not be dead after all: http://t.co/v1TcaRy2dD": 0, "https://t.co/stf0JTbQrO @GameStop launch TONIGHT! @Microsoft @Xbox @majornelson Can I finally get an RT on my #MoreAdvanced #XboxOne video!?": 0, "No Microsoft I can't trouble shoot with online options. My issue is this damn laptop won't connect to the internet.": 0, "You all remember 1984? Well today we're one step closer to that. Thanks, Microsoft. #XboxOneLaunch": 0, "@SMspartan_K99 how about any Microsoft points to change my gt": 0, "After what people did about the PS4, Microsoft has decided to use armored trucks to transport the xbox 1 to the Microsoft even": 0, "RT @MinutePostTech: #TechNews http://t.co/9Aat8zTCyV, other Microsoft sites hit by service disruption via CNET http://t.co/Mt1ULnIZFc": 0, "If I ranted too much then sorry but I wanted to remind those with short memories about what @Microsoft were going to do #X1": 0, "RT @Techmeme: Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services http://t.co/YzQOmqiCX5 http://t": 0, "Microsoft brings rich node.js support to #VisualStudio - Ars Technica http://t.co/UWJti5EhKg": 0, "XBOX ONE SWAG #XboxOne #xbox #XboxOneSquare #Microsoft #GAMEXboxLaunch http://t.co/fasLSXuJ0n": 0, "RT @geoffreyfowler: Hunting for stocking stuffers? How about an anti-Google mug made by Microsoft: http://t.co/4AHXpvpWHm (So, so 2013) htt": 0, "Today on Hard News, Amazon's great deals, EA has been sued by the NCAA, and Microsoft makes patching a little harder. http://t.co/NKCL357kd9": 0, "@JeremyDurant my brother works at Microsoft and they were giving those away to all the developers yesterday! Insane lines.": 0, "RT @engadget: Planning to buy @Microsoft's #XboxOne? Check out our review first: http://t.co/kt0IV3lgZ0 http://t.co/Kwa1ywFplg": 0, "RT @the_bossman222: @Microsoft I got my PS4 coming, twice the console your piece of shit is": 0, "RT @CNET: Microsoft online services appear back to normal after brief outage http://t.co/XXGRhnKDFH": 0, "Some Microsoft sites are currently down due to some DNS woes:  Down for everyone or just me? Thats basically ... http://t.co/IEddxtyvqq": 0, "@iamcharlietune  I'm selling it at 90... 9.99 less than Microsoft ": 0, "I can't wait for the new Microsoft store to KILL the apple store.": 0, "RT if you will be picking up #XboxOne at midnight tonight! http://t.co/mcIpiIagty": 0, "RT @cizky: Munich Abandoned Microsoft for Open Source! Who's next? http://t.co/J2tvYQaHU8": 0, "300 game shops stay open in to the night for Microsoft #XboxOne global launch in UK http://t.co/PFvGaMd5A1 #Xbox http://t.co/ThDYAttZmy": 0, "RT @DrPizza: Microsoft brings rich node.js support to Visual Studio at arstechnica http://t.co/nkBNNCapxN": 0, "Kate Mitchell | The Importance of Listening http://t.co/mJWfxtzbTS #worldnews via http://t.co/3cVMRz99nh": 0, "I think that I have a pretty good vocabulary, and then @gruber drops \"cack\" http://t.co/1CKlxy2xFR": 0, "RT @FlagCaptured: You all remember 1984? Well today we're one step closer to that. Thanks, Microsoft. #XboxOneLaunch": 0, "@Flameinc It's hard for me to visualize \"Microsoft\" and \"Hipster\" in the same sentence. ;-)": 0, "@jsb3808 I found out it's actually at the Microsoft store": 0, "Theres an update on the #Outlook issue over at @TheNextWeb. Still not many details, but info is coming in. http://t.co/O5PknCvj60": 0, "@DanielPink @instapaper is this the same practice that Microsoft used and recently dropped it?": 0, "@anoosrini thought some Microsoft based :P": 0, "One Microsoft Way: Microsoft brings rich node.js support to Visual Studio http://t.co/xRTfl5kBYV": 0, "BBC News - Windows Phone 8: Microsoft's breakthrough moment? http://t.co/KGiC7Ir6Sx": 0, "One Microsoft Way: Microsoft brings rich node.js support to Visual Studio http://t.co/QCgtscNRh5": 0, "And that's why I closed my #Windows. \"@WIRED: #Microsoft, this just makes you look desperate. http://t.co/5NvaLIJko6 http://t.co/LcklbkXlJI\"": 0, "@Microsoft @Xbox yes!!!!!!!": 0, "@maryjofoley I'll be counting on you tomorrow for some good Microsoft non-Xbox-related news ": 0, "@Sesha_Kim okay.. and now what should a type in microsoft? okay abt abrasion but definition or what?? im really confuse seshaa :(": 0, "http://t.co/Fkr1QgekX8, other Microsoft sites hit by service disruption http://t.co/rMSJOYqith": 0, "RT @BlackMarble: Check out our #CityNext Video Case Study on our #Azure work for @OfficialTfGM http://t.co/7Rug1oKxGJ with @sdspencer &lt;&lt; cc": 0, "I liked a @YouTube video from @realmofcool http://t.co/PqFQWqNWn2 Alternatives to Microsoft office": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair... http://t.co/maQvTIqRp0 #Techradar #Technew": 0, "RT @TechCrunch: Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services http://t.co/T2ttudMg9u by @al": 0, "RT @ManaByte: Microsofts Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services http://t.co/SCJZO3WGL1 via @tec": 0, "What the fuck @Microsoft, are you drunk? Xbox One? This is the third one you cunts. #Pacman": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/SKX0YzIjiH": 0, "Stormy day as Microsoft goes dark: MICROSOFT'S SkyDrive cloud service and other sites have gone offline with u... http://t.co/ThqcP0x2NL": 0, "Way-hay! and they're back in the room.#Hotmail #MSN #Microsoft.": 0, "RT @michaelyma: I told my mom that I didn't have to eat till next Monday if she bought me Microsoft points. That being said she bought me w": 0, "RT @Office: @FredPirollo Hi, Fred. You can easily change the default font in Word. Just see this link: http://t.co/hWVsRh1Riz": 0, "Australian Technology Services firms - A change of paradigm ? http://t.co/NrvNzOjE58 #Cloud #WCM #BI #BPM #Microsoft #CA": 0, "RT @Disgone: Xbox One has become self aware and MS pulled plug to prevent nuclear war. #microsoft #downtime #conspiracy": 0, "Friday's product of the day, thanks to Microsoft. http://t.co/mVL6zXTAAX": 0, "RT @rosamariatorres: #mingaTEC #SoftwareLibre RT @aletorto The death of Microsoft http://t.co/7tasBJ0Dsj": 0, "Schwab encourages @BillGates to return to MSFT// http://t.co/GbWWu4bOW6 @BloombergNews": 0, "Microsoft Employee Unboxes Limited-Edition White Xbox One http://t.co/cRWiIJ4AJp": 0, "@ObiCynKenobi @Kotaku Microsoft is keeping it pretty classy though. They haven't taken a shot at the PlayStation 4 at all.": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services [Update: Back Up!... http://t.co/bg9Q0PiRYZ": 0, "Listen to how the @VanCanucks are achieving business goals with Microsoft Dynamics CRM http://t.co/KwkFicuSoA #MsDynCRM #TheArtOf": 0, "RT @verge: AOL reportedly wants to sell Winamp to Microsoft http://t.co/pe03abM3JA": 0, "Samsung joins Apple and Microsoft at West Edmonton Mall http://t.co/N4HwF1eq2d": 0, "http://t.co/kVTyxixT4k, other Microsoft sites hit by service disruption http://t.co/72eJI1AJzD": 0, "Microsoft: We're working unbelievably hard to match demand | GamesIndustry International http://t.co/gizxNUfmcE": 0, "Apply: http://t.co/fafX6yCUrs for Microsoft CRM Developer (Code: TRLCRM) - Remote Staff Inc. | by JobsDB": 0, "RT @vfiorg: Microsoft Bringing Message Encryption To Office 365 In Early 2014 - @techcrunch http://t.co/pFHKu1waVs #cybersecurity": 0, "Deja vu at the #XboxOne party at #Microsoft": 0, "Big up Microsoft. Who would've ever known that when Sony released the Playstation console they'd have a legitimate competitor.": 0, "#XboxOneLaunch poor microsoft, having to promote a hashtag to get it trending, as damp nobody gives a shit squib of a launch is happening :(": 0, "RT @microsoftcanada: Listen to how the @VanCanucks are achieving business goals with Microsoft Dynamics CRM http://t.co/KwkFicuSoA #MsDyn": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google has questionable treatment of...": 0, "@dinamoati Actually really disappointed- I found out Peel DS is replacing sites like Edmodo with Microsoft.": 0, "@Microsoft my Win8 machine just gave me a 5 min restart ultimatum due to updates, no postpone? No wonder you guys are screwed #fail #regedit": 0, "@vVv_Shadow no more than 5 but I am like across the street from Microsoft that has hundreads and toys r us that has some too": 0, "\"Its like, French is a great idea, but nobody is going to invent French if theyre constantly being attacked by bears http://t.co/R02lQP7nWt": 0, "Microsoft to take over Nokias Finnish headquarters http://t.co/JnupMcltgM #Tech": 0, "@FredPirollo Hi, Fred. You can easily change the default font in Word. Just see this link: http://t.co/hWVsRh1Riz": 0, "Avoid telephone tech support phone #scams from those claiming to be #MSFT with these tips. RT &amp; Share: http://t.co/x0sMyU4q1R": 0, "Some Microsoft sites are currently down due to some DNS woes:  Down for everyone or just me? Thats basically ... http://t.co/2iDCXhGiU4": 0, "@CVG_News so Microsoft send congrats on launch. And sony do this. #classless": 0, "RT @ExpertZone: Get in line for the ultimate #XboxOne launch party in the US, plus ways to win! http://t.co/OG1SLsRtFs #EZXboxOne http://t.": 0, "@MoniqueMulcare @dinamoati @sheridancollege The gloves are off. #Microsoft doesn't want to lose all their peeps to #Apple #Peelpublicschools": 0, "RT @malinidas: \"I HAVE NO TOOLS BECAUSE IVE DESTROYED MY TOOLS WITH MY TOOLS\" Hilarious piece about programming: https://t.co/bNC9W5w6rG": 0, "why doesn't my computer have Microsoft publisher ": 0, "YouTuber KSI dumped by Microsoft after Xbox One launch appearance - http://t.co/VRKwu0Lad6": 0, "Microsoft In Talks To Buy Shoutcast And Winamp From AOL http://t.co/BfeWETHLWU via @feedly": 0, "RT @DearJFree: Oh really it's a fact or is it a 13 yr old girl who just figured out Microsoft word http://t.co/rbcDQWlEYR": 0, "XBox Live crashed big time tonight and now I hear rumours of big probs at Microsoft. All on xBox1 launch day. Oops": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/HUBgMhm1mO": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/4EzfuaAxDJ": 0, "#technology http://t.co/zNC1IGtf2z, other Microsoft sites hit by service disruption http://t.co/x8YRGmP4Ai": 0, "Microsoft Community: USB ports are not recognized in Windows 8.1 http://t.co/NWQsZITQtM\n@Microsoft": 0, "PopSugar: \"Im literally what everyone is talking about\"  see more funny... http://t.co/0HTH9BvzLM via http://t.co/lZ21fxpl5d": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/GyBiEDSESb": 0, "Hope Microsoft doesn't show the Xbox shutdown command feature in Xbox One TV ads when viewing them on your Xbox One.": 0, "CSS Compatibility in Internet Explorer\n\nI didn't know this existed, it's very useful, used to think  #IE8 was worse\n\nhttp://t.co/DInDyQTxgE": 0, "@TimmySkorcher are you goin to the Microsoft stores launch party thing tonight? They said somethin about raffling stuff off": 0, "New on Ebay Microsoft Xbox One - Day One Edition http://t.co/fiRMdd1zde http://t.co/SwABRAUYsM": 0, "Some Microsoft sites are currently down due to some DNS woes http://t.co/5EBXzqZqQE": 0, "RT @0xabad1dea: I think I have a schadenfreude problem: heard Microsoft DNS was down, disappointed when websites load correctly.": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/NirM7zIOYD": 0, "Microsoft SharePoint Designer 2010 Step by Step http://t.co/0hdJ7wPiky #ux #book": 0, "RT @schestowitz: Acacia, Which Has Former Microsoft Managers and Agenda, Apparently No Longer Good for #Microsoft http://t.co/DV76tkpy34 #a": 0, "New on Ebay New Microsoft Xbox One- Day One Edition 500 GB Black Console  http://t.co/Pcbqq8jqEH http://t.co/89doMkvLN0": 0, "@Microsoft where is the free Windows 8.1 update?  I have looked snd looked..THANK S": 0, "RT @RudyHuyn: I had the chance to visit WP studio and meet some of the awesome microsoft designers, developers &amp; managers #wpRocks http://t": 0, "Women account for about a quarter of all employees at Apple, Google, Facebook, Oracle and Microsoft. http://t.co/ms8x1oNAe5": 0, "Xbox Is a Test for the One Microsoft Strategy - Businessweek http://t.co/6O94UOZ8ZV": 0, "Looks like @Microsoft are hitting new lows again: http://t.co/J0uv6r1ihU. Still not as bad as the videos they did poking fun at a dead man.": 0, "RT @MMAFTR: Rick Hawn: All weighed in and ready to go for tomorrow night! http://t.co/1CMzakDHW0 via http://t.co/ABUaH7ML8Q #mma": 0, "So excited to get my hands on it!!! Been here since 5:30am!!! Go Microsoft! @MicrosoftStore  #XboxOne  #Orlando": 0, "imma need microsoft, twitter or sumthing to start allowing emoji's to be displayed on my laptop. cuz the struggle is real.": 0, "Dear Microsoft, the start button in Windows 8.1 is pointless. That's like asking for a wine list and getting pictures. What good is that!?!!": 0, "KSI and Xbox: Why Microsoft Got it Wrong. https://t.co/fkvTSK1JgK (Please watch &amp; RT - this is important.)": 0, "#Cloud Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch: Microsoft'... http://t.co/DMvxNqIUQx": 0, "#Cloud Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch: Microsoft'... http://t.co/YFxNEylUGb": 0, "i'll be working from 9-1 so stop into microsoft, say hi, and have fun with the xbox one!": 0, "God bless Microsoft paint": 0, "Microsoft stopped working world wide, but now it's back": 0, "Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all... http://t.co/5kBKrtMkLb #ArsTechnica #news": 0, "RT @TimCushing: \"Google Is Amused by Microsoft's Anti-Google T-Shirts\" http://t.co/fL86bH6HuJ": 0, "http://t.co/e14i0108dJ, other Microsoft sites hit by service disruption http://t.co/qzpv2lCtef": 0, "Doctor Who: The TARDIS landed in BBC America's New York office today!\n\nSe... http://t.co/nsAmoJ45nD via http://t.co/tXjObGiDiU": 0, "microsoft access why so hard?": 0, "Tech Update: \"Microsoft brings rich node.js support to Visual Studio\" http://t.co/xKemlAoZJe": 0, "Microsoft preps mobile app for Office 365 admins - http://t.co/VYTP1gnldQ: Microsoft preps mobile app for Offic... http://t.co/8vA7JWnEkv": 0, "http://t.co/HyWfP3KqKY, other Microsoft sites hit by service disruption: Error message indicates th... http://t.co/cmmJed1iMq #Tech #News": 0, "@gibbygirl97 well then we have a problem... Haha jk I agree yet I own Microsoft gaga": 0, "Microsoft DNS servers down; Hotmail, http://t.co/MFZRzMbxy6, others down [Update: Resolved] http://t.co/FcfjkV2A2X": 0, "How is this stuff real? Microsoft encourages you to ignore your kids or dinner date http://t.co/TYseUOFLJ3 http://t.co/cH0VapnePF": 0, "http://t.co/oyhNu435PS, other Microsoft sites hit by service disruption - CNET  http://t.co/rNbjWjoG6R": 0, "ahahaha Microsoft keeps it classy. http://t.co/ox2FnPTskr": 0, "RT @BlueShiftBlog: Microsoft DNS servers down resulting in outages.  One doesn't simply \"lose\" DNS.  Hack attack?": 0, "I liked a @YouTube video http://t.co/ptIIPLJ5PG Microsoft Office 2013 Activation [NOVEMBER 2013]": 0, "RT @DrPizza: So Microsoft's entire DNS shits the bed, as Xbox One starts rolling out.": 0, "Blip: Google's sly response to Microsoft's Scroogle swag http://t.co/IMgl8FxEF1 #tech": 0, "Nokia's Finland HQ To Become A Microsoft Site Next Year, After Devices  http://t.co/2lWeRUcLPJ": 0, "Just waiting for Microsoft to hand deliver my free Xbox one": 0, "When going to japan? @Microsoft @Xbox": 0, "RT @sickipediabot: Whoever stole my copy of Microsoft Office, you're dead.\n\nYou have my Word!": 0, "Wow, Microsoft's anti-Google campaign, \"Scroogled\", is sooooooooo bad.": 0, "Winamp to live? Microsoft rumoured to buy ancient software from AOL - Pocket-lint\n\nhttp://t.co/mb5HsUOCsO": 0, "A San Francisco Startup Takes Aim At Microsoft's $20B Cash Cow - Forbes http://t.co/9Hpu664YAn": 0, "@RBDuffy Microsoft have a lot to answer for! Just cut my video connection with my family b/c of #XboxOne": 0, "I went to the new Microsoft store in the Galleria and I felt like I was cheating on Apple.": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch http://t.co/zzgIjDkubb #microsoft": 0, "#IT #WEB2 Literally BREAKING now: Microsoft Azure cloud, http://t.co/VbIIAp0pAU go TITSUP": 0, "Starting early 2014, you can send encrypted emails in Microsoft Office 365 to anyone http://t.co/v02BF2zkXM by @kaylenehong": 0, "@lifeflightnz You've been quoted in my #Storify story \"Kiwi Nonprofits Get Social with Microsoft\" http://t.co/dJhOEVRBpz": 0, "#followback Some Microsoft sites are currently down due to some DNS woes:  Down for everyone or just me? Thats basically the c...  #news": 0, "Bah, Humbug! Microsoft Wants You to Stock Up on Anti-Google Merchandise http://t.co/7Mn0Jm2DVF via @DashBurst": 0, "Microsoft reporting that all services are running normally.  Students: if you continue to experience issues, please notify Help Desk": 0, "RT @DaymneJe_seeee3: I don't have Microsoft PowerPoint. ": 0, "RT @handfulofsounds: Hey @Microsoft  @Xbox - I had a surprise root canal and used up XBox One savings on my stupid tooth roots. Have any ex": 0, "RT @smoshanthony: Microsoft says Xbox One's Kinect can't see through your clothes http://t.co/cOTVvTWy1T YOUR LOSS, XBOX ONE!": 0, "RT @tbhfuckoffpls: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/D7o77zVsE5": 0, "Shots fired! #PS4 #sony #XboxOne #Microsoft #gamer http://t.co/8lhlixsnXk": 0, "@GamingAnarchist Dickheads list nominee? Gaming news will not let me do my MGS Video... I will be roasting them soon http://t.co/qtKCfEnVVM": 0, "Tomorrow will show Microsoft how many true fans they still have.....": 0, "Sky News Australia: A new report has proposed lifting the pension age to... http://t.co/Q9Hhw1a0JG via http://t.co/3cVMRz99nh": 0, "RT @AmyatGS: We can take off the tinfoil hats now, it's not about spying \"#XboxOne Bundles Kinect Because MS Had No Choice\" http://t.co/ge9": 0, "Ubergizmo\nMicrosoft Launches Anti-Google Scroogled' Product Line\nhttp://t.co/Z33jfiHjCJ": 0, "I just bought: 'Forza Motorsport 5 Day One Edition' by Microsoft via @amazon http://t.co/h0aOjA4Wqx": 0, "Xbox Is a Test for the One Microsoft Strategy - Businessweek http://t.co/xiJWdVy6yY #microsoft": 0, "@PandaCookies Exciting! Here are some things to look forward to: http://t.co/oD53qK0qEh. Which features are you most interested in?": 0, "Microsoft News: Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch http://t.co/2AVwPc1fjd": 0, "HP and Google started in a garage. Microsoft and Apple started in a garage. We should spend less money on education and more on garages": 0, "Kiwi Nonprofits Get Social with Microsoft http://t.co/0KEGkD7Hfh  #mstech4goodnz #socialmedia": 0, "At the @Xbox @GAMEdigital #xboxone launch!!!! WOOOOOOOOOO!!!! @majornelson @Microsoft": 0, "Check out my profile on JDTV! https://t.co/2nwXbRJUNG #JustDance2014": 0, "Microsoft preps mobile app for Office 365 admins http://t.co/mzKJhTO0tu #twimbos #techzim": 0, "[Comic] My #PS4 might be borked!  Should I call Sony or Microsoft?  http://t.co/pGsnUKk6Nj": 0, "One day before launch, Microsoft removes the #XboxOne offline update process.\n\nhttp://t.co/5myAoT8Uq0": 0, "RT @KazHiraiCEO: Microsoft has released a guide on how to use XBOX ONE voice commands. Heres an excerpt: http://t.co/dZedhXN2xS": 0, "How to Download and Install fonts To Microsoft Word!: http://t.co/6m8Dn0bgNu via @YouTube": 0, "RT @SigmaSystems: Business panel kicks off with a great group of speakers from the likes of @Microsoft @CenturyLink @Bell_Aliant #Evolve2013": 0, "Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL http://t.co/w6v9Df3loi": 0, "Win a One Microsoft Xbox One Day One Edition Console! from Bens Bargains http://t.co/uWL25k2UIB": 0, "Some Microsoft services now available, others still experiencing issues.": 0, "RT @prchovanec: Hundreds of Chinese workers protest new contracts following Microsoft Nokia deal http://t.co/L2bNTFRAu1": 0, "RT @cdnperf: PingdomAlert UP: Microsoft HTTP (http://t.co/PxSSuDMYm6) is UP again at 11/21/2013 11:15:08PM. Downtime: 3m.": 0, "Richmond Marketing Students Reach Finals of Global Competition http://t.co/xB7g5Bo3YA #BCED #RichmondBC #SD38 #Marketing @NFTE @Microsoft": 0, "\"@IJM: Watch out child pornography. @Google + @Microsoft just teamed up to fight you: http://t.co/32Gy1FzLRf @CNN\"": 0, "Google's sly response to Microsoft's Scroogle swag - TechRadar UK  http://t.co/WGdX4R1bFp": 0, "I wonder how much $$$ this advertising all over #NYC is costing #Microsoft for #XboxOne lol looks sick tho": 0, "Techno Update: Microsoft brings rich node.js support to Visual Studio http://t.co/jfuqUmkizJ Courtesy of http://t.co/pEVlDDw7TU": 0, "RT @owen_omalley: Congratulations to Jitendra Pandey and Eric Hanson as new Apache Hive committers. Eric is Microsoft's first Hive committe": 0, "The #Soldiers from #Ryse on #XBOXONE  are in the building in #Nyc  #Microsoft http://t.co/EuWmmKE8t6": 0, "And so the next generation of gaming has begun, shame I couldn't get my hands on a #XboxOne tonight. @xboxuk @majornelson @Xbox @Microsoft": 0, "http://t.co/lBSYrp692Z, other Microsoft sites hit by service disruption http://t.co/KSxTJPRDba": 0, "Microsoft Azure cloud, Xbox One website go TITSUP worldwide http://t.co/1gMz4L1zED": 0, "Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your editing, debu... http://t.co/nD5zp4ObxI": 0, "Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your editing, debu... http://t.co/JYtkAzWYh4": 0, "RT @ScreamingGraeme: Can't help but think that this @Microsoft anti-Google campaign is really going to backfire.": 0, "RT @fmanjoo: Google burn: Microsoft's latest venture comes as no surprise; competition in the wearables space is really heating up http://t": 0, "Xbox One White Unboxing Microsoft Employee Limited Edition Launch Team 2013: http://t.co/npGIJIOKd6 via @YouTube": 0, "http://t.co/IWbn5vFCr2, other Microsoft sites hit by service disruption http://t.co/2SrWmKWC0R": 0, "Gud luck wth ur session.RT @alexanderb: Sessions annouced for the MS Project Conference http://t.co/3yDPP41R0Y #msproject #projectonline": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/FIzgcSyAHL": 0, "Literally BREAKING now: Microsoft Azure, Xbox One website go TITSUP (webmaster@theregister.co.uk (Jack Clark)/The... http://t.co/IVNPhAC6ZJ": 0, "RT @jimhejl: Microsofts Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services": 0, "http://t.co/S76RKXvxdW, other Microsoft sites hit by service disruption http://t.co/R02MB946L4 via @CNET": 0, "http://t.co/2jK1YC3keB, other Microsoft sites hit by service disruption:  http://t.co/U83ZXA3MQC #Technology, #Tech": 0, "Dear Internet Explorer, Why do you consistently suck so bad? Just curious. Love, Bridgit66 #IT #Microsoft #frustration #technology": 0, "fuck sony, marry nintendo, kill microsoft": 0, "Oprah: Old Racists 'Just Have to Die' to Further Racial Progress http://t.co/XASjp25b4Y via http://t.co/hdZI6v6ii9 #uspolitics": 0, "techcrunch: With Tinder 3.0, Tinder enters the friend zone - http://t.co/EaTZj5dxr5 #technews via http://t.co/EvmIlaxnxL": 0, "Help UCLA game design students in learning how to use feedback from players, use this link: http://t.co/qd3L7U3mpg #Win8 #FunApps": 0, "Gates chokes up saying goodbye to Ballmer at Microsoft shareholders' meeting - Puget Sound Business Journal http://t.co/6gXCuSbais": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/bdQ11kMbjv": 0, "XBONE = XBOX ONE. HA. THAT'S FUNNY, Nice one Microsoft. #10yearsofthis": 0, "Enter to #win a Microsoft Surface Tablet!\nhttp://t.co/RTqTkolq2d": 0, "RT @kristen_lanae: How childish of you Sony, especially after that genuinely nice message from Microsoft on your launch day :( http://t.co/": 0, "Yet again @Microsoft's fucked up security process strikes. Enter pin they text only to be told to sign in online to confirm. #timewasters": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/Pb0sYiSTIl": 0, "Blip: Google's sly response to Microsoft's Scroogle swag : http://t.co/a0ssbOvJe6": 0, "Many Microsoft online services appear to be down http://t.co/jm1BE0xtgc via @zite": 0, "Microsoft Sells Google-Bashing Mugs, T-Shirts on its Website http://t.co/M0nXxbCQI3 http://t.co/qaPxF54NVS": 0, "RT @KazHiraiCEO: Microsoft say that the XBOX ONE is not designed to be used vertically. Or horizontally. Or diagonally. Or at all.": 0, "Looks like I'm getting an xbox one at midnight. I love you Microsoft :*": 0, "Larson-Green Elaborates on Microsoft's Reorg, Devices Strategy http://t.co/YzxMI6Rbvm": 0, "Everyone is being sent home, all of Microsoft is without internet.": 0, "Many Microsoft online services appear to be down for some, including http://t.co/4JDu6zY9ub,... http://t.co/Bb7MdJqUsU": 0, "RT @DashingD3js: #Geo #DataViz #GovernmentData &gt;&gt; Geo-Data Visualization of Government Data Sources http://t.co/fp0apYp12K": 0, "Seattles top entrepreneurs&amp;engineers compete at @Microsoft Open Government Hackathon Dec 6&amp;7. Sign up to win $5k - http://t.co/tym91GwjLG": 0, "In pictures: Microsoft takes over Times Square for the Xbox One launch http://t.co/5dzjW6qlSw http://t.co/N5jErjknbX": 0, "When Office dies, what will Microsoft replace it with? http://t.co/Xs2a0MRYnp": 0, "RT @Parrandabogota: Pangea Group specializes in providing consulting and implementation  Microsoft tool sets and applications. http://t.co/": 0, "@37signals Make an infographic bashing @Microsoft? I am perf for this job! Full thing here: http://t.co/ipB2sSn2ph #workcanwait #getitdone": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/4Bkj0p86ZS": 0, "@JCLVolsrule39 so you got the day one patch with no problems huh? one of the lucky ones. microsoft already had a outage today": 0, "#Microsoft #News: \"Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch\" http://t.co/AhFgWZqpJ8": 0, "RT @MicrosoftStore: Tonight is the night! Stop by a Microsoft store to celebrate the midnight launch of #XboxOne. http://t.co/Bflas3nSQu": 0, "Microsofts devices boss hints at wearables and Windows consolidation #dbpreads http://t.co/Wae17Uhplb": 0, "RT @kroonwijk: Why are @WindowsAzure and @Office365 not tweeting status updates on #microsoft #windows #azure problems?": 0, "Cramer: Is Street wrong about Microsoft chief?: With MSFT shares up 38% ytd, is the Street's disdain for Steve... http://t.co/zYygY76ozI": 0, "LOL SONY please take my money. Microsoft can rot in hell.": 0, "@Sade_Agoon bro walahi u trippin te whole xbox crew is stayin wit microsoft u officially a opp lol": 0, "Funny jokes &amp; pics: new image http://t.co/UFnlRL4EUp #funny via http://t.co/fnTDKnNbKt": 0, "New on Ebay Microsoft Xbox One (Latest Model)- Day One Edition 500 GB Black Console http://t.co/Aylzh50793 http://t.co/uLPKDx86j5": 0, "A San Francisco startup takes aim at Microsoft's $20B cash cow http://t.co/HGKJv7Shi3": 0, "RT @EricLigman: Windows Application Compatibility List for IT Professionals: http://t.co/ffl41hbYFT #MSPartner #Windows": 0, "Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your e... http://t.co/ecX7ym4BBX arstechnica": 0, "Whoever stole my copy of Microsoft Office, you're dead.\n\nYou have my Word!": 0, "@CenturyLink , @TELUS, @Bell_Aliant and @Microsoft speaking about how they personalize business services for the enterprise @SigmaEvolve": 0, "RT @Microsoft: Have a great weekend playing #XboxOne, everyone! http://t.co/53SLjZCuLm": 0, "Had a DNS error today where no one could connect to Microsoft Outlook. I feel kinda bad for fixing it. Seems more a feature than a bug. :P": 0, "\"Mobility is the new normal\" #microsoft #CHI": 0, "Photo: #xboxone #xbox #microsoft #games #keychain #iphone5 #instapic #instagram #iphoneography (at The... http://t.co/shj8xVhOXX": 0, "Microsoft's Azure #Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services http://t.co/mxxrY29NjT": 0, "RT @isatismktg: Google puts down Microsoft for selling 'Scroogled' merchandise http://t.co/6kkV6Was4i #marketing": 0, "RT @Anon_Leejuhn: Microsoft's Xbox Live goes down ahead of Xbox One launch http://t.co/mjL5s8p56w": 0, "New on Ebay MICROSOFT XBOX ONE XBOX 1 PRE ORDER  SHIPS ON RELEASE 11/22 BNIB FACTORY SEALED http://t.co/zBZtCrJdsJ http://t.co/IKwv8T7ZgF": 0, "#Xbox One Joins #PS4 With High Repairability Score: iFixit ripped into #Microsoft's #Xbox One to find a high l... http://t.co/SEqvbgGOPP": 0, "Microsoft bets on interactive TV http://t.co/s0uH3RfxkI $MSFT": 0, "#App #Tech Microsofts Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services (Alex...  http://t.co/KV1B2hsMDp": 0, "Some Microsoft employees received this beauty... http://t.co/17FroBVvK4": 0, "Xbox One: Due to the Zombie Flu your employee will not be able to fulfill the scheduled commitment he has with you. http://t.co/QlV3AdNvfV": 0, "http://t.co/HOBlavZChu, other Microsoft sites hit by service disruption": 0, "RT @IJM: Watch out child pornography. @Google + @Microsoft just teamed up to fight you: http://t.co/bRXCdGNrUy @CNN": 0, "If you guys are interested in a student/faculty discount for a Microsoft Surface let me know!": 0, "@MoDroJoJo I've had the OG &amp; 360. Don't play games really at all anymore, but I favor Microsoft": 0, "Surfing Nosara: Good Morning From Guiones!\n\nToday the surf in Guiones wa... http://t.co/6gGrvdbI3w via http://t.co/mn3EFmuNyP": 0, "Microsoft Certification Road Road http://t.co/lTPEwTCzso": 0, "#UK#news Xbox One Launches In Xmas Battle With PS4: Microsoft's first console since 2005 is released just ahea... http://t.co/mFQqUhWZuv": 0, "http://t.co/lQFkXdT5VH, other Microsoft sites hit by service disruption - CNET http://t.co/ebwqv3mmhx": 0, "Early demand for Xbox One rivals that of PlayStation 4 - USA TODAY http://t.co/RnIX5WRyEj": 0, "Congratulations to @Microsoft and @Xbox @xboxuk for the UK launch of the #XboxOne": 0, "Microsoft updates SkyDrive for iOS with camera backup and more http://t.co/p5UEkewr1k": 0, "Cramer: Is Street wrong about Microsoft chief? http://t.co/7k0Nq2kU64": 0, "RT @SubProxy: Software patent reform just died in the House, thanks to IBM and Microsoft http://t.co/KCcwXkPVIH": 0, "Hot Deal ends today! You can get Microsoft Office Live For Dummies for just $4.00 (a 83% savings!) at TripleClicks. http://t.co/MKpZ9si0aw": 0, "@TaleSpun @Levit0 @ImCAntonio If Microsoft were in the position to do it they totally would": 0, "http://t.co/kVTyxixT4k, other Microsoft sites hit by service disruption: Error message indicates that the Azure... http://t.co/WNx9RIlnLB": 0, "#technews: Blip: Google's sly response to Microsoft's Scroogle swag http://t.co/1VPxc5P4bG": 0, "Completely unnecessary and it shows a total lack of respect.Microsoft at least showed some.https://t.co/xnDXqVjZz5": 0, "Caving in a buying battlefield 4. Figure why not switch between ghosts and bf4 #xboxone #microsoft": 0, "Google snipes back at Microsoft Scroogled store with wearables snark http://t.co/s4lbN6ebhx": 0, "@Lozia couldn't care less. Screw Microsoft &amp; their NSA backdoors.": 0, "RT @Kotaku: Microsoft's Xbox One launch event sure seems...interesting. http://t.co/NzVaAmExaR": 0, "Hey guys we wont be playing on the xbox one for a while becuase the microsoft network is down.": 0, "http://t.co/1VtA7TXvGw, other Microsoft sites hit by service disruption http://t.co/lJ6H769Ykc": 0, "http://t.co/88lF8LnGAR. Software patent reform just died in the House, thanks to IBM and #Microsoft  #Rockstar #patentTrolls #NPE": 0, "Lies all of them! http://t.co/vTRwBwGeWp": 0, "Had to buy a play and charge kit because the Xbox One isn't packed with one. Fuck you, Microsoft.": 0, "Microsoft Research Connections Blog - Site Home - MSDN Blogs http://t.co/Mc6nbiIhqP": 0, "Xbox One is trending, but it is a \"sponsored\" trending. Which means Microsoft paid for it. Sony didn't 1 week ago. It was genuine hype.": 0, "Microsoft's Xbox Live goes down ahead of Xbox One launch: Several gamers across the net are reporting in with ... http://t.co/cUj68KlzhZ": 0, "RT @jordansissel: Windows 8.1 now requires a Microsoft account; in 8 it was optional :/": 0, "RT @EverythingMS: Microsoft's devices boss hints at wearables and Windows consolidation http://t.co/JpTeMhJDFY": 0, "Xbox Is a Test for the One Microsoft Strategy - Businessweek: IBNLiveXbox Is a Test for the One Microsoft Stra... http://t.co/Z7RhWt0igR": 0, "Microsoft Bringing Message Encryption To Office 365 In Early 2014 http://t.co/U1x3sBOjLz": 0, "BING, MICROSOFT WORD, COPY/ PASTE, I DONT EVEN CARE ANYMORE.": 0, "Google On Microsofts Scroogled Clothes: Competition In Wearables Really Heating Up http://t.co/OdfOChKGgD": 0, "@Kotaku on PS4 launch Microsoft congratulate Sony.......and this is their offering? Not cool": 0, "#Investing  Cramer: Is Street wrong about Microsoft chief?: With MSFT shares up 38% ytd, is the Street's disd... http://t.co/h5k3o6101N": 0, "\"Microsoft counterfeits seized in UK raids\" http://t.co/qZGqRFIa5e": 0, "http://t.co/ZhDGn7t8r3, other Microsoft sites hit by service disruption  CNET http://t.co/k3GPj1NDo5": 0, "!!!! @IJM: Watch out child pornography. @Google + @Microsoft just teamed up to fight you: http://t.co/8bgV6qvl3G @CNN": 0, "Microsofts Xbox One goes on sale around the world http://t.co/wIePfsLibc": 0, "woohoo! nslookup http://t.co/oIlAhlEoY6 returns results now!": 0, "Well folk 5 hours to go and Microsoft New Xbox One could be at your door step!! My team going to have http://t.co/I73lfTvDpQ": 0, "@killercadet you'll have to stick with the flimsy Microsoft one for the Xbox though =/ Or use Kinect =O": 0, "Microsoft moments is out! http://t.co/u79yftSspi": 0, "Windows Application Compatibility List for IT Professionals: http://t.co/ffl41hbYFT #MSPartner #Windows": 0, "A line outside the Microsoft store. There really is a first for everything.": 0, "RT @unthschelpdesk: Student email is experiencing issues due to Microsoft outage.  Updates will be provided when available. Thanks for your": 0, "@stevegoodman @hyc_symas really? I thought Microsoft never recommends anything that isn't Microsoft! They created their own LB for...": 0, "RT @backwardsit: We need 1GBPS Net CSA appoints Microsofts Adrienne Hall to board: The CSA has appointed Adr... http://t.co/ZtVFaRCUU3 #gi": 0, "#Investing  Cramer: Is Street wrong about Microsoft chief?: With MSFT shares up 38% ytd, is the Street's disd... http://t.co/Ws55YnBNj9": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/wC3aIN7JrK": 0, "RT @alexwilliams: Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL: Looks like the llama may not get off so easil... http://": 0, "I can make grown men cry. #xboxone #Microsoft #microsoftstore @ Microsoft retail store http://t.co/VxMysKL9dC": 0, "@Newegg @Microsoft @Xbox Wish I was with Newegg. #DayOneEdition does not exist in Newegg's warehouse. Hated to do it, but I cancelled.": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch: Cinema BlendMicro... http://t.co/phee7w6x3s": 0, "Someone really should bin off the marketing team down at Redmond. #microsoft": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch: Microsoft's Azure... http://t.co/plaxikee70": 0, "@outlawhearts the 360 was a far better console as far as online and services went so I think microsoft kinda have a head start": 0, "@DannyYOLO @Polygon this is across all of microsoft services not just xbox.  DDOS possibly.": 0, "#Xbox One Joins #PS4 With High Repairability Score: iFixit ripped into #Microsoft's #Xbox One to find a high l... http://t.co/tg5lIXBZIb": 0, "I don't have Microsoft PowerPoint. ": 0, "Microsoft's Surface slips into some new accessories http://t.co/ImJ7WRLU8p #Microsoft #Surface": 0, "Because just shorty before the system is to drop Microsoft just pulled the instructions on offline system updates: http://t.co/m6gWsPqVoU": 0, "Is Ballmer Leaving? Few Signs at Shareholder Meeting -  By Shira Ovide CONNECT Microsoft CEO... http://t.co/iCafZ5rBba\n #HarvardUniversity": 0, "Microsoft starts delivering Kinect for Windows v2 Developer Preview kits http://t.co/XdJG5qGNqG by @epro": 0, "Amazing Deals on Microsoft Xbox 360 Slim 250GB in Game Consoles http://t.co/iVClf9mBYP": 0, "New on Ebay BRAND NEW Microsoft XBOX ONE 1 Standard Edition Console Gamestop Black Kinect http://t.co/agq6y5KEPd http://t.co/laytOuCHJp": 0, "Just in: new updates on my #keynote #apple #skydrive #microsoft and #twitter are all cool and very useful...": 0, "@anisateladia @moziz36 \"@sickipediabot: Whoever stole my copy of Microsoft Office, you're dead.\n\nYou have my Word!\" #BermudaTriangle": 0, "Google Spanks Microsofts Recent Scroogled Antics\n\nhttp://t.co/dm7pltYbg5": 0, "I favorited a @YouTube video http://t.co/ptIIPLJ5PG Microsoft Office 2013 Activation [NOVEMBER 2013]": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/BPzjbSVqGF #quotes via http://t.co/gxktWhKfbI": 0, "RT @NeowinFeed: Microsoft DNS servers down; Hotmail, http://t.co/1vcGRwpcbQ, others down  #microsoft #dns": 0, "Bill Gates Gets Teary-Eyed Talking About Search for New Microsoft CEO http://t.co/Y7rpyvkC64 #entrepreneur #Dubai #KSA #Startup": 0, "Wow. Microsoft stepping up against Google: http://t.co/g0crXwXd5i thanks @jesuisjuju": 0, "gsyncit (3.8.44): gSyncit is a Microsoft Outlook add-in that allows for the synchronization o... http://t.co/Qcbaa4kZbR #chocolatey #new": 0, "It's made by #Microsoft you fools! #XboxOneLaunch": 0, "@Microsoft @Xbox  no... I'm waiting for my delivery from Microsoft...@UPS shipping was 5 days ago... tracking, it shipped today. #bullshit": 0, "@936ROB Internet went down for all Microsoft services": 0, "MICROSOFT OFFICE VISIO HAS STOPPED WORKING...........................\nBUT I HAVE TO CONTINUE MY WORK AAAAAAAAAAAAAAAAAAA\n*RELAYOUTING*": 0, "@XBLNintendHo oh so Microsoft didn't sign an agreement with the NSA to give them back door access to anything and everything Microsoft? Fool": 0, "\"The best way for Microsoft to enter a new era is with a new leader who will accelerate change.\" http://t.co/sSPjO9is0r": 0, "RT @KazHiraiCEO: To compete with Microsoft, PS4 has adopted lots of XBOX 360s most famous features including party chat and the hardware f": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/UVyvrMaVbd": 0, "Microsoft Xbox 8 GB Black Console (NTSC) - With 2 different controller: $69.95 (0 Bids) End Date: Thursday... http://t.co/2K5JhPfhsB": 0, "RT @marcbernardin: An Xbox One TV spot just activated the voice control on my Xbox One. Dear @Microsoft: You gotta figure this shit out. Ca": 0, "Playstation crushed Microsoft with the Next-Gen": 0, "RT @Microsoft: The party is in full swing in New York. Are you going to an @Xbox One launch event tonight? http://t.co/UqdXoM4cKM": 0, "@Microsoft Surface Tablet + 9 Easy Pay + #TodaysShowstopper = Best Gift Ever! &gt; http://t.co/MxR6FFeBUv http://t.co/OVpOMDB8SK": 0, "Who said Times New Roman was boring? \nhttp://t.co/IKodq6fhS3\n\n#typography @microsoft @mbutterick http://t.co/PZDoRHr1dg": 0, "RT @RunShannonRun1: I can't wait for the new Microsoft store to KILL the apple store.": 0, "Software patent reform just died in the House, thanks to IBM and Microsoft http://t.co/KCcwXkPVIH": 0, "News from CNET - http://t.co/hgP328n5Uj, other Microsoft sites hit by service disruption: Error message in... http://t.co/n54Pe8vq1m - RT": 0, "Officially here! The Xbox One is out! Welcome to the next generation! #XboxOne #XboxOneLaunch #Microsoft": 0, "RT @Abz_Tally: Lol did Microsoft just abandon everyone on 360?, I can't even connect to basic live...": 0, "Insanely Funny Shit: new image http://t.co/HZkmKTGO5v via http://t.co/fnTDKnNbKt #funny http://t.co/jQ6KnCslfZ": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/r5vEQjx9UJ": 0, "#xboxone #microsoft #xbox #one http://t.co/CE39loUX90": 0, "#Investing  Cramer: Is Street wrong about Microsoft chief?: With MSFT shares up 38% ytd, is the Street's disd... http://t.co/kyhwPRDiuC": 0, "Google On Microsofts Scroogled Clothes: Competition In Wearables Really Heating Up http://t.co/t02VbVKjQq #Latest #Trends": 0, "@IAmIndigoWizard @Polygon this isn't just xbox.co...its across all microsoft  services.  might be an attack.": 0, "http://t.co/5GBzfvaBYQ, other Microsoft sites hit by service disruption - CNET http://t.co/v20389p0Qe #digitalagency": 0, "RT @jpankow: Xbox Ones at the company store! Huge line of Microsoft employees ready to pic theirs up! #XboxOne http://t.co/Tn6S31B24a": 0, "Google puts down Microsoft for selling Scroogled merchandise http://t.co/MkOsAKTws7": 0, "RT @LoliBanger: fuck sony, marry nintendo, kill microsoft": 0, "Active Directory Maintenance in Microsoft Server 2012R2 is the party track of the moment on the mp3 player. #partyanimal": 0, "New on Ebay Brand New Microsoft Xbox One Console Bundle Day One Edition FREE SHIPPING http://t.co/JaKl59AN0K http://t.co/u2764DOw9k": 0, "RT @fsf: \"Software patent reform dies in the House, thanks to IBM &amp; Microsoft\" \nOne more reason to abolish software patents. https://t.co/K": 0, "Microsoft is going all out tonight in NYC": 0, "@Gartuzzi no problem. I think it was an issue with their new login with a Microsoft account protocols. Still not working in that browser": 0, "RT @ActivisionChu: Officially here! The Xbox One is out! Welcome to the next generation! #XboxOne #XboxOneLaunch #Microsoft": 0, "Even though Microsoft most likely did it for good PR, you could have done the same for equal results. I mean jeez. Lost some respect.": 0, "RT @dstorey: Want to know about Internet Explorer on #XboxOne? Read the developer guide http://t.co/eDfmmNwu49": 0, "What's going on SF? Microsoft hopes Xbox One finally puts it on the media map http://t.co/M5P3RMEG4b": 0, "The Verge: Xbox One teardown hints at why Microsoft's console is so big. http://t.co/yFSHkm7hgW": 0, "RT @dailynation: #Nokia hands over headquarters to #Microsoft http://t.co/OuYukG5DtN": 0, "You guys always ask how I get GCs etc, this is one of the many ways to get FREE monies  http://t.co/P1uD99Ynmq": 0, "Before I read a paper from someone one on Microsoft word I have to align both margins, change font to size 12, and the font fact to Calbri.": 0, "@LastMinContinue @markmacd well, all last gen was 1080p for microsoft and they didn't rubbed it in sony's face": 0, "Microsoft's answer to Siri | Cortana - http://t.co/94PK6Fncmu": 0, "@gamespot lol Microsoft is so bad... How can you not launch with such support in this day and age?? Bunch of idiots up there.": 0, "Former Lotus and Microsoft exec Ray Ozzie hiring for new start-up, Cocomo - via @bostondotcom http://t.co/hzwv0afSH7": 0, "Xbox One launch: Live news and updates as Microsoft's next-gen console is released around the #newslocker http://t.co/nydMSA6Xvl": 0, "@gvwilson: \"The real problem with mobile devices is that they are composed of Satan.\" http://t.co/jkCW0Htjoo [ LOL ]": 0, "Watch out child pornography. @Google + @Microsoft just teamed up to fight you: http://t.co/zJeaojGvRG @CNN": 0, "AT-OMW Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your editin... http://t.co/blTP7Pq6Ry": 0, "Dear Microsoft word, I'm pretty sure I spelled my name correctly.": 0, "@jsb3808 apparently it's like a party for people who work at Microsoft, it's at the Microsoft store idk where that is though": 0, "RT @demisbellot: Software patent reform just died in the House, thanks to IBM and Microsoft \nhttp://t.co/dMdIdfzFld": 0, "Google s sly response to Microsoft s Scroogle swag  TechRadar UK http://t.co/GSdhm5LBAz": 0, "I liked a @YouTube video http://t.co/0AnGLABzVQ Amazon's pre-Black Friday sales, NCAA vs EA, and Microsoft's EOU - Hard News 11/21/13": 0, "@theregister: Literally BREAKING now: Microsoft Azure, http://t.co/GFmY8clCgd go titsup http://t.co/dnKMDXsMkp yet again": 0, "Microsoft News: Microsoft to take over Nokia's iconic headquarters next year - Economic Times http://t.co/ZSHi5aT1BM": 0, "Rick Hawn: All weighed in and ready to go for tomorrow night! http://t.co/1CMzakDHW0 via http://t.co/ABUaH7ML8Q #mma": 0, "RT @EZXboxVIP: Countdown to midnight! We've got the 4 reasons to choose #XboxOne. 4th reason: #XboxOne is built for the future: http://t.co": 0, "Happy #XboxOne  launch night everybody! Enjoy your new consoles people! #jealous @OXMUK @xboxuk @Microsoft @GAMEdigital @GraingerGames": 0, "@Newegg mine is waiting to be delivered tomorrow! @Microsoft @Xbox": 0, "Tyson Chandler: [EXCLUSIVE GIVEAWAY] Visit for a chan... http://t.co/oEaVwhxCEB #olympics via http://t.co/jDAwU42y28": 0, "RT @netgradetech: Looks like @Microsoft is down right now, wow! None of their #DNS servers are responding. #Outlook #Hotmail #Office365 aff": 0, "Microsoft's Anti-Google Mug Is A Little Desperate http://t.co/42aI3dbojj via @HuffPostTech": 0, "I think if @Bell_Mobility and @Microsoft @Xbox created a company, they'd be the most hated company in the world #AllYourMoneyAreBelongToUs": 0, "Blip: Google's sly response to Microsoft's Scroogle swag http://t.co/lU2QXl3E5b": 0, "RT @katieleefish: perks of being a @microsoft nanny : playing the new Xbox One before it's released! @davidvkimball http://t.co/cHi9XOMzN8": 0, "http://t.co/zzlnXzaXA0, other Microsoft sites hit by service disruption: Error message indicates that the Azure... http://t.co/lBHFO2AJIE": 0, "RT @GameZoneOnline: Microsoft's advice for #XboxOne owners without internet connection: 'Take it to a friends house or something' http://t.": 0, "That merchandise Microsoft is currently selling is literally junk (?): I.E. Keep calm while we can't update our standards from 1998": 0, "Microsoft Sells Google-Bashing Mugs, T-Shirts on its Website http://t.co/5JdEAplBph": 0, "RT @chanelwhale: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/l27kkc5jyp": 0, "http://t.co/7VCRtxSzpQ, other Microsoft sites hit by service disruption: Error message indicates that the Azure... http://t.co/hUCIK97wkN": 0, "RT @WinBetaDotOrg: Microsoft's Surface slips into some new accessories http://t.co/OufFFoxjtb #Microsoft #Surface": 0, "Free #eBook: Introducing Windows 8.1 for IT Professionals http://t.co/CTI9q2IGVk #wp8 #windowsphone #microsoft #itpro": 0, "New on Ebay Microsoft Xbox One Day One Edition 500 GB Black Console http://t.co/711KvJ6IXq http://t.co/OVhZzI8QaO": 0, "Larson-Green Elaborates on Microsoft's Reorg, Devices Strategy http://t.co/ID7YYB8Gtt": 0, "RT @TheNextWeb: Many Microsoft online services appear to be down http://t.co/HRZ46AHoH4 by @epro": 0, "Microsoft's Surface slips into some new accessories http://t.co/OufFFoxjtb #Microsoft #Surface": 0, "My 1st article at Technology Spectator! Fun to recap Microsoft's messy Xbox One PR to an audience unfamiliar with it. http://t.co/gwYcX1UDGe": 0, "Ironic the Surface 2's biggest competitor will be Nokia Lumina 2520. #Microsoft #Windows #Nokia #Competition http://t.co/snOF7Ibokx": 0, "RT @ITBlogs: via @CITEworld Microsoft's devices boss hints at wearables and Windows consolidation http://t.co/UBLdN3oAAT": 0, "@Kotaku lol as if MS is classy... didn't you notice the anti google and anti Apple ads that Microsoft been doing ? it's all part of business": 0, "So Fifa ultimate team legends is only available on xbox. Well played,Microsoft well played.": 0, "RT @MinutePostTech: #TechNews Google's sly response to Microsoft's Scroogle swag via TechRadar UK http://t.co/bNNvUCVOUs": 0, "A lot of people believe Microsoft dns servers could be taken out with a vanilla ddos. I don't know what to say to that.": 0, "http://t.co/95TfTlWwRP, other Microsoft sites hit by service disruption: Error message indicat... http://t.co/s6oUeJFjdt @JoesPCandRepair": 0, "Microsoft Project Server 2013 Administrator's Guide http://t.co/7G6swpdLlu #PMOT #Project #PM": 0, "Microsoft starts selling Scroogled merchandise (Just stop, you are looking ridiculous http://t.co/8eTHC8zxFn": 0, "@pluralsight thats an awesome offer at just the right time for #biztalksummit http://t.co/GFwhX5Vnbc": 0, "Spanish #xboxone release event @Xbox_Spain #Microsoft @majornelson @HectorCalvarro Great event for a Great Console http://t.co/EH9fpyzSkW": 0, "RT @netgradetech: Our network monitoring systems are confirming the @Microsoft DNS outage is also affecting #XboxLive and #Azure.": 0, "Google: \"Microsoft's latest venture comes as no surprise; competition in the wearables space is really heating up.\" http://t.co/phCbuaksuT": 0, "word crashed again. really, microsoft?!": 0, "#technology #news http://t.co/cftyRFUWPp, other Microsoft sites hit by service disruption - CNET http://t.co/TpBwR9mqgs": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch http://t.co/bA6W1htbG5": 0, "RT @MicrosoftSB: Adding Digital Marketing Magic to a Creative Paper Cup Company http://t.co/IyhZ3vCooR via @BingAds #talkingbusiness": 0, "RT @mappingbabel: I'm sympathetic to outages, but for heavens sake Microsoft has a lot of these weirdo global fails http://t.co/vwvZ7TdB4o": 0, "RT @usatodaynews: Early demand for Xbox One rivals that of PlayStation 4 http://t.co/g8AnDRumFt": 0, "RT @KDezso: @asia_phan @justintaylor514 It'd be so much more fun if @avery_sykes_  was in our Microsoft class ": 0, "Microsofts Xbox One goes on sale around the world http://t.co/OtYva81AGd": 0, "Tonight: Microsoft inside @MetropolisatMet will host a Xbox One launch party! Details: http://t.co/RLflEMZnXf": 0, "Get Scroogled. How microsoft mocks google. http://t.co/yiMpzzfn3n": 0, "Both the Sony Playstation 4 and the Microsoft Xbox One are powered by @AMD APUs. Find out more: http://t.co/xEhj2vry0n": 0, "Dear Microsoft: Please provide me with no fewer than zero but no more than 15 xbox ones. Good? good.": 0, "Microsoft's devices boss hints at wearables and Windows consolidation http://t.co/XYHalHwUWL #tech #it": 0, "@JVB That game is the one hook microsoft really got me with. I love that series to hell and back. Dead Rising is the one game I never traded": 0, "Wireless Steel Series World of Warcraft MMORPG gaming mouse for Microsoft Windows PC and Apple Mac http://t.co/MEiZ0KcBOt": 0, "A few reasons to enter a #Microsoft Store on #BlackFriday: http://t.co/HxOWGEokaC": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services [Update: Back Up!] http://t.co/OjLixUTIUC #TC": 0, "I'm so gonna buy this Scroogled products by Microsoft. http://t.co/MibNtLryv1": 0, "#Cinma | Microsoft's Xbox Live goes down ahead of Xbox One launch http://t.co/GxJb0HizOR #Brands #TV #v": 0, "http://t.co/f50KLtf9qh: How to replace the Xbox One hard drive http://t.co/ozYmf0qgfi via http://t.co/EvmIlaxnxL #technews": 0, "One Microsoft Way: Microsoft brings rich node.js support to Visual Studio http://t.co/TWnuwXXEcQ": 0, "@cwug \"... we will be heading to the various Microsoft stores for the Xbox One launch around 9pm  Send us your pics!": 0, "Xbox One teardown reveals why Microsoft's console is so big http://t.co/BdBj7zO6BI": 0, "RT @HelenWalters: Microsoft, you can't burn Google with a WORD CLOUD. That makes you look like you know nothing about design I give up http": 0, "RT @TechnoBuffalo: Xbox One Unboxing: Microsofts Promise to Dominate Your Living Room\nhttp://t.co/AXdUBXKj1U http://t.co/VhpDee9PZD": 0, "http://t.co/z9EJYn1gPe, other Microsoft sites hit by service disruption": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch http://t.co/w4EMfzY91R": 0, "RT @JetReports: RT @murrayfife My Microsoft Dynamics AX Suggested Reading List - Any other suggestions? http://t.co/Hn7cOObbxW ... #axug #m": 0, "Microsoft wants to know what I'm doing at midnight. I'm part of @Greenspeak s heist.": 0, "@julia_paleski don't forget Microsoft": 0, "@WIRED Google are watching you google are data miners what's wrong with Microsoft telling the truth wired?": 0, "RT @Yusufchauhdry: http://t.co/QwBsnbqvvo, other Microsoft sites hit by service disruption http://t.co/gcywD7pyzT": 0, "perks of being a @microsoft nanny : playing the new Xbox One before it's released! @davidvkimball http://t.co/cHi9XOMzN8": 0, "RT @chrismessina: http://t.co/Ut7jeTqRFj http://t.co/XFYwbvhXF4 http://t.co/0sye724QBy #downforeveryone": 0, "RT @WhatABoshtet: \"@LastMinContinue: So I think Sony misspelt \"Congratulations on your launch Microsoft.\" http://t.co/66tWDeVMEW\" Wow.": 0, "Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your editing, debu... http://t.co/LA09LGMhdD": 0, "Those who mind dont matte...: new image http://t.co/KNWxsfAmHW via http://t.co/gxktWhKfbI #quotes": 0, "If you want change your Xbox Live gamertag ask your friends to report it as offensive. Microsoft will force you to change it free of charge": 0, "@Xbox @Microsoft @LAAutoShow  cool nice job !!!!!!!!!!": 0, "Xbox Is a Test for the One Microsoft Strategy Businessweek 22 marks a new phase in the relationship. The... http://t.co/KK3iGMdEfk": 0, "Microsofts New Employee-Relations Initiative: Dump Stack Ranking http://t.co/sE4MBWyqOP": 0, "http://t.co/XIJWBQevyg, other Microsoft sites hit by service disruption http://t.co/J6mxYkTd52": 0, "RT @jcenters: Googles hot new product is a computer you can wear on your face. Microsofts new hot product is a shirt that makes fun of Go": 0, "Star News: Cramer: Is Street wrong about Microsoft chief? http://t.co/cBobWMWoAF": 0, "Microsoft starts selling anti-Google merchandise http://t.co/v2MxhMUkya": 0, "Add a YouTube video in Word 2013 - Are you creating a document where you talk about the cool YouTube video's... http://t.co/5MIQZx0ZVu": 0, "@davidciccone @Kotaku out the fact that Microsoft was actually classy last week": 0, "http://t.co/j7HkSYJyFw, other Microsoft sites hit by service disruption - CNET http://t.co/kqSjhvvx2M #innovation": 0, "@wepeeler was gonna go to the west farms Microsoft store.. But my car is out of commission.. So gotta wait til tmw morning": 0, "New on Ebay Microsoft Xbox One 1 Day one Edition 500 GB Black Console Launch Edition http://t.co/0o9jPN7KeI http://t.co/bs2FBjmm3g": 0, "Xbox One Launches In Xmas Battle With PS4 http://t.co/DSo3ZHJkV5 Microsoft's first console since 2005... http://t.co/ljNkj1YMAk": 0, "RT @bortzmeyer: #Microsoft #DNS service apparently up and running again. Too late, everyone migrated to Linux.": 0, "@Microsoft still no answers": 0, "Not impressed by Microsoft's new foray into negative marketing against Google.": 0, "Hope everyone is safe picking up their #XboxOne tonight #ps4 @Microsoft": 0, "@DesiSanchez @MLG @PlayStation no. I'm just a @PlayStation diehard. Nothing against @Microsoft or you": 0, "AWESOME! Watch out child pornography. Powerful @Google + @Microsoft just teamed up to fight you: http://t.co/x3bJLwzhZ9 @CNN via @ijm": 0, "RT @EverythingMS: Microsoft DNS servers down; Hotmail, http://t.co/MFZRzMbxy6, others down [Update: Resolved] http://t.co/FcfjkV2A2X": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/0t6dikjc70": 0, "http://t.co/zu1p18ZxOV, other Microsoft sites hit by service disruption   http://t.co/jCMhplX2Y4 http://t.co/7bQipudxED": 0, "Microsoft Posts Anti-Apple Windows Phone Videos of Questionable Taste [Update: Removed] http://t.co/OzX4dW2X30": 0, "YESSS heard this earlier on NPR! \"@IJM: Watch out child pornography. Google + Microsoft just teamed up to fight you: http://t.co/wvMDaTVEsc\"": 0, "'Keep Calm While We Steal Your Data': Microsoft takes shot at #Google. Learn how here: http://t.co/ACpeizyOJ3": 0, "Xbox One review http://t.co/0MnO9xo8qD": 0, "Are you on Windows XP? Time to come up with a migration plan ASAP as Microsoft drops all support for XP next April http://t.co/fihAzIlfnR": 0, "Too much fun/waste of time http://t.co/nBrmzulz2Y": 0, "@WaltFrench @charlesarthur Microsoft, however, makes sense. MICROcomputer SOFTware. Instagram means INSTAnt teleGRAM (although unrelated).": 0, "Wii U For First Party And Unique Experiences Like Zombiu And Ps4 For HD Cinematic Games. Microsoft Is An NSA Wet Dream But An Awful Game Mkr": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live ... - TechCrunch http://t.co/3o0Uh0YzFu #cloudcomputing": 0, "RT @WIRED: Microsoft, this just makes you look desperate. http://t.co/okNbQ0Mlca http://t.co/g1tMQzPQXP  I totally agree with this post!": 0, "I liked a @YouTube video http://t.co/sQZz4YzIp1 Insomniac's Sunset Overdrive Debut Trailer - E3 2013 Microsoft Conference": 0, "SICKKKK new XBOX get it now!!!\nhttp://t.co/yla3O1DWCG\n#Microsoft#windows#surfacepro#xboxone": 0, "One Direction Thinks the Paparazzi in the US Are Way Worse Than the UK http://t.co/2JT8sX15q1 via http://t.co/lZ21fxpl5d": 0, "[Pocket-lint] Microsoft's Xbox Live goes down ahead of Xbox One launch http://t.co/Le1Hr6mxZI": 0, "@serverbaba @australian Microsoft SkyDrive seems to be back now but still seeking an explanation. http://t.co/yWmw6595c7": 0, "http://t.co/q5zmSrAW1c, other Microsoft sites hit by service disruption http://t.co/jCqBlHtLLB": 0, "Top story: Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL  |   http://t.co/P1nOrqeJre, see more http://t.co/MqosMyWfhc": 0, "RT @KDezso: @asia_phan oh gosh, the things that happen in Microsoft ": 0, "http://t.co/61xnDs4RcB, other Microsoft sites hit by service disruption http://t.co/vT7GGcvJEN": 0, "Microsoft's Xbox One launch event sure seems...interesting. http://t.co/NzVaAmExaR": 0, "Will a \"Scroogled\" mug be on your holiday wish list this year? http://t.co/tJYbDE07Lc": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console (NTSC): $30.00 (0 Bids) End Date: Friday Nov-22-2013 16:07:08 PST... http://t.co/3MOoNT2pk1": 0, "Gizzi  Xbox One Kinect Cheat Sheet: New Gestures Explained: Microsofts newest salvo in the console wars fina... http://t.co/ogCRD2JB4s": 0, "Tech Update - http://t.co/2IRAKkvs6f, other Microsoft sites hit by service disruption: Error message indicates ... http://t.co/xkWXhjspaq": 0, "Do you remember Microsoft?": 0, "GAMERS! Join me tonight at the Microsoft Store in Lenox Mall for the XBOX ONE launch!!! Sounds by: me, http://t.co/Nw2iTiNmAn": 0, "Xbox one release night! #XboxOne #ma #Microsoft #aldanley http://t.co/VC12ExwGSY": 0, "Microsoft starts selling anti-Google merchandise http://t.co/NwCcr9EGs2\n #USA": 0, "Many Microsoft online services appear to be down http://t.co/NBgDRZXSkZ": 0, "\"Developer's Guide to Microsoft Enterprise Library, 2nd Edition\" the free PDF/EPub eBook (Greg Duncan) http://t.co/vt1YCYtFEu": 0, "Sony congratulates Microsoft on Xbox One launch http://t.co/lUZcEEBMtq": 0, "Microsoft Dissect and Explain New Party System http://t.co/CauRlBNynz  #xboxone": 0, "RT @slashdot: Microsoft Adds Node.js Support To Visual Studio http://t.co/LFh4RqGhRQ": 0, "Microsoft brings rich node.js support to Visual Studio \"Yay.\" http://t.co/SPiXK4Kzwx": 0, "Even though im getting a ps4 first. Still happy to see the xbox launch. Congrats, @Microsoft  #XboxOneLaunch": 0, "Fans Ask TV Cops: Cracking Up Cops | BROOKLYN NINE-NINE | FOX BROADCASTING http://t.co/ngX0qOxUU9 via http://t.co/tXjObGiDiU": 0, "Line started! (@ Microsoft Retail Store - @microsoftstore) [pic]: http://t.co/7RAztIbv6p": 0, "RT @WIRED: Microsoft, this just makes you look desperate. http://t.co/MfEfJbmjZh http://t.co/h4EV3MbkN2": 0, "So i gotta redownload Microsoft Word again and that takes about 1-2 Hours. FUUUUUUUUUUUUUUCK.": 0, "@Microsoft @Xbox You guys should hook me up with one! I've been cleaning your endcaps for a year &amp; keeping them functional!": 0, "RT @kurtsomerville: Massive Microsoft Office365 Outage - http://t.co/C30aWcXTwN DNS records have disappeared: Comments http://t.co/2m7X0x3S": 0, "RT @tajarz: http://t.co/RRSGLUkhld, other Microsoft sites hit by service disruption: Error message indicates that the Azure... http://t.co/": 0, "RT @followtheparka: How To Write A Paper:\n1. Open Microsoft Word\n2. Netflix": 0, "@jsb3808 my mom got the invitation to go up to Microsoft around 10": 0, "RT @jw: Tone deaf MSFT (#chumps) wants you to work at your kid's recital or on vacation: http://t.co/5MHLxAWJsh http://t.co/sJsMQsLU8L ht @": 0, "Microsoft's devices boss hints at wearables and Windows consolidation http://t.co/JpTeMhJDFY": 0, "RT @IJM: Watch out child pornography. @Google + @Microsoft just teamed up to fight you: http://t.co/zJeaojGvRG @CNN": 0, "@DtoidChris Microsoft had a bumpy ride, but I am glad to know that both systems are such a huge step forward.": 0, "\"Microsoft starts selling anti-Google merchandise\" http://t.co/B1hgwfV6xp #ItsON": 0, "RT @ZDNet: When Office dies, what will Microsoft replace it with? http://t.co/CY826uTRrg": 0, "RT @EverythingMS: Some Microsoft sites are currently down due to some DNS woes http://t.co/5EBXzqZqQE": 0, "SURF OR SCIENCE? Google execs' jetting may be partly paid by taxpayer: * Hate Google? Microsoft has some... http://t.co/WIx0wKuTaj": 0, "Microsoft xbox launch party, Dev, Royal Concept, and The Ruen Brothers performance tonight.": 0, "\"@MicrosoftStore: Tonight is the night! Stop by a Microsoft store to celebrate the midnight launch of #XboxOne. http://t.co/38KBP0S9im\"": 0, "RT @CNET: http://t.co/wp1LLkdrkf and other Microsoft sites are hit by a service disruption http://t.co/XXGRhnKDFH": 0, "@Microsoft during something time critical so I had run to my other pc.. last license I'll be buying, ever.": 0, "RT @ISOutsource: Reports that Microsoft services unavailable for some: #Office365 #Azure #Outlook.com #XboxLive and more. Read more: http:/": 0, "Microsoft appears to be experiencing intermittent CDN issues affecting all customers. JavaScript features and page loading times affected.": 0, "Microsoft DNS servers down; Hotmail, http://t.co/hEz9JvDp7o, others down [Update: Resolved] - Neowin... (http://t.co/oKnTmFJuQR)": 0, "http://t.co/u2I2IsxDf0, other Microsoft sites hit by service disruption: Error message indicates that the Azure... http://t.co/HvE3kUme17": 0, "We've got new consoles from Microsoft, Sony and Nintendo. \"Next-gen\" is suddenly \"now\". http://t.co/ua5qdOZCnU http://t.co/TZgrqHhEQV": 0, "Viral on Google News: Xbox One: Exploring its synergies in the Microsoft ecosystem - PCWorld (blog) http://t.co/tDq8KZhSje": 0, "The white Xbox One that was auctioned off for charity by Microsoft. http://t.co/CwBylL7uST": 0, "I can absolutely see myself going PS4/Wii U this generation and not looking back. Prove me wrong, Microsoft ; )": 0, "\"@WhatABoshtet: \"@LastMinContinue: So I think Sony misspelt \"Congratulations on your launch Microsoft.\" http://t.co/qazJ31SoCP\" Wow.\" damn.": 0, "Ironic the Surface 2's biggest competitor will be Nokia Lumina 2520. #Microsoft #Windows #Nokia #Competition http://t.co/G3BvjHklm8": 0, "I liked a @YouTube video from @itsalledits http://t.co/npGIJIOKd6 Xbox One White Unboxing Microsoft Employee Limited Edition Launch": 0, "Doar de evoBLACK FRIDAY poti cumpara Mouse Microsoft Wireless Bluetooth Sculpt Comfort cu 31% reducere: http://t.co/dXTR9Li9yI": 0, "They have a \"little person\" zombie out in the crowds for the #XboxOne &amp; Dead Rising 3... Oh Microsoft...": 0, "Microsoft's Xbox Live goes down ahead of Xbox One launch http://t.co/mjL5s8p56w": 0, "RT @Halo4_: Turn out @Manabyte hates microsoft because they wouldnt hire him after he got fired by IGN! Too funny xD": 0, "RT @TechCrunch: Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services http://t.co/G1U9DMNn8k by  ...": 0, "@Microsoft @Xbox I wish I could. I love Xbox One, but can't get one until February. And as far as I know there are no events in Indiana.": 0, "@gatesfoundation \nfor bill gates someone send to my mail from Microsoft lottery and he says im the winner but what happen is true": 0, "The Young Turks: Wanna Hangout With Cenk and Ana? http://t.co/M8k6QVREb9 via http://t.co/hdZI6v6ii9 #uspolitics http://t.co/DZcpYnGMtA": 0, "@asia_phan oh gosh, the things that happen in Microsoft ": 0, "New on Ebay NEW Microsoft XBOX ONE DAY 1 EDITION Console PREORDER FREE SHIPPING ON 11/22 http://t.co/Wme6iktZwG http://t.co/OywGHrdVnu": 0, "RT @teamhazmat: One more hour at work then head home to pack up the stream and head to the Microsoft store to stream the Xbox... http://t.c": 0, "Microsoft's \"Scroogled\" Google-bashing gear proves popular with its competitor's employees http://t.co/iRmUSOdLiS http://t.co/kg5bxbIJmG": 0, "#Microsoft #News: \"Microsoft preps mobile app for Office 365 admins - PCWorld\" http://t.co/Hsf6FSyi0c": 0, "MMA Rankings: Miles Alexander McDonald http://t.co/89U0n2R87r via http://t.co/ABUaH7ML8Q #mma": 0, "cant wait to get my xbox one.\n\ncant wait to have every other microsoft product and service out of my life.\n\none day, right?": 0, "RT @Pt3tux: http://t.co/88lF8LnGAR. Software patent reform just died in the House, thanks to IBM and #Microsoft  #Rockstar #patentTrolls #N": 0, "Reid, Dems Deploy 'Nuclear Option' on Senate Filibusters http://t.co/4IakcAAqWA via http://t.co/hdZI6v6ii9 #uspolitics": 0, "RT @CNET: Microsoft breathes new fire into the life of Scroogled with a line of products http://t.co/icQcMlqLyd http://t.co/BT9cQCIgAp": 0, "I could get behind this  Charles Schwab: Bill Gates Needs to Return to Microsoft http://t.co/U7VI9rwQkj": 0, "Presented without further comment #xboxone #xbox1 #GameStop #Microsoft #ryse #deadrising3 #forza5 #lauchdat... https://t.co/zVnwrEX3oE": 0, "Survivor: Ponderosa is BACK! See what happened when the first castaway ar... http://t.co/Vqjosa2irW via http://t.co/tXjObGiDiU": 0, "So... this would be a terrible time for Microsoft services such as Xbox Live to go down... oops.": 0, "Blip: Google's sly response to Microsoft's Scroogle swag: Like all big companies, its fair to assume Google ha... http://t.co/f2rW3IklxX": 0, "#XboxOne MS cloud services are back after DNS issue I'm on office 365 and azure TC with Microsoft tomorrow should be fun.": 0, "I liked a @YouTube video http://t.co/I0wRjD6kLg Sony Congratulates Microsoft on Xbox One Launch": 0, "Microsoft should of stopped making systems and just made the Xbox One an entertainment system only. It would get so much less hate": 0, "Free #eBook: Introducing Windows Server 2012 R2 http://t.co/CuCatdGXVL #wp8 #windowsphone #microsoft #itpro": 0, "@TTUVAPOR It sounds like you are using the wrong Microsoft Account to sign in with ^PS": 0, "Microsoft office 2008 for Mac for sale. Includes box/disk/ 1-2 activation codes. $50 or best offer!! http://t.co/TEb67lEPkI": 0, "http://t.co/GckxKVA5EX, other Microsoft sites hit by service disruption http://t.co/WzLNsp1DkJ": 0, "http://t.co/Fkr1QgekX8, other Microsoft sites hit by service disruption http://t.co/4UtdW7YkpF": 0, "RT @HackDefendr: These Anti-Google T-Shirts Just Make Microsoft Look Pathetic - http://t.co/BIqrQR2m7c #Wired #Threatpost": 0, "RT @cdespinosa: FYI PowerPoint was initially shipped for the Mac by two Apple II marketing executives in 1987, prior to Microsofts acquisi": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/DBOvdmMu36": 0, "#Milwaukee Bucks wireless optical laptop mouse for Microsoft Windows PC and Mac http://t.co/2Y810AI7Ef": 0, "Microsoft's 3D printing app for Windows 8.1 eases you into object creation with an extensive library. No CAD needed  http://t.co/47yjvzmVvG": 0, "@Polygon Microsoft as a whole is experiencing DNS issues": 0, "RT @jessas: Massive @Office365 outage, affecting all users globally. DNS records for http://t.co/fT85cXuZQj and http://t.co/8a2XlMVSeo are ": 0, "RT @NerdistDotCom: Get your #XboxOne fix before picking yours up tonight and explore @Microsoft w/ @MattBennett &amp; the latest #NERDYJOBS htt": 0, "RT @BRYAN_M_COX: GAMERS! Join me tonight at the Microsoft Store in Lenox Mall for the XBOX ONE launch!!! Sounds by: me, http://t.co/Nw2iTi": 0, "RT @pluralsight: Don't miss out on this deal! We're giving out free access to our Whats New in BizTalk Server 2013 course! Get it ==&gt; http": 0, "Test4pass microsoft laboratory diagnosis 70-270 final sullens questions answers: SFEJyZe": 0, "Bing y Xbox son clave para Microsoft, dice Steve Ballmer http://t.co/4ImXQU82Ja": 0, "Microsoft online services appear back to normal after brief outage http://t.co/PWezMaADte #bpulse #tech": 0, "Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your editing, debugging, and profiling ne...": 0, "Not unreasonable to speculate that part of Microsoft's Azure's Cloud services could be hosted in an affected area.": 0, "Microsoft brings rich node.js support to Visual Studio (Peter Bright/Ars: One Microsoft Way) http://t.co/PDwDSnzGw2": 0, "Got money, gift card, beaches, Microsoft points, a tv, xbox one for my birthday. And getting a car in the next 2 weeks. ": 0, "Reincarnation at Nokia Planning the next bounceback http://t.co/dpm8bfsA3r": 0, "@CC_LF365 lol thats what i said...that happened on the xbox 360 when they 1st came out..microsoft sent me a new boy took a couple weeks doe": 0, "Microsoft sells shirts and mugs slamming Google on privacy:  http://t.co/OGxgat9Luv http://t.co/32wbGhzgFV": 0, "http://t.co/EOqgqAHHXg, other Microsoft sites hit by service disruption: Error message indicates that the Azure... http://t.co/N0TDbV4SHx": 0, "Google gets data center security; Apple views users as the customer; Microsoft does neither, but wants to be Apple. Discuss.": 0, "Giggle Palooza: Get your Giggle on at: Giggle Palooza http://t.co/g9LWaHvfUc via http://t.co/fnTDKnNbKt #funny": 0, "[Techradar] Blip: Google's sly response to Microsoft's Scroogle swag http://t.co/GNcKOrlCOu": 0, "Microsoft demos Siri-like semantic voice control for Xbox One - The Verge http://t.co/kzry0k0Ue8": 0, "http://t.co/vvWn2mLDFl, other Microsoft sites hit by service disruption http://t.co/JlKwRWlvoX": 0, "RT @ahmetmehmetosma: #http download microsoft com http://t.co/ZSG5PodwQM": 0, "Check out Microsoft Xbox 360 Core System 20 GB Matte White Console (NTSC) with 2 games on @eBay http://t.co/J4logisZx8": 0, "Its here #Xbox1 #bestco$puterever #microsoft http://t.co/h0t33uePrq": 0, "http://t.co/YEmB0THVC9, other Microsoft sites hit by service disruption": 0, "#Project #Manager #Microsoft #Dynamics #ERP / #CRM #Quality #Assurance #Job in #NJ (#Voorhees, NJ) https://t.co/V5at6mJklT": 0, "RT @msftsecurity: Avoid telephone tech support phone #scams from those claiming to be #MSFT with these tips. RT &amp; Share: http://t.co/x0sMyU": 0, "One more hour at work then head home to pack up the stream and head to the Microsoft store to stream the Xbox... http://t.co/iGo7E1W3Px": 0, "Here's where you can get an #Xbox One in the UK without preordering: GameSpot: 300 branches of specialist reta... http://t.co/N2sXgUzWbp": 0, "Instagram is out for @Microsoft Windows Phone.": 0, "RT @easyDNS: Microsoft DNS outage a textbook case for using hot swappable nameservers http://t.co/XeBddo6wMQ #xbox #microsoft #dns": 0, "Help UCLA game design students in learning how to use feedback from players, use this link: http://t.co/7TNfafCKim #Win8 #FunApps": 0, "RT @AustenAllred: Patent reform in the House just died, thanks to IBM and Microsoft http://t.co/Ns0mQ9YoYr": 0, "Marc Benioff To Steve Ballmer: Yes, You're 'An Emblem Of An Old Era' And It's Time To Leave Microsoft (MSFT) - ... http://t.co/cbXLmDlZ11": 0, "These Anti-Google T-Shirts Just Make Microsoft Look Pathetic: The Microsoft Store's new... http://t.co/xtJvvDt4Go #technology #music": 0, "I'm a Sony fan, but come on. That's harsh, especially since Microsoft congratulated you.": 0, "http://t.co/xro8hrCwuQ, other Microsoft sites hit by service disruption http://t.co/UVBlVblDGG": 0, "Microsoft's devices boss hints at wearables and Windows consolidation: Julie Larson-Green led Windows for the ... http://t.co/BDmUnHYavY": 0, "I got my Xbox One controller tonight, just looking at it, good job Microsoft, good job": 0, "11/21/13: White House Press Briefing http://t.co/lA8lK9ZF9x #uspolitics via http://t.co/hdZI6v6ii9": 0, "@luredharry my brother works with Microsoft showing them at like best buy and future shop so they have him two": 0, "In line for #XBOX ONE at the microsoft store. 4 hours til the party, 6 till we can dash home.": 0, "Next Gen is now current gen, congrats to #Sony #PS4 #Microsoft #XboxOne many years of exciting development and awesome games ahead...": 0, "@jherskowitz @tejasmi5 remember when Microsoft had a super popular radio platform, in WMP, 7 or so years ago?": 0, "#IT #WEB2 Literally BREAKING now: Microsoft Azure cloud, http://t.co/V3eK0gpARU go TITSUP": 0, "RT @SquawkStreet: Microsoft bets on interactive TV http://t.co/s0uH3RfxkI $MSFT": 0, "@MicrosoftStore Tonight is the night! Stop by a Microsoft store to celebrate the midnight launch of #XboxOne. http://t.co/dAWWy4Kaga": 0, "http://t.co/wHfhZBmeDW, other Microsoft sites hit by service disruption http://t.co/QB3QvRXQcM": 0, "VIP Microsoft launch! We finally gots our microsoftstore. Yay! @ Microsoft Store http://t.co/Ny5zdxZYy2": 0, "Reports that @Microsoft services unavailable for some: #Office365 #Azure #Outlook.com #XboxLive... http://t.co/TfJPtS9wgS (@isoutsoruce)": 0, "@msonenote @Office365 You guys are buttering me up, I'm gunna end up having to switch to all Microsoft services at this rate!": 0, "CNet: http://t.co/Ak9uE48XHU, other Microsoft sites hit by service disruption http://t.co/i0iPsjyLYc": 0, "Today is the start of a new generation. The Next Generation. The XBOX ONE. #XboxOne #XboxOn #Microsoft @Xbox": 0, "Tonight is the night! Stop by a Microsoft store to celebrate the midnight launch of #XboxOne. http://t.co/Bflas3nSQu": 0, "Microsoft is currently experiencing what appears to be a global outage http://t.co/Ycor0zc26I": 0, "Microsoft Dissect and Explain New Party System http://t.co/lRURrgHt9M  #xboxone": 0, "@Microsoft - Watch \"7 Xbox One's Broken Disc Drive Compilation\" on YouTube - https://t.co/GQf8iFgjOB": 0, "@yixingdaily Lol nice!!\nI could use one as well, school is killing me Dx lol\nI want a weave tbh or the Microsoft surface 2 lol\nIdek tbh": 0, "Literally BREAKING now: Microsoft Azure, Xbox One website go TITSUP (webmaster@theregister.co.uk (Jack Clark)/The... http://t.co/EOdTw1IyPb": 0, "RT @dinabass: Xbox Is a Test for the One Microsoft Strategy http://t.co/al90SGAAJ2 my story for @BW": 0, "New on Ebay Microsoft Xbox One Day One Edition 500 GB Black Console http://t.co/7SRe0Two7j http://t.co/Wm9L96fS34": 0, "RT @dominictarason: Microsoft: Google are evil and insidious and spying on you and we're totally on your side. Buy our device with an alway": 0, "Bah, Humbug! Microsoft Wants You to Stock Up on Anti-Google Merchandise  http://t.co/ldtmntbdGi via @DashBurst": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/IdKZ4BXt2c": 0, "@PlayStation Damn... Microsoft congratulates you guys and you diss them? I mean... I bought a PS4, but still... http://t.co/Ky1EFDFSub": 0, "Macy's: Psstwere playing paparazzi! Check out these behind-the-scenes ... http://t.co/CDMTdLTjpD via http://t.co/qiQqBbpNxe": 0, "Although I'm on the fence about purchasing the 1st gen version, I'm looking forward to @Microsoft 's @XboxOne release tomorrow.": 0, "G+: Massive Microsoft Office365 Outage - http://t.co/dkrSQqJXE5 DNS records have disappeared | Hacker News https://t.co/LcXawTDAv4": 0, "RT @fayerwayer: Bing y Xbox son clave para Microsoft, dice Steve Ballmer http://t.co/4ImXQU82Ja": 0, "If Nintendo made an OS for my PC, it would beat Microsoft in my eyes... Console and game wise though Nintendo win hands down": 0, "Can somethingbe cacky then? RT @monkbent: I think that I have a pretty good vocabulary, and then @gruber drops cack http://t.co/AA9yLFR9YL": 0, "This is weird. \"Microsoft pulls option for offline Xbox One update http://t.co/Yl3kT6ywYe\"": 0, "@asia_phan @justintaylor514 It'd be so much more fun if @avery_sykes_  was in our Microsoft class ": 0, "The ONE thing that bugs me in Arrow is the Microsoft Windows product placement in every single episode. #Arrow": 0, "RT @LastMinContinue: So I think Sony misspelt \"Congratulations on your launch Microsoft.\" http://t.co/jps2kB87il": 0, "Microsoft bing is selling anti google cups &amp; shirts that say keep calm and carry on while we steal your data at http://t.co/RZnn2S2l6z": 0, "Cheers Microsoft !!! \nMany Microsoft online services appear to be down for some, including http://t.co/gCy85bBRTc, ": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/Hs1fUhrXcp #quotes via http://t.co/gxktWhKfbI http://t.co/LD1VWiqX29": 0, "RT @adage: Will a \"Scroogled\" mug be on your holiday wish list this year? http://t.co/tJYbDE07Lc": 0, "RT @ChilledChaos: Hanging out in the Back of the Microsoft store if you're here early!": 0, "Microsoft online services appear back to normal after brief outage http://t.co/XXGRhnKDFH": 0, "New on Ebay Microsoft Xbox One Day One Edition 500 GB Black Console - LAUNCH DAY CONSOLE http://t.co/0jfQkrxPWS http://t.co/iVAcqp9DT8": 0, "UCLA game design students improve their design chops use this link to download the Win8 Store app: http://t.co/QgnIa1DtSI #Win8 #FunApps": 0, "I'm Sorry Microsoft, The Xbox One Is Sadly Not the Way Forward. The ps4 Looks a lot Better @Xbox (Just My Opinion)": 0, "News from Wiseguyapps : Blip: Google's sly response to Microsoft's Scroogle swag - http://t.co/u1zksCf9zw http://t.co/wyHPtLz8nE": 0, "Check out this crazy Autodance on JDTV  https://t.co/96jNKw7alp #JustDance2014": 0, "now Im pissed with Microsoft...chances of getting X1 tomorrow is slim": 0, "RT @ThisTim: EXCELlent @sickipediabot: Whoever stole my copy of Microsoft Office, you're dead.\n\nYou have my Word! #SorryNotSorry": 0, "RT @LiquidPT: Microsoft DNS is suffering a global outage. Awesome. First Xboxes are for sale in New Zealand in 15 min (I think)": 0, "RT @glynmoody: Microsoft In Talks To Buy Shoutcast And Winamp From AOL - http://t.co/HzUmtp58MX llamas facing fate worse than death...": 0, "RT @HuffPostTech: Microsoft's anti-Google merchandise feels just a little bit desperate (http://t.co/qxmdC6ChEr) http://t.co/1CFKGviCKc": 0, "MMA Rankings: Kendrick Latchman http://t.co/R37UrQDifY via http://t.co/ABUaH7ML8Q #mma http://t.co/KpAPihsexL": 0, "Microsoft's clearly hurting... http://t.co/Uzhao46MU3": 0, "Brazil may require Google and Microsoft to build datacenters in the country as a fall out of US privacy infringement http://t.co/zWK3Vje9U4": 0, "ReadWrite: How the wunderkind framework Node.js grew up, from the perspe... http://t.co/R2E5tDjeHT via http://t.co/EvmIlaxnxL": 0, "@affyalwayslaffy woke up late presentation in 20min, ran out of gas goin down 4th, wrote a paper&amp; Microsoft crashed before I saved it #myday": 0, "RT @Newegg: RT if you're team #XboxOne tomorrow! http://t.co/R2P0iMfH4N @Microsoft @Xbox": 0, "$MSFT - IBM and Microsoft Just Gutted This Sensible Patent Bill -&gt; http://t.co/3w2YEB51CP #stock #stocks #MSFT": 0, "RT @SecurityHumor: Best #autocorrect today: \"Microsoft Intimate Explorer.\"": 0, "Turn out @Manabyte hates microsoft because they wouldnt hire him after he got fired by IGN! Too funny xD": 0, "RT @UrbanITSol: Yesterday we gave you some information about a function within Windows 8.  \nBut, are you still a Windows 7 user,... http://": 0, "Xbox Is a Test for the One Microsoft Strategy http://t.co/al90SGAAJ2 my story for @BW": 0, "Yoo you gamers join me tonight at the Microsoft store in Dadeland Mall for the launch of the XBOX ONE!! I'll be spinning the tunes!! ": 0, "[ArsTechnica] Microsoft brings rich node.js support to Visual Studio: Open source plugin fills almost all your... http://t.co/dbCMvHuOZN": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/VxZu6wkMnd #mobile": 0, "Microsoft's brilliant (and hilarious) marketing strategy, just in time for the holidays http://t.co/53m6CV6Ukh #Scroogled #PMOT": 0, "The microsoft certifications whereas mcp entitlement professionals: nhwnP": 0, "@XboxSupport can I get microsoft office on the Xbox one?": 0, "New on Ebay Microsoft Xbox One 500 GB Black Console - Release Day Shipping! http://t.co/HxKT0tvLh5 http://t.co/2KV3DVQzQs": 0, "http://t.co/bgpzmVTbOv, other Microsoft sites hit by service disruption": 0, "@ammeep @shanselman I need to stop visiting Microsoft. Last time it was SSL certificates, this time its DNS. Everything breaks when I'm here": 0, "RT @djenuff: Tonight !!!! Microsoft at Walt Whitman Mall. 160 Walt Whitman Road\nHuntington Station, NY 11746 #heavyhitters http://t.co/0YHw": 0, "@Xbox none because @PlayStation is better than anything Microsoft produces #nothreat": 0, "RT @theregister: Literally BREAKING now: Microsoft Azure, http://t.co/nCarg0Wzgc go titsup: DNS problems render cloud service http://t.co/": 0, "@jesseschell @daraobriain Dont be stupid, everyone knows those without a soul have Apple devices not Microsoft": 0, "#FeelingSoo #QuoteAddiction #XipherRevolver #FunnyFacts_ #JustDamnQuottell me how to get microsoft office word for free": 0, "[video] White Xbox One Exclusive to Microsoft Video unboxing - http://t.co/rjCKtFhj9C": 0, "@TheRedTwinng Well ya, that sucks. But you have to understand these are the most advance systems Microsoft and Sony has had to make.": 0, "RT @frontburnr: Kinect can't see through my clothes? Your loss Kinect http://t.co/gK7QI9koqC": 0, "RT @wesmaniam: Microsoft should put their Azure status page on AWS http://t.co/3uAr42qIl2": 0, "http://t.co/acQguNbGH4, other Microsoft sites hit by service disruption: Error message indicates that the... http://t.co/6ujx1A9o7T #tcot": 0, "@DrPizza Sorry, Ive become sick and cant go to the Microsoft Store in the Galleria. =/": 0, "#nowplaying #video Microsoft aims high with Xbox One http://t.co/WVlwUgjmgu http://t.co/HSYt7x2lf4 #socialmedia": 0, "@SimplyDonal Ah, Microsoft bodge job. Xbox One.1": 0, "Yes, #work_can_wait A brilliant response to #Microsoft campaign of #office365 \nWork can wait .. live you life :) http://t.co/VrFhQwYR2t": 0, "Vendor lock-in via high school study http://t.co/dlBPdHU1IR": 0, "This two-screen thing I'm doing with Microsoft word is gloriously helpful": 0, "RT @CircuitScream: Great to see @Microsoft putting focus back on developers lately; this is like the good 'ol days when .NET 2.0 was releas": 0, "Microsoft's Xbox Live goes down ahead of Xbox One launch http://t.co/EtnvpkRskY #XboxOne #xboxlive": 0, "@GLPearl @nonprofitorgs You've been quoted in my #Storify story \"Kiwi Nonprofits Get Social with Microsoft\" http://t.co/dJhOEVRBpz": 0, "Back to spying and giving your info out. RT @CNET: Microsoft online services appear back to normal after brief outage http://t.co/PBz0OGoT7Y": 0, "RT @PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits": 0, "RT @CarlosAriz13: Just in: new updates on my #keynote #apple #skydrive #microsoft and #twitter are all cool and very useful...": 0, "Jean Coutu Group chooses Microsoft Dynamics for Retail to streamline operations http://t.co/sVOOQZpZlu": 0, "You can win FREE XBOX LIVE 12 Month Gold Membership with @MsPointFree!  http://t.co/aopNkZiFEG": 0, "Microsoft Employee Unboxes Limited-Edition White Xbox One http://t.co/6Qj5kIx9hM": 0, "RT @JimGreenT4A: It was fun to answer some of the same questions posed to other T4A Board Members. http://t.co/zJs3lMQrUu . Next Tues: John": 0, "Went to work on my paper like 15 minutes ago, I have yet to open microsoft word...": 0, "RT @sethjuarez: Holee crap - almost all of Microsoft is down because of DNS issues: http://t.co/9LJNJB2U55 O.M.GEE": 0, "CNET -  http://t.co/2tjBSL5h4e, other Microsoft sites hit by service disruption http://t.co/w9hHWJ9FMe": 0, "@Microsoft  I can't enjoy because I didn't preorder microsoft send me one please or I will cry": 0, "RT @AndroidAuth: Google comments on Microsoft's Anti-Google merchandise -- and the response is nothing short of awesome http://t.co/hdU4C2L": 0, "@GAMEdigital @IGNUK JUST GOT MY XBOX ONE!! Thank you GAME &amp; Microsoft :D #ignxboxonelaunchcomp http://t.co/HX94oNFMzb": 0, "http://t.co/IsC3fKEqrI, other Microsoft sites hit by service disruption http://t.co/98VFcsButk #kaminfo #infosec": 0, "RT @IamRehman: Microsoft is going hard on Google with Scroogled Merchandise #SocialMedia http://t.co/IfqxOI4W8u": 0, "Funny Wall Photos: new image http://t.co/RSYYRPmOxO #funny via http://t.co/fnTDKnNbKt": 0, "@Waddell_Z3 Hello there, please see how other WP user resolved this issue: http://t.co/O8NGkuWC5I": 0}