{"Microsoft merges the mobile division of Nokia with its Windows Phone. The first phone king dissappears. http://t.co/Ht1QZZwzhT": 0, "CyanogenMod confirms new hardware partner, but wont tell us who it is yet  http://t.co/GVbp9NGppk Microsoft.. ": 0, "WIN a Microsoft Surface Tablet Weekly Giveaway Enter NOW====&gt;http://t.co/TV8nc3lZjs": 0, "#Xbox #Playstation For One Tired Microsoft Employee, Xbox One Launched Three Years Ago http://t.co/4bymFTcMT5": 0, "Microsoft to take over Nokia HQ in 2014 after deal  http://t.co/av1UDvtvgR": 0, "RT @PitmanHolborn: Free download - 21 top Excel tips for super PAs - as seen at @officeshow ! http://t.co/4hHFCtS74w": 0, "@DJsantos24 Xbox One uses proprietary technology that only Microsoft can produce and manufacture. More details here: http://t.co/NKOjhMEdRm": 0, "RT @UXAdditives: Get our new #free #app for #windows8 ==&gt; Cycling World http://t.co/CHyOu6F9am #cycling #facebook  http://t.co/q1yAntudsX": 0, "NEWS US  : Xbox One teardown hints at why Microsoft's console is so big - The Verge: The VergeXbox One teardow... http://t.co/QKhgwJbMEG": 0, "Which PC should I buy to run a small business?: Matthew looks after IT for a parent-run nursery and is looking... http://t.co/1pKJyiMUh4": 0, "Microsoft gave me $0.88. lmao": 0, "Cheap shot RT @wpcentral: Microsoft wants you to show your distain for Google  starts selling Scroogled products http://t.co/WTxiAsvqPj": 0, "For One Tired Microsoft Employee, Xbox One Launched Three Years Ago:  \"At 3:00 AM PST members of the Xbox tea... http://t.co/3Fd3LmHlOr": 0, "The military training anent microsoft care software: ZatIhYn": 0, "Somebody needs to help me download Microsoft word.": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox: ... http://t.co/LabZUupUXT": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/qznoiMfedB": 0, "#followback Microsoft is taking over Nokia's Espoo headquarters:  Nokia is moving out of its current headquarters in Espoo, Fin...  #news": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/a3ILp21GMN": 0, "RT @geoffreyfowler: Hunting for stocking stuffers? How about an anti-Google mug made by Microsoft: http://t.co/4AHXpvpWHm (So, so 2013) htt": 0, "Microsoft patents \"Touch-Aware Skin\" - wants to make tablets aware of how you hold them http://t.co/wa0xbyLO4q": 0, "#awesome @mspnp taking #opensource Enterprise Library to next level: now accepting community pull requests http://t.co/eR5yvVW3Xb": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, ... http://t.co/pmyrAc5c99": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow in the coming weeks http://t.co/kwxPMyJH15": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/EpKr7pxnNz by @epro": 0, "Microsoft Research Connections Blog - Site Home - MSDN Blogs http://t.co/iAa6FQWeky": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/dEFJ8ixsHo": 0, "RT @XB1OwnersClub: Xbox One teardown hints at why Microsoft's console is so big http://t.co/12YzQcTtCS": 0, "RT @wpcentral: Microsoft updates Mail, Calendar and People apps for Windows 8.1 http://t.co/Wlz8ozmAiH": 0, "\"Microsoft updates SkyDrive for iOS, Facebook\" http://t.co/K1annFkvpd": 0, "What do you think of Microsoft's latest attack on Google? All's fair in love and war... and business? http://t.co/P9VL1F3sXb": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, ... http://t.co/QGQrbB6hof": 0, "RT @CNET: http://t.co/wp1LLkdrkf and other Microsoft sites are hit by a service disruption http://t.co/XXGRhnKDFH": 0, "You Are My Life: new image http://t.co/2PfEWQd02D via http://t.co/gxktWhKfbI #quotes": 0, "The microsoft certifications seeing that mcp undergirding professionals: bLHxBy": 0, "RT @kristen_lanae: How childish of you Sony, especially after that genuinely nice message from Microsoft on your launch day :( http://t.co/": 0, "RT @TrenchPressNews: Microsoft Denies New Xbox One Can See Your Genitals http://t.co/b7fhlc7KJI": 0, "Xbox One teardown hints at why Microsoft's console is so big - The Verge: The VergeXbox One teardown hints at ... http://t.co/plsDkaPvoo": 0, "Keep Calm While We Steal Your Data: Microsoft Takes Shot At Google #Seattle http://t.co/yaTI7ECyFK": 0, "How to Deploy Windows 7 See: ***  http://t.co/SNhnuO4tFv": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/hIJMbw1fF5": 0, "RT @gamespot: Microsoft states that the Kinect for the #XboxOne cannot see through clothing. http://t.co/dD8kYev4jK": 0, "@kobunheat Actually sucks, or like anti Microsoft so it's gotta' suck?": 0, "Hey @DublinAltNet \"@gblock Microsoft announce a node IDE plugin for Visual Studio! http://t.co/8d9TBtq3bD.\" \nSee you @nodejsdublin Nov 28th?": 0, "RT @EconomicTimes: #Microsoft to take over Nokia's iconic HQ next year http://t.co/zbv6aVGug3": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, ... http://t.co/aDNA0aNXwl": 0, "Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/GRnDfZ5TPs #Win8 #FunApps": 0, "She always grabs people's ears http://t.co/fD1BoXlwNw": 0, "#Microsoft sell nice mug with sentence \" (#Chrome logo) Keep calm while we steal your data\" -&gt; http://t.co/4NEhQdK3QL": 0, "Xbox One teardown hints at why Microsoft's console is so big http://t.co/3IQ0vq6QWX via @verge": 0, "Question associative algebra skills against microsoft barodynamics cashiering: zInPEX": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/pNFdzha1Fs": 0, "Looking for the perfect holiday gift?\nMicrosoft is giving away a 32 GB Surface RT\nEnds 12/31... http://t.co/kq1Ich0sN2": 0, "Microsoft: YOU, there. PAY US to wear our anti-Google advert merch:  http://t.co/HlBNDufHvK #Technology, #Tech": 0, "RT @tomwarren: If you need the day off to play Xbox One tomorrow, Microsoft is offering up doctors notes http://t.co/e1nI6DC3Zu": 0, "Microsoft Brings Automatic Camera Backup To SkyDrive On iOS http://t.co/SUCigALL4R": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/JHWG0L8iL3": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow in the coming weeks http://t.co/hPstXb3CIJ #ne...": 0, "Video: Adam Orth on dealing with the internet mob: Former Microsoft Game Studios creative director Adam Orth o... http://t.co/g8fcduO92u": 0, "@BRCarter89 350 vs 430 atm but price will drop. Both will get Fifa/COD/GTA etc. Depends if you'd rather have Microsoft or Sonys exclusives": 0, "RT @ProfJeffJarvis: Hopefully when Elop is CEO, Microsoft will finally refocus around Zune, and also launch the Kin 2.": 0, "@scarequotes @katekiefer @aarron If I was Google, I'd get back at Microsoft with a line of mugs and t-shirts that say \"Bung\".": 0, "Microsoft's Scroogle Campaign Against Google Moves Forward: little campaign against and its search and email p... http://t.co/yRlGDYYhUO": 0, "Bret Taylor says Quip's working on customized views/skins for word processing for different verticals. V. cool idea http://t.co/txrqMmzzE8": 0, "RT @chanelwhale: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/l27kkc5jyp": 0, "@belltrans has FT HR Admin Asst.opening #Vegas. $11-$12/hour. Microsoft Word/Excel exp (cont) http://t.co/idnX18I7ym": 0, "Microsofts SkyDrive iOS app gets auto camera backup, viewing support for Office and OneNot... http://t.co/Ae8rss40CB http://t.co/OeKoiTq48a": 0, "Huffinton Post - Microsoft's Anti-Google Mug Is A Little Desperate http://t.co/fHbiHll5mQ": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/069RVGxAUm": 0, "Node.js Tools for Visual Studio - Free, open source VS plugin from Microsoft http://t.co/YBiYxJJJiG": 0, "More brand-on-brand violence, just in time for the holidays. Watch out, you could be next.\n#mktgeff @jackrecht\nhttp://t.co/4qcxpmwrEi": 0, "RT @phonescoop: SkyDrive for iOS Updated with Auto Camera Uploads: Microsoft today made an updated version of its SkyDrive app... http://t.": 0, "Microsoft Stocks Up on Anti-Google Merchandise: Microsoft badly wants consumers to turn on Google. Now, the so... http://t.co/k2PHVqe38i": 0, "Microsoft #XboxOne launch at shoptysons Tonight W/ Jaden": 0, "Just bought the Microsoft Surface Pro 2 with the cutest blue keyboard thing. #techmaven": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/KTsKRhEmjo #Tech": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/T2CDvCqUze by @drpizza": 0, "@stephanie42090 Oh! Well then I am always adorable! I'll take lots of selfies for you tonight while waiting in line at the Microsoft Store!": 0, "RT @davidcaolo: More immature, 6th-grade schoolyard name-calling from Microsoft. Embarrassing. http://t.co/QyQMSjO3iV": 0, "RT @MSFTenterprise: Profile: @msservices \"firms up\" @MattressFirm's #retail infrastructure upgrade w/ @MSFTDynamics http://t.co/6pQ9hGqPwJ": 0, "#Quip, The #Mobile-First #WordProcessing App, Now Imports From #MicrosoftWord, Google Drive, Evernote, Dropbox http://t.co/uDeTSO8Cbq": 0, "RT @katekiefer: now that's just embarrassing. RT @aarron: The very definition of bad taste &gt; Microsoft's Scroogled store. http://t.co/c3zbd": 0, "Microsoft's Azure Cloud Computing System Hits Bumps, Taking Down Xbox Live And Other Services http://t.co/T2ttudMg9u by @alex": 0, "Microsoft's Anti-Google Mug Is A Little Desperate http://t.co/aKTBR3FoL9": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/Cn23PuPKtW": 0, "Microsoft's Scroogle Campaign Against Google Moves Forward http://t.co/ZcHS79Bmlz": 0, " http://t.co/PyNGmsu9xN 74 Www Google Search | Google, Microsoft modify Internet searches to exclude more child pornography ... | get a fr": 0, "Can Microsoft Project monitor employee calendars and push back estimates every time somebody schedules a meeting?": 0, "First @Microsoft, now @Yahoo... @SafeLogic_Walt blogs about the inexcusable lack of server-to-server encryption. http://t.co/JQEfQBUq89": 0, "This convention remains in use by several operating systems today, including microsoft windows.": 0, "RT @VirginGaming: Microsoft employees received exclusive white Xbox One consoles and controllers. \n\nThoughts?\n\n. http://t.co/cF1yrr83JH": 0, "Welcome to the drone club, Windows users! Quadrocopter maker partners with Microsoft -  http://t.co/bXYeMvJ4Ls": 0, "@theShoppingChan @Microsoft please help me fill her life with joy #christmasjoy #todaysshowstopper": 0, "RT @cceresola: Sysinternals learning ressources. Great stuff !\nhttp://t.co/fu0N0HGKXI\n#windows": 0, "Learning Microsoft Access 2010 - Training Course [Download]: Learning Microsoft Access 2010 - Training Course ... http://t.co/wVeh5fvgQK": 0, "Nice feature add: Microsoft Brings Automatic Camera Backup To @SkyDrive On iOS http://t.co/kZNArZbU1u via @alex #underrated #cloud": 0, "HURRY! Win a FREE Microsoft Surface Tablet! via Coupons and Freebies Mom - HURRY! Win a FREE ... http://t.co/TCwuzyxTWp": 0, "RT @yourCTO: #Software patent reform just died in the House, thanks to #IBM and #Microsoft http://t.co/IxxgrCKSxQ": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, E via @josephjett #tech http://t.co/Iw0yf8rqag": 0, "via @CITEworld Microsoft's devices boss hints at wearables and Windows consolidation http://t.co/UBLdN3oAAT": 0, "Apple spends way less than Microsoft on R&amp;D http://t.co/ZzaBYNbxRj": 0, "RT @buckwoody: At Microsoft Research building - robots hooked to Kinect can talk to you and give directions. Amazing place. http://t.co/vVo": 0, "Look At The Anti-Google T-Shirts And Coffee Mugs Microsoft Just Started Selling http://t.co/cZeWiSf0KW": 0, "RT @NeoGAFMid90s: All the best games are on PC, so why doesn't Microsoft just make a game console?": 0, "RT @WhatABoshtet: \"@LastMinContinue: So I think Sony misspelt \"Congratulations on your launch Microsoft.\" http://t.co/66tWDeVMEW\" Wow.": 0, "Windows 8.2 Microsoft Will Release Update Early Next Year http://t.co/ZJ11J8wg8j": 0, "Microsoft Brings Automatic Camera Backup To SkyDrive On iOS | TechCrunch http://t.co/Nu68khR1tq": 0, "Microsoft adds camera backup feature to SkyDrive iOS app - Neowin http://t.co/e27bQFjtXa via @neowinfeed": 0, "Microsoft pulls option for offline Xbox One update\n\n+info\nhttp://t.co/GuIv9YvnJ6": 0, "RT @Microsoft: Join Microsoft employees supporting http://t.co/q5EpGlOmqJ + other youth causes #GivingHero: http://t.co/F7bYg2GPkP http://t": 0, "Nintendo Is About To Release A Triple Threat To Sony And Microsoft! Link Between Worlds, Party Tour and 3D World Will Be Releasing Tomorrow!": 0, "Microsoft starts selling anti-Google merchandise http://t.co/slHHcVza2T": 0, "Microsoft Sells Google-Bashing Mugs, T-Shirts on its Website http://t.co/PXuTR4LldU": 0, "Which PC should I buy to run a small business? http://t.co/uUwOc6fIkP": 0, "RT @sandkatt: All of Microsoft's fist party Xbone games feature microtransactions. Absolutely disgusting, and shameful.": 0, "My last tweet is Googles response to the Microsoft Scroogled merchandise.": 0, "Microsoft offers a customizable Xbox One doctor's note http://t.co/66e52Q55hA": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/4z3CuItwEh": 0, "RT @LastMinContinue: So I think Sony misspelt \"Congratulations on your launch Microsoft.\" http://t.co/jps2kB87il": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/jq5AQqAffc": 0, "FYI ppl. Your Xbox One Is Black, But Microsoft Employees Get This Gorgeous White One - News - http://t.co/cNCaPNmfYP: http://t.co/CBGbuhQ9UE": 0, "Xerox Parc, Smalltalk-80, &amp; Postscript had a major influence, e.g. WYSIWYG, DTP, Mice, Apple Macintosh, Microsoft Office, IDEs, Networks.": 0, "http://t.co/wp1LLkdrkf and other Microsoft sites are hit by a service disruption http://t.co/XXGRhnKDFH": 0, "Anyone super awesome with Microsoft Excel? :/": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/NRh725owqQ": 0, "RT @wossy: Had a great first day as Exec Producer for Microsoft yesterday. Thanks #liftlondon http://t.co/x8BoBEXvCz": 0, "SkyDrive Is doing the right thing. Its a great Trojan horse if you will, into Microsoft Ecosystem.": 0, "Literally BREAKING now: Microsoft Azure, http://t.co/nCarg0Wzgc go titsup: DNS problems render cloud service http://t.co/MsFG65eydH": 0, "@RiotBananas Fucking Microsoft!!!!": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow in the coming weeks : http://t.co/nq6vVMSE6z": 0, "@paulcarr @radostdg @FreeBuffet @ggreenwald Easy question for you now: do Microsoft or Google torture anyone (excepting metaphorically)?": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google ... - Read on http://t.co/2Oz9qfqJSA #Tech": 0, "Microsoft has pulled instructions that allowed #XboxOne owners a way to update their console offline via USB. http://t.co/FpKJK85RkK": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/0FP17EBZQL": 0, "Many Microsoft online services appear to be down http://t.co/9OhfmzYpwe via @thenextweb": 0, "RT @latimestech: Microsoft selling 'Scroogled' merchandise to attack Google http://t.co/Ng4OrcU3Y0": 0, "Microsoft 70-576 pdf showing: UKJY": 0, "Microsoft updates SkyDrive for iOS with camera backup and more http://t.co/8aeiwrCQHs": 0, "Microsoft SkyDrive App is Redesigned for iOS 7, Gets New Camera Backup Feature: Microsoft has released a redes... http://t.co/0KztNkvOUa": 0, "Hate Google? Microsoft has some Scroogled goodies for you! http://t.co/luPUpnjuTH": 0, "Microsoft says Xbox One's Kinect can't see through your clothes http://t.co/cOTVvTWy1T YOUR LOSS, XBOX ONE!": 0, "Back to PiratePad. #SkypeFail RT @COsmitty: Skype Chat going away \n#SMEM and #VOST \nhttp://t.co/zVlG5cm5qT via @thenextweb": 0, "kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/bfhEuEj8Fe": 0, "Without Winamp, what happens to the poor llama? Update covers the end of Winamp and Microsoft's anti-Google gear: http://t.co/5ez6LZJO5h": 0, "microsoft word is testing my fucking patience": 0, "Say what you want about the ps4, but I'm getting an xbox tonight!! Microsoft store at Scottsdale fashion square! come hang out :D": 0, "USA Water Polo: The race for a $2,500 Responsible Sports Community Grant... http://t.co/sMAsFwWVI3 via http://t.co/jDAwU42y28": 0, "RT @EverythingMS: Microsoft teams with TripAdvisor for Bing search results and Windows 8.1 app http://t.co/kH2b5OviTa": 0, "Shooting Between Heartbeats http://t.co/b1GVYBIVKG via http://t.co/jDAwU42y28 #olympics": 0, "PRIVACY ALERT from Security Experts: #Obamacare Website Unsecure http://t.co/b2yxeOF4Cd #college #women #news #uniteblue #p2 #TCOT #PJNET": 0, "'Encrypt everything:' Google's answer to government surveillance is catching on: While Microsoft's busy sellin... http://t.co/fOcHGSbnHF": 0, "@gamespot: Microsoft states that the Kinect for the #XboxOne cannot see through clothing. http://t.co/vNNDvQhkNY lol": 0, "Microsoft SkyDrive App is Redesigned for iOS 7, Gets New Camera Backup Feature http://t.co/jD8LC5ezy0 wreckseal": 0, "Great read - RT @MSFTissues @Microsofts Chief Online Safety Officer: Online safety as a state of being http://t.co/SivqezzLMB": 0, "RT @TRGNews: Make plans to attend Convergence 2014 in Atlanta March 4-7 http://t.co/vCZwxATWTY": 0, "Microsoft counter-sues patent troll http://t.co/sww8WNWTvy": 0, "Microsoft to take over Nokia HQ in 2014 after deal http://t.co/zdexbuaBV7": 0, "Attaining Connectivity and Accruing Proficiencies with Microsoft Dynamics GP and ReQlogic http://t.co/t7McgA2Hq3 #goERPcloud": 0, "Microsoft to Take Over Nokia HQ in 2014 After Deal http://t.co/yj52Pi8a5O": 0, "Microsoft, Amazon and Sears get Black Friday tech deals underway (Alan Buckingham/Betanews) http://t.co/5QZnxiK93r": 0, "Microsoft's scroogled store is very interesting &amp; funny.  from a legal perspective its interesting they stopped the \"steal ur data\" stuff": 0, "I wish McDonalds breakfast was still open": 0, "Upgrading from Windows 7 32bit to 64bit. http://t.co/26KNY4rPOQ": 0, "RT @4JStudios: The UK price for the Skyrim Mash-up Pack has been corrected. \nMicrosoft is working on solutions for all who bought at the hi": 0, "RT @MaelB: Hacker broke into MEPs' pro email accounts using security failure in Microsoft Exchange, apparently still exploitable http://t.c": 0, "Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow in the coming weeks #tech... http://t.co/MWY4ca4UiC": 0, "Microsoft's online services appear to be down worldwide. Xbox Live, http://t.co/zpsxkVtLtb and Outlook all offline.": 0, "RT @peterritchie: http://t.co/2oYc5q9n6e enterprise library is going open source!  get your pull requests ready!": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/U3Y0aELSBy ^ML": 0, "RT @TechCrunch: Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Everno... http://t.co/RFpZt6ZHWw": 0, "@IGN Do you think that Microsoft will ever make a version of Xbox one without kinect so its even more cheaper? #XboxOne": 0, "Microsoft Brings Automatic Camera Backup To SkyDrive On iOS - TechCrunch http://t.co/QR21SjmS51 #microsoft": 0, "http://t.co/F6vlCPCyhl Nokia House becomes Microsoft House": 0, "What is @Microsoft afraid of? @MitchyD: This Xbox One offline update thing is so weird. http://t.co/b5QvxrzyoO": 0, "RT @Microsoft: The party is in full swing in New York. Are you going to an @Xbox One launch event tonight? http://t.co/UqdXoM4cKM": 0, "RT @smoshanthony: Microsoft says Xbox One's Kinect can't see through your clothes http://t.co/cOTVvTWy1T YOUR LOSS, XBOX ONE!": 0, "RT @Thegooglefactz: Can't afford Microsoft Word? Get \"open office\", it's the same thing except it's free and has more features": 0, "Which PC should I buy to run a small business? http://t.co/cxh5BJOqZA": 0, "Microsofts Scroogled Campaign against Google is Going Great: Microsofts Scroogled, a little campaign launche... http://t.co/pDEiUoWi24": 0, "Apple/Amazon pay hackers to bring down Microsoft networks ahead of Xbox One launch!": 0, "Microsoft Brings Automatic Camera Backup To SkyDrive On iOS http://t.co/m6wo5q795t": 0, "Many Microsoft online services appear to be down http://t.co/HRZ46AHoH4 by @epro": 0, "Microsoft Mocks Google s Alleged Fraudulent Acts With  Scroogled  Products http://t.co/IQFxOigGRL&gt;.    team google or team microsoft?": 0, "RT @KristianNese: Updated Whitepaper - Hybrid Cloud with NVGRE (WSSC 2012 R2) : http://t.co/ys884PEkXj #NVGRE #sysctr #wssc": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/5sTUY3nfxa": 0, "Why can't companies just get along. @Microsoft": 0, "Microsoft currently experiencing DNS issues worldwide. Multiple services, including http://t.co/kWqwDUt6Ta, affected.": 0, "This is What Microsofts Smartwatch Might Look Like http://t.co/rKLMN66KhY": 0, "Just saw a #XboxOne demo at a #microsoft store, looks pretty tight": 0, "Microsoft Brings Automatic Camera Backup To SkyDrive On iOS http://t.co/so9pH8Tshm #Startups": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/hPFT25CLro": 0, "iPhone users: Microsoft SkyDrive just got a lot more attractive": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive,... http://t.co/rF4aHgPq7o #app,#iphone,#apple": 0, "I just bought: 'Microsoft Xbox LIVE 12 month gold card' by Microsoft via @amazon http://t.co/DuySqkhfRg": 0, "RT @gblock: OK hell is freezing over! Microsoft just announced a node IDE plugin for Visual Studio! http://t.co/AYnbNV1Gk8. No I am not kid": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox: ... http://t.co/WqOe2JDfIh": 0, "Microsoft DNS servers down; Hotmail, http://t.co/1vcGRwpcbQ, others down  #microsoft #dns": 0, "Xbox One hardware video review: Impressions of new Microsoft console http://t.co/zgK1r52vDS": 0, "RT @TheNextWeb: Microsoft launches Office 365 Admin for Windows Phone, Android and iOS apps to follow http://t.co/iKpKnbHbK3 by @epro": 0, "RT @wpcentral: Microsoft wants you to show your distain for Google  starts selling Scroogled products http://t.co/uYnHWW4nGT": 0, "Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox: ... http://t.co/x28IXyowTB": 0, "Nokias Finland HQ To Become A Microsoft Site Next Year, After Devices &amp; Services Sale http://t.co/AEBhPCJfOJ": 0, "Why Should You Monitor Microsoft Lync Server 2013? http://t.co/VSbXR5zYGs via @WindowsITPro": 0, "Us Weekly: Happy news! Whitney Port is engaged to marry her boyfriend Tim... http://t.co/T2VRpBd6kK via http://t.co/lZ21fxpl5d": 0, "#mobile Quip, The Mobile-First Word Processing App, Now Imports From Microsoft Word, Google Drive, Evernote, Dropbox http://t.co/kLdV4kKiQ3": 0, "Microsoft, this just makes you look desperate. http://t.co/MfEfJbmjZh http://t.co/h4EV3MbkN2": 0, "http://t.co/rduOlzRGwk\n\nhttp://t.co/kYHI9w3sve\n\n@Microsoft #Haters": 0, "How the internet ruined game consoles: The time it took for my brother to get our new Super Nintendo... #hdpostcross #microsoft #nintendo": 0, "Great article by @gamesradar why game downloads won't catch on until sony/Microsoft stop being greedy! #ps4 #xboxone http://t.co/OAkZHNtx3k": 0}