{"RT @heyyouapp:  http://t.co/gySccUbGFS 52 Xbox One | Microsoft's New Xbox One Sells Out | program to gain complete acces of iphone4 | free": 0, "'Microsoft Surface Pro 2 vs. Surface Pro: Should You Upgrade or Not?' http://t.co/6Tp5ljlAuI": 0, "Wisdom Quotes: Subscribe us at http://t.co/tsaGLVm9dO http://t.co/Is9XQ7kLzr via http://t.co/gxktWhKfbI": 0, "microsoft word is the reason I cry at night": 0, "Microsoft has come out with some great technology such as the Surface and the Xbox One. #UCrew": 0, "Surfing on my Surface. #Microsoft": 0, "If Microsoft went bankrupt and bill gates got fucked I would be able to experience true schadenfreude #ilearntanewword #coolasfuckword": 0, "I really like how Sony and Microsoft are all professional towards each other like 'hey congrats on your launch'": 0, "MMA Fight Club: Vitor Belfort: My best is yet to come\n\nUFC president D... http://t.co/gDAXPtEjpU via http://t.co/ABUaH7ML8Q": 0, "@johnobeto Eh, I think it made Microsoft gunshy just about everywhere. A lot of their plans were cut or eliminated.": 0, "Review: Xbox One: The wait for Microsoft's next-gen console finally ended on Friday with the system's global l... http://t.co/6swCWcXWD1": 0, "Microsoft shares hit highest since 2000 with CEO hunt in progress - New Blog Update http://t.co/iLHj7GRef3 #webdesigning": 0, "@jasonfoley I use all technology, if I was a fan boy of Microsoft what good would I be to them? #yolo": 0, "RT @windowsserver: Success with #HybridCloud: The Components of a Microsoft Hybrid Cloud in detail http://t.co/c136aBKGhn #WinServ": 0, "RT @MikeBeas: Report: Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsoft's Kinect http://t.co/kRSg3": 0, "Like what do you mean you don't know how to open Microsoft Office, you've been doing it since elementary school": 0, "just realized that i haven't touched my resume in a year and it's probably terribly laid out because i set it up in microsoft word ughh": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/yakCvX8ZV7": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/r1ghGIWqVO": 0, "Microsoft trying to convince consumers that a Surface is better than an iPad... LOL": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/N3rnzurh0m http://t.co/Wp1iCV98vU": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/lHSbeC46N1": 0, "@EWErickson PS4, sony isn't a draconian master like Microsoft is.": 0, "Did Microsoft reset passwords the same way Sony did? Having some issues.": 0, "Great now I can't do this fucking geo project because I don't have Microsoft Office 2010.": 0, "24 carat apparently - Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/QInrtMGWnM": 0, "Node for Visual Studio?! I'm not feeling that brave yet but cool anyway.\nhttp://t.co/RNwERsjEam": 0, "Fuck apple, Microsoft all the way.": 0, "RT @MCVPacific: Microsoft admits they will struggle to meet Xbox One demand http://t.co/bib9tDst5I": 0, "Bill Gates is primarily known as the multi-billionaire who created Microsoft, the company behind the most popular... http://t.co/cqo2HKo7il": 0, "Microsoft updates SkyDrive for iOS with photo auto-upload: Microsoft just released an update for... http://t.co/TjiNBpd0LX  Via @Creviewer": 0, "Why doesn't microsoft word/open office have an MLA mode": 0, "Funny Shit: Most realistic tattoo I've ever seen http://t.co/q4CImdK36h via http://t.co/fnTDKnNbKt #funny http://t.co/BZ9bKYbTgY": 0, "@TDoAxFuZe You can get a free Microsoft Points here:  http://t.co/GAHQxsCGRD": 0, "Info Cash: Make easy money online by legally exploiting the new Facebook and Microsoft search engine. http://t.co/CdQ3GiE2ea": 0, "RT @FlippityTrip: Find the biggest selection and #best priced Xbox games here: http://t.co/8i4PZwDKLR #xbox #microsoft #video #gamer #sale ": 0, "RT @msdynamicsworld: #MSDynComm #MSPartner News: #MSDynGP Integ'n; #MSDynCRM book; #CPQ Win; BI for #AX2012; #MasterVAR growth... http://t.": 0, "$PTIX Breaking News: Apple Buys PrimeSense, Company Behind Microsoft's Kinect http://t.co/qs4mCPEdYH": 0, "Microsoft: October Patch Tuesday vulnerability patched in November http://t.co/aeB1MY8xVW #memorycorruptionvulnerability #internetexplorer": 0, "Rick Snyder: Governor Snyder joined about 100 volunteers from AmeriCorps... http://t.co/QnfeoPh5jP via http://t.co/hdZI6v6ii9": 0, "RT @DarkLiberator: Microsoft is banning people for swearing over private skype conversations. LOL\nhttp://t.co/CyrfF8HPDq": 0, "Oh man, I just got a #bluescreenofdeath on my #iPad. Yikes. Im still going to blame Microsoft.": 0, "RT @gina_romero: #PWIB13 is fully booked! You can still follow the Twitter buzz all day tomorrow :-) @Microsoft_SG @StarHub @AthenaNetworkS": 0, "#GetSpiced Microsofts Xbox One vs. Sonys PlayStation 4: The future is now! Last week, So... http://t.co/Lm55obcf4Y Via @spicesofafrica": 0, "Nothing like wasting $500 on a piece of crap thanks for the piece of shit @Microsoft no Madden for me": 0, "Apple to buy Israel's PrimeSense, maker of motion-sensing technology used in Microsoft's Kinect | http://t.co/Plt25QbNo8": 0, "Oh @Microsoft why do I want you sooo bad.  #TechCrushes": 0, "Will Google Docs kill off Microsoft Office? http://t.co/tN0TvNEil5 via @CNNMoney": 0, "Hooray, Obama's here, to fight for the little guy!  I'd go thank him, but I can't afford the $16K/plate dinner at a Microsoft exec's mansion": 0, "RT @marielfrancisc0: It's a good day when Microsoft Word finally recognizes my name as an actual word and not a spelling mistake": 0, "@Jimb0slice21 try the Microsoft store": 0, "@Dougie_fresh93 \nget like Microsoft my nigga lol": 0, "#AmoAKevstrack #KevstrackEsMiMotor @KevstracKTW y mis microsoft points?": 0, "Sundance Channel: Still haunted by scenes from THE RETURNED? Check out on... http://t.co/KlxOVNGnAM via http://t.co/ZbM7YG9OII": 0, "Microsoft's New Xbox One Sells Out -  Microsoft's $499 Xbox One gaming console went on sale in the U.S. on Friday.... http://t.co/ajAZHcEzeV": 0, "@Blu3Eagle Hi there you may check: http://t.co/ejYsF36Ebi for #MS courses and http://t.co/tWToyn86fz for more infor. ^Justin": 0, "All them tweets is her...im just chilling waiting for Microsoft Word to load": 0, "Microsoft should really improve the Bing translater feature in the windows phone 8, because some translations are way off. #fail #Bing": 0, "Microsoft key in preference to smes: SqXGFtRYs": 0, "Under The Dome: new image http://t.co/7p4462re6U via http://t.co/tXjObGiDiU #tvshows http://t.co/s7yP60sCVP": 0, "Apropos an crackerjack in association with microsoft deputation apprenticeship: dlkB": 0, "@XboxSupport3 I bought it from the Microsoft Store, so I kinda have talked to them.  :-)": 0, "Security Clearance | Microsoft Sharepoint Mid Developer - IBM - Washington, DC http://t.co/gTc6rRXvKv #dc #jobs": 0, "Look what I made with Microsoft Word! UPDATE http://t.co/pZDPd30L7K": 0, "Microsoft Dynamics Partner Roundup: GP Integration update; New CRM book; Configurator Win; BI for AX 2012... http://t.co/wwdQxoAPDN #CRM": 0, "RT @MercedesBona1: http://t.co/ta37iVA4jB Microsoft CityNext transforms the digital architecture of residents everyday lives": 0, "Xbox one #loveit @Microsoft  Congrats !": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/jMJvg7ZR3D": 0, "Review: Xbox One: The wait for Microsoft's next-gen console finally ended on Friday with the system's global l... http://t.co/SEZ7xm4NsE": 0, "Microsoft: October Patch Tuesday vulnerability patched in November http://t.co/huWslcuduk #memorycorruptionvulnerability #internetexplorer": 0, "MICROSOFT WORD U FUCKING PILE OF SHIT Y WOULD U JAM WHEN I HAVENT SAVED MY WORK FUCK U": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/y4C94SjkKY #Technology": 0, "Microsoft made 500 million dollars off the xbox one in 1 day. Dam": 0, "Skyline Whitespace UK proudly contributed to the huge launch event for Microsofts new Xbox One by providing a... http://t.co/Ho97RUfAFE": 0, "Xbox One console breaks sales record: More than 1m Microsoft Xbox One games consoles bought in the f... http://t.co/WxKmie72UI #strategy": 0, "RT @SocalSam: UCLA computer science students in learning how to use feedback from players, use this link: http://t.co/HMdvRszkfQ #Win8 #Fun": 0, "@Microsoft I'd like a refund. My Xbox One stopped reading discs. You guys lost a fan boy on this one. This is a piece of crap": 0, "Microsoft says initial Xbox One sales exceed 1M - http://t.co/z5xaRY47q2": 0, "Word crashed every single time I opened the thesaurus. Is @Microsoft begging me to switch to @ScrivenerApp or what?": 0, "As much as makes this prelim equally heap harder save the isolated microsoft exams: PLpkvIT": 0, "Who comes under the antitrust microscope? Only the best of the best of the best, like #selfish ly productive Apple Google Microsoft Intel.": 0, "\"Self~trust is the first secret of success.\" - Ralph Waldo Emerson #Quote": 0, "@Microsoft @Xbox WOW. Party Chat Not Working On Xbox One. So Awesome. Feels like 1st gen gaming. Makes playing multiplayer so much fun. NOT!": 0, "I find it's a roll of the dice just like when I bought my Microsoft shares a million years ago. At least Microsoft is a tangible company.": 0, "Nokia conjunction microsoft disturbing previous attended by the sidelight in regard to bordering abiogenesis lu...": 0, "Microsoft video attacks Google's Chrome as #surveillance technology http://t.co/2EfPrGoZMs": 0, "Just entered to win a $550 Microsoft gift card from @TheGameFanatics! #MicrosoftStore #XboxOne http://t.co/xSVtz3o69e via @PunchTab": 0, "RT @mpntraining: Get accredited as a Microsoft #Presales Technical Specialist, enter for chance to win an Amazon gift card http://t.co/lbOp": 0, "Does microsoft have an official contract with MLG assuring the xbox one on the pro circuit? Dont respond if you are a biased  fanboy, facts.": 0, "Dear Microsoft Sharepoint: Please die in a fire.": 0, "Microsoft 70-669 prelim concrete final examination: iIcvQKHW": 0, "Microsoft News: AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside ... - AllThingsD http://t.co/ettbU9sjd2": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search via @josephjett #tech http://t.co/ISUWzdgLIF": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership: Ray Cox IV, who currently ... http://t.co/6ssTsB8KE4": 0, "Lewis Hamilton: new image http://t.co/g7dimeMySL #F1 via http://t.co/u6brH2PXVg": 0, "Check out this item I found on eBay: http://t.co/WMpG0BfGdB\nBRAND NEW SEALED IN BOX\n#XboxOne": 0, "Xbox's are so fuckin shitty but Microsoft wants to sell them all expensive N shit, step your fuckin game up before puttin them on the market": 0, "Microsoft abdominal epilepsy password regainment: high pauperization good terms italic upon word mischief: tMscnk": 0, "My computer just blue screened. I'm so over your shit, Microsoft.": 0, "fashion lady: new image http://t.co/YzNC8awGg4 via http://t.co/qiQqBbpNxe #fashion": 0, "Is there anything more intimidating than a blank Microsoft word document knowing how much writing you have ahead of you?": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox ... http://t.co/aAvJTGgEua #DeadLineHollywood": 0, "Rumor: Microsoft in talks to acquire Winamp and Shoutcast from AOL http://t.co/CWuW6IkmVX for memories?   @Microsoft": 0, "RT @TRMeson: Microsoft is buying WinAMP and Shoutcast. I wonder what this will mean for us who use them.": 0, "Best Famous Quotes: new image http://t.co/PbUlHOBhyB via http://t.co/gxktWhKfbI #quotes http://t.co/q8vPH2Agb5": 0, "'Do We Really Need Microsoft Office on Linux?' http://t.co/lc40HSOAHK": 0, "Dont get Scroogled: Microsoft attacks Google in leakedvideo http://t.co/lch1uYUhpw via @newspin": 0, "House approves $5,000 fee to protest drilling http://t.co/k12MTXOHoN #uspolitics via http://t.co/hdZI6v6ii9": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for MicrosoftsKinect http://t.co/Qtrem9DjxP via @MikeBeas": 0, "@_TiannaMontsss but you must think we are going back to English with the grammar check, you must think this is Microsoft word": 0, "NO DOLLAR GENERAL GOT RID OF 1600 MSP!!!! Ugh I hate buying $25. $20 was perfect, fuck u Microsoft you Greedy pricks": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/FObC0KfJJW": 0, "@XboxSupport3 Could I have gone to a Microsoft store to exchange my broken One?  Because phone support said no. http://t.co/0BrH9scGiL": 0, "I've been sitting here for the past 2 hours staring at this blank Microsoft word document wondering when my research paper will write itself": 0, "Microsoft had me running around  RT @TheBlueMare: @GageDC Don't let it happen again... ;)": 0, "Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/otYimYd2IM #Win8 #FunApps": 0, "RT @Polygon: Halo programmer departs Microsoft for Naughty Dog http://t.co/q4khtuzjH3 who would have know? This awesome lady is built #halo": 0, "@JC_SoCal @xabean thanks to @MoonSols &amp; @volatility too (and ofc @Microsoft for WinDbg !)": 0, "Check out these funky dance moves! http://t.co/l6No7TbEiw #jd2014 #ubi #jdtv": 0, "lmfaoo@ReginaTuneGunz: Lmao RT @Jetlife_DJ: MICROSOFT @_Ammond: @EBread_ wass the word": 0, "RT @NoamiCampbell: she actually used microsoft paint to give herself a bigger butt.....  http://t.co/3j2lcv69yp": 0, "Last Chance Going! Going! Microsoft Surface Windows RT - 32GB  Free Ship! on @eBay http://t.co/xwfTScDgzf": 0, "227's YouTube Chili' Xbox Live Microsoft Points Generator New Update Version 2013 Free Dow... http://t.co/0EMFfeCPWA Jamaal Al-Din - NBA": 0, "Googlers Love Microsoft's 'Scroogled' Gear. Mug and Shirts Sell Out.  http://t.co/k72MWxsvDk via @forbes #Google #Msft #war": 0, "RT @whymicrosoft: Microsoft vs. VMware. How do they compare? Check it out for yourself: http://t.co/494IRdzt6S": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/ppwfXpvyxv [via http://t.co/8ajOyv6wpn]": 0, "Pat Barry: new image http://t.co/99bhTTVprU via http://t.co/ABUaH7ML8Q #mma http://t.co/zKNNwnutrV": 0, "Microsoft: Forza 5 running at 1080p, 60fps shows what future Xbox One games can be.": 0, "@StarkRahul Refer to http://t.co/JS9fSUw5Iy for Win 8 system requirements. You can buy the product at http://t.co/k0tChTTdVV . Helps? ^MG": 0, "Take a look at these Windows 9 concepts, which Microsoft will ignore http://t.co/4WE38VwOQN @Microsoft": 0, "@Jspratt801 really? Have you checked the Microsoft store downtown?": 0, "@SamitSarkar \nI have had the worst support at Microsoft on Xbox One due to a very poor policy. Please help me with this! #XboxOne": 0, "RT @PS4NoDRM: Lmao, GG @Microsoft &gt; Xbox One Users banned from Upload Studio for swearing http://t.co/bzgUtoRnun (Via: http://t.co/nm60MkbQ": 0, "Apple buys @GoPrimeSense, the #sensor tech behind Microsoft's Xbox for $385M #singularityu #Apple @applenews_us http://t.co/44Vxup57PR": 0, "Stir the nonesuch benefits respecting microsoft approximation conjunction sql tray: ZqD": 0, "Here are some astounding Wallpapers From the Artist CygX1 http://t.co/0PByS9KQdk": 0, "RT @realprgamer: Corrinne Yu abandona Microsoft y se marcha a Naughty Dog.\n\n-Havok http://t.co/AqeYNAW0uX": 0, "Who the fuck do I call and complain to about this piece of shit Microsoft word": 0, "RT @jtimbre:  Don't forget to subscribe to my official Twitter Card! Get the latest on #Microsoft + tech, giveaways, +more!  http://t.co/": 0, "Aggressive Corporate Attack Ads - Microsoft Targets Google with Their Scroogled Produc #Branding:  http://t.co/nKmxUuqlKn": 0, "One Direction: new image http://t.co/YyNxpGerDp #rockbands via http://t.co/ZY1cU2DvHH": 0, "RT @einarmorillo: #Business AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/14umqtDE": 0, "Microsoft Addresses Xbox One Hardware Problems http://t.co/5ooDUrZMtF": 0, "RT @MarcoCudder: @ducidni: Microsoft, I love you http://t.co/SnLClcnQ9r wow": 0, "'Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership' http://t.co/uLyHWUV8wX": 0, "@Aj_jones65 mine too but Microsoft lost me w/ the whole line of thinking that being able 2 speak 2 ur console is more important than gaming": 0, "@Bobst01 ouch. Is Microsoft sending you a new one?": 0, "Help UCLA game design students understand usability in games by reviewing their game, use this link: http://t.co/1J1B5dauK2 #Win8 #FunApps": 0, "RT @mannyromano: Whoever stole my Microsoft Office is in big trouble. You have my Word!": 0, "It's sad that even the actors hired for the Microsoft Surface commercials can't convincingly act excited about the Microsoft Surface.": 0, "\"@jeffwilcox: Microsoft Store on Michigan Ave in Chicago - Xbox One! http://t.co/tkOYn2xWHn\"": 0, "#Microsoft #News: \"Microsoft Sells Over 1 Million Xbox One Consoles In 24 Hours - Huffington Post\" http://t.co/xHecwGnsBs": 0, "RT @TheEconomist: Nokia, once the world's biggest mobile-phone maker, is reinventing itself. Again http://t.co/jwP37Cc1cK": 0, "Microsoft records its best console launch yet, moves 1 million Xbox Ones in a day http://t.co/IzVTgx98VE #tech": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/a5tdedakmc #tech #news #digital": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/9HbvAcJqA3 via Eric Johnson": 0, "#XboxOne Game on: Test-driving the XBox One and PS4: Ive been test-driving the Sony PS4 and Microsoft Xbox On... http://t.co/0QoF2yNbzl": 0, "Fully convinced that the entire @Microsoft corporation is comprised of teenagers in basements high on Mountain Dew. #Microsoft": 0, "MMA Fight Club: new image http://t.co/znImeMoS3w #mma via http://t.co/ABUaH7ML8Q http://t.co/tibLm3h6l9": 0, "Microsoft's devices head: We wont have three Windows versions in the future http://t.co/hJELM98VXD": 0, "Too many people blame Microsoft for missing out on Tablets &amp; Phones, but forget the government prevented them from innovating in many areas": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsoft's Kinect http://t.co/JlJY0cNKTN via @newspin": 0, "Microsoft sells 1 million Xbox One consoles in 24 hours http://t.co/1kBF8m4dJw #tech #entertainment #gaming #gadgets": 0, "I wonder why @Microsoft wastes the time/money/space to mislead customers by giving them programs they can't even access? #Microsoft": 0, "Microsoft CEO: Microsoft Can Be Trusted With Your Privacyhttp://bit.ly/IhCIk2 http://t.co/2VBme01wyf": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/EzHwXgP9Df": 0, "Microsoft allowing Apple to buy a key component (THE key component?) of Kinect was a huge mistake.": 0, "RT @TheRealMar6: Microsoft made 500 million dollars off the xbox one in 1 day. Dam": 0, "Day one all day baby! #XboxOne #DayOneEdition2013 #Microsoft #CODGhosts #BlackFlag http://t.co/7yyeVI5G9K": 0, "Whoever stole my copy of Microsoft Office is in big trouble. You have my Word.": 0, "Taking a cue from Microsoft, Nokia is trying to sell the Lumia 2520 by ridiculing the iPad http://t.co/VeCtfg0SYx by @nisummers": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership #microsof... http://t.co/kPC55BHyZ4 - via @NeowinFeed": 0, "@microsoft #windows 8.1 SUCKS! Picks up strange printers everywhere &amp; changes default without warning. Automatically updates to IE 11.": 0, "#GetSpiced Microsofts Xbox One vs. Sonys PlayStation 4: The future is now! Last week, So... http://t.co/wKaL3oUtYr Via @spicesofafrica": 0, "I just read where Microsoft said that they'll continue to support the Xbox 360 until at least 2016. So I got plenty of time for Xbox One.": 0, "[BOT-ANDIKA ARYA- V2]: Life after Kinect: PrimeSense's plans for a post-Microsoft future @dikapratamaarya": 0, "@Dr_P5 get open office. It's free. You can save your presentation as a PowerPoint as well (as if you were using Microsoft office)": 0, "MS may acquire Winamp. amazing. http://t.co/tbRGlYX5n1": 0, "Microsoft updates SkyDrive for iOS with photo auto-upload http://t.co/VGZeOVwcqM": 0, "Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsofts Kinect Tech http://t.co/kKJLBumnLe via @AppAdvice": 0, "Candice Swanepoel: new image http://t.co/1l1Sik6Hpi #fashion via http://t.co/PEiph2vUXV http://t.co/ZVJqKBpKQH": 0, "So, who wants to help me keep my sanity while I work on these godawful Microsoft Access projects? #plztextme #help": 0, "Have a good image caption for this little fella on todays @bing homepage? Tell uswere all ears! http://t.co/SDlnkQOJoM": 0, "RT @ducidni: Microsoft, I love you http://t.co/KZxDvtN1nl": 0, "227's YouTube Chili' Microsoft Office 2013 Activation [NOVEMBER 2013]-www.keygen4u.com: \n\n... http://t.co/aUobdG1O9a Jamaal Al-Din - NBA": 0, "Ballmer defends Bing and Xbox as key parts of Microsoft in final speech - http://t.co/yM8neHmu8t": 0, "Microsoft periphery inquire into-terrific benevolence os-iv run up against opposite la cairn: rVHQZXa": 0, "Candice Swanepoel: new image http://t.co/pzhFFhiA0p via http://t.co/PEiph2vUXV #fashion": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/1iC7LRcBK7": 0, "RT @Sonmi_819: #Microsoft is selling anti-#Google merchandise \"keep calm while we steal yr data\". [Microsoft playing innocent] #LULZ http:/": 0, "@IFilmforfood I don't have a credit card on my account and i don't want to because Microsoft doesn't let me take it off lol": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/Wxxk3CUDLi FIX THIS OK NOW": 0, "I love you, @SaraBareilles. But what the heck is @Microsoft using \"Brave\" for!? Doesn't even make sense in the context of the commercial!": 0, "Even the lady I spoke with on the phone agreed that your practices are misleading. @Microsoft #Microsoft @whymicrosoft @MicrosoftStore": 0, "So yeah my Xbox one already broke, I got to play it for an hour. Good job Microsoft": 0, "Stop trying to make Microsoft SkyDrive happen": 0, " http://t.co/BzwV7HLAuJ 19 Office 365 | Microsoft's Office 365 Gets Encrypted Emails From Early 2014 | tell difference between iphone4 4s ": 0, "PowerObjects Launches The CRM Book, a Online Resource for Microsoft Dynamics CRM http://t.co/FtcEVSR5kx": 0, "@elviobr 2/2 Please take a moment to share your thoughts on our support at http://t.co/UfCF1MdiIm . Thanks for your time. ^MG": 0, "\"Don't get scroogled,\" says microsoft leaked internal vid attacking chrome http://t.co/G1yPkTX9Nk": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/mXuxjDiSUw via @BloombergNews": 0, "@SamerSGharib hey faggot you never texted me your number": 0, "RT @sawzeemonster: To  whoever stole my Microsoft Office account: \n\nI will find you\n\nYou have my Word\n\n(See what I did there)": 0, "@UKPositiveLad shit, I read voyager! That was a real Trekkie blunder. Can't be Microsoft, otherwise they'd always get crashes": 0, "RT @nextofwindows: Use Microsoft Account to Prevent Local Accounts Hack In Windows 8 / 8.1 http://t.co/q6lEqV982F": 0, "A TV ad where a teacher talks about how all his students have a Microsoft Surface and can find answers through a Bing search.": 0, "Startup Day @ Microsoft NZ https://t.co/RNWdtUR69m": 0, "Save $50 on #Xbox console and holiday bundles at @MicrosoftStore here http://t.co/OVvfpld8eL": 0, "@brianfagioli @microsoft @windows Yeah, right. Makes no sense to ditch Windows RT now. It's not as bad as Windows Phone for one.": 0, "@danpack6 you're sony are trumping Microsoft, but your giving out a statstics that suggests otherwise": 0, "Microsoft Interested to Buy Winamp from AOL? - http://t.co/X8eteHN05e http://t.co/Jx8jjm80cY": 0, "F1 Around the World: new image http://t.co/T2iv9TWcMK via http://t.co/u6brH2PXVg #F1": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/jJy2wgdmYM": 0, "@CRA1GYBOY Warheads will work but for audio only. Because they were the only wireless headset that ran through Microsoft's own wireless...": 0, "Microsoft Knows How To Party http://t.co/PM7rlyGsHv #gaming": 0, "Xbox One sells over a million units on day one: Microsoft has announced on the weekend that they have sold over a... http://t.co/DtXXDhYlka": 0, "@DanPitts8 you have 45 days to buy the extended warranty from Microsoft so it's no worry. Plus you get the usual year warranty": 0, "@rdmdude814 We understand your concern. Please post your suggestion/feedback at http://t.co/B742Jk9fq5 . Need help with anything else? ^MG": 0, "Fashion: Choose your http://t.co/8pmNTA0w9E via http://t.co/qiQqBbpNxe #fashion http://t.co/Vh1YxQsHN0": 0, "it's not what you think.  microsoft is the best shit ever ... i just want to learn how to use their product ... that's all": 0, "Rumor: Microsoft in talks to acquire Winamp and Shoutcast from AOL http://t.co/jr9Kuem6zP #tips": 0, "Worried that the XBox One lets the government spy on you? Get Privacy One. lol #xboxone #microsoft http://t.co/e9nhiik1nI": 0, "RT @Forbes: Microsoft may name a new CEO by year's end. Will it be Ford's Mulally? http://t.co/cYEIMDfdTJ": 0, "@hgcfan that fking stupid I wish they would just show down the whole of microsoft": 0, "Only thing I want for Christmas is Microsoft Word. ": 0, "RT @gonedeadbye: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/BiLPExvmjC": 0, "#Vikings RT @TomPelissero Good to see Microsoft Word now accepts the word \"Cordarrelle.\"": 0, "If you are looking for better graphics, you will find none. Only more wasted money to Microsoft. #XboxOne": 0, "Just entered to win a $550 Microsoft gift card from @TheGameFanatics! You should enter too! #MicrosoftStore #XboxOne http://t.co/j5wGhgyRXh": 0, "I have a really old Microsoft version and it difficult.... #comppaper": 0, "That brief moment of panic when you accidentally hit Close instead of Save on your paper in Microsoft Word": 0, "Microsoft takes second swing at tablets with new Surface 2 lineup http://t.co/2FPMHmpCpV": 0, "Google laughs off Microsofts Scroogled merchandise stunt http://t.co/9foNzBnqIt via @BGR": 0, "RT @moorejh: #microsoft #IBM RT @paulblaser: Half an operating system: The triumph and tragedy of OS/2 http://t.co/LWkMVf4cr3": 0, "Omgggg who has Microsoft publisher ?": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/DM8z2fimQ3": 0, "Best English Quotes &amp; Say...: new image http://t.co/S3RqTF1Tol #quotes via http://t.co/gxktWhKfbI": 0, "@MsBosconovitch I'm just not too impressed with Microsoft this generation. I might get it latter on when good games come out for it.": 0, "Microsoft Delaying Twitch Streaming May Be Good Idea Afterall http://t.co/2iEKUxAZnq": 0, "Why don't this laptop have power point or microsoft word it should already be installed": 0, "@Mr516 Were you speaking with an HP or a Microsoft technician? Get back to us when you can, Kyle. ^JVO": 0, "RT @NrbNick: Someone please verify from America!  10$ Microsoft Card is equal to 800msp right?": 0, "Microsoft a Leader in Gartners Magic Quadrant for Operational Database Management Systems http://t.co/9HHgqAVd5M #MSBI": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/X3t566ZjCP": 0, "Xbox brings in tons of traffic to Microsoft store, but Apple store directly across still dominating": 0, "AllThingsD : AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/x3cspDvEbh": 0, "RT @FulanoDidit: I hate things that have to do with Microsoft word": 0, " #xboxone #aweyeah #beauty #microsoft http://t.co/AsVmx78tOD": 0, "Microsoft raises 2,500 Turkish software developers - #turkey #breakingnews #prturkey http://t.co/PQGFtQSv5Y": 0, "\"@IGN: Microsoft Addresses Xbox One Hardware Problems http://t.co/MZpVmYyfvO\"": 0, "FREE Office 365 Home Premium + #WD My Passport 500GB. Available with every purchase of #Microsoft #Surface Pro http://t.co/K8A7Dqzda9": 0, "sorry mr ward but im not about to pay 100 dollars for microsoft word so i can write this paper...": 0, "RT @travisdwoo: Why isnt it called \"microsoft words\"?": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/g5sDPiU3wh": 0, "@flyinglotus PSN was hacked by cyber terrorists.THEY tried to take your info.Sony stopped em.Meanwhile Microsoft happily gives ur info away": 0, "Fashion: How about the outfits and the #ankle #boots? \nFor http://t.co/wmtEGfl4X6 via http://t.co/qiQqBbpNxe #fashion": 0, "Microsoft Streets &amp; Trips 2013 Review &amp; Giveaway! http://t.co/UYC3b5VdJ5": 0, "Wonder if Microsoft will count all of the replaced faulty systems as \"new sales\" for their sale count.": 0, "Create a method that checks a poker hand - MSDN - Microsoft http://t.co/BrwHxQe2LT": 0, "Tips conjunction hints accompanying flaky microsoft assignment courses: HYykvchMg": 0, "why the hell Microsoft office update ask me to close Firefox, chrome, and safari???": 0, "22 Office 365 | Microsoft's Office 365 Gets Encrypted Emails From Early 2014 | Encrypted messaging coming to... http://t.co/KzjhuJ39E3": 0, "Reincarnation at Nokia: Planning the next bounceback | The Economist http://t.co/rY99cEEWLf": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/LM2RhvRLfH #Tech": 0, "RT @chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/m6LsBlW3Av": 0, "Introducing World Child Cancer http://t.co/EaVPzODZAr via http://t.co/3cVMRz99nh #worldnews": 0, "Don't you dare judge me for the things I write, Microsoft Word.": 0, "F1 Around the World: new image http://t.co/zRMtnjsZlA via http://t.co/u6brH2PXVg #F1 http://t.co/V2rOaxdBe7": 0, "Now he just told me to use Microsoft Word to do my power point ": 0, "Review: Xbox One - The wait for Microsoft's next-gen console finally ended on Friday with the system's global la... http://t.co/7rzjk4letT": 0, "So it's between the iPad air and the Microsoft Surface for Christmas": 0, "Yahoo slams Microsoft Outlook in eccentric memo, even though most of them use it http://t.co/lCncwEFJbR": 0, "Xbox One Key To 'One Microsoft' - InformationWeek http://t.co/WguDkOsSqK": 0, "I must admit as a Windows and Microsoft hater, the XboxOne is pretty bloody awesome! #AppleFanBoy": 0, "Deep down inside we know it's true - Microsoft video attacks Google's Chrome as surveillance technology - Boing Boing\nhttp://t.co/iMOSzr8tn3": 0, "Job Opportunity:? Microsoft Dynamics CRM Developer in San Antonio, TX http://t.co/nnLVkEdvp8 #job": 0, "Microsoft Now Selling Google-Bashing Merchandise, Just in Time for the Holidays http://t.co/TvWyIWGpZe.": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/P0luR3qahy": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store http://t.co/ajwdL49VEn": 0, "RT @SQLServerMag: Get tips from @idigdata for building real-world #Microsoft BI dashboards today: http://t.co/BwZ19hHlgr  #SQLServer  #busi": 0, "Leave the pussy microsoft like windows vista": 0, "Good to see Microsoft Word now accepts the word \"Cordarrelle.\"": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search: In case you missed... http://t.co/fJySX2S4U5": 0, "UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/NWah7fdrfZ #Win8 #FunApps": 0, "Well that was a dumb Microsoft Windows commercial": 0, "Sara Bareilles sold out to Microsoft because Excel users are SO BRAVE #SNF": 0, "Someone know how to torrent 2013 Microsoft word and all that on a Macbook?": 0, "i am officially inside an ad for Microsoft Surface.  #cta  #fail  #bitemyshinymetalass  http://t.co/3UzqHIAX51": 0, "@Maff50 Sony sold 1 million PS4 on day 1 in the USA &amp; Canada, Microsoft sold 1 million XboxOnes on day 1 around the world. Imo Sony won day1": 0, "My living room is officially an #Microsoft #Xbox360 and #XboxOne entertainment room #nerd http://t.co/w2agqetPFA": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search: In case you missed... http://t.co/9UymEaUvkT": 0, "Little boy got his dream concert thanks to @SeanOLinn!! @microsoft @mackelmore_ http://t.co/sx1byUzN8h": 0, "I have to admit I love the Kinect it's fucking amazing great job Microsoft.": 0, "Lil Mama dress was designed by Microsoft?": 0, "so fucking annoying i cant do my homework because i dont have microsoft office http://t.co/LKv9SxEZ5R": 0, "RT @theanxiousgeek: \"@tomwarren: Apple confirms it has acquired the company behind Microsoft's Kinect sensor http://t.co/FAkhLtjVAr\"": 0, "My collection is growing :3 #PS4 #GameCube #WiiU #Xbox360 #PS2 #Nintendo #Sony #Microsoft #Gamer4Life http://t.co/duEZkwV8mD": 0, "So, according to Microsoft, the Xbone has sold out at most locations. Yet, most stores in and through NYC have shelves full of them. #lulz": 0, "Any IT veteran can tell you, rushed deployments rarely go well. http://t.co/Tk3pmQ9CDx": 0, "Insanely Funny Shit: new image http://t.co/3Vy4kD2Gqi via http://t.co/fnTDKnNbKt #funny": 0, "@XboxSupport my kinect is not working do I return to microsoft or the retailer.": 0, "#Microsoft and #Sony should be ashamed of themselves for releasing these next gen consoles before testing them ": 0, "5 hours left to #win a subscription to Microsoft Office 365 Premium ($99 Value) http://t.co/f0O9zg7Jw3 #giveaway #lowentry #GetItDone": 0, "...\n\nBut when your writing looks like a 2nd grader wrote it, then please, Grab a grammar book, or write it on Microsoft word, SOMETHING!! ": 0, "RT @surfer5671: Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/IQCI0mrMOO": 0, "YAMP (Yet Another Maze Program) - Small Basic Featured Game http://t.co/hOO4XH4ZpL #microsoft": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/hzfOQTbMwu": 0, "@StrategicArmin im on my phone but it has Microsoft word on it": 0, "RT @SassyLulu_: Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours, But Takes 11 More Countries To Do It http://t.co/gcIVjkj0": 0, "Surfing Australia: Our mates at Original Source Tribe are giving away a ... http://t.co/SM0yzuhxj5 via http://t.co/mn3EFmuNyP": 0, "Insanely Funny Shit: new image http://t.co/Oz3uIfny5O via http://t.co/fnTDKnNbKt #funny http://t.co/3k4zsp53qN": 0, "@sumiturok Noticed you like Video Games! Sony/Microsoft or PC??": 0, "shared a link http://t.co/uHzEFAUSJt": 0, "Tu me va a deci que el\nxbox one no tiene? @XcluFJ RT @IGN: Microsoft Addresses Xbox One Hardware Problems http://t.co/NFNl4W7D0A": 0, "Hahaha because the only people there are asking for iPads. RT \"@BurritoBrosShit: The Microsoft Store has Xbox ones in stock.\"": 0, "RT @thetechgame: Microsoft gives highest Gamerscore holder lifetime Xbox Live Gold http://t.co/KqqiyGbPDH #thetechgame #gamingnews": 0, "#WIN a Year Subscription to @Office 365 and #GetItDone\n @ourkidsmom #ad ends 11/29 #giveaway http://t.co/d5oEGQRSjk": 0, "@20yorobot Microsoft's compiler that is": 0, "@ThePrimetime07 @Microsoft what happened?": 0, "Impending Apple v. Microsoft lawsuit over Kinect in 3, 2, 1": 0, "Intangible Currencies will fuel Nokia's next win, imo. http://t.co/3mQbwSy9tk": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console - Ready to ship: $550.00 (0 Bids) End Date: Sunday... http://t.co/CtTpcFEr7o": 0, "RT @SanFranTech: RT @Forbes: A San Francisco Startup Takes Aim At Microsoft's $20B Cash Cow: Quip CEO Bret Taylor knows the... http://t.co/": 0, "Microsoft Xbox 360 S 250GB Matte Black Console:   Price 140.0  USD  (0 Bids)End Time: 2013-11-25 04:37:02  PDT... http://t.co/xfydC7hndL": 0, "Should Certain Animals Get \"Non-Human Rights?\" http://t.co/qgYvHmkWP2 #uspolitics via http://t.co/hdZI6v6ii9": 0, "Why did Bill Gates leave Microsoft? http://t.co/HRMrFRm7cZ": 0, "RT @businessinsider: BREAKING: Microsoft Sells Over 1 Million Xbox One Units In Less Than 24 Hours http://t.co/ZNubm5u0fQ": 0, "RT @PTRVanguardia: RT @PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits": 0, "RT @RonTheAnchorman: Whoever stole my copy of Microsoft Office, I will find you.\n\nYou have my word.": 0, "Microsoft is buying WinAMP and Shoutcast. I wonder what this will mean for us who use them.": 0, "The military training pertaining to microsoft revival software: eSk": 0, "Spokesperson says purchase of the 3-D sensing company behind Microsoft's Kinect sensor is a done deal. [Read m... http://t.co/puyOCKN2V0": 0, "RT @JeffreyPJacobs: RT @asicentral: Team @Microsoft now offering #promoproducts poking fun at @google ... it's gettin' ugly! http://t.co/ZX": 0, "Here we go again RT @hardwarezone XBONE launch day woes for Microsoft as some users complain of disc drive issues - http://t.co/Yib5h6Jwth": 0, "@CheapyD @GarnettLee @vics_viper Microsoft lands another tone deaf Xbox One gaffe. This seems on the scale of horse armor.": 0, "RT @87KLH: I need to call apple and google and Microsoft @adamprokopchuk and I are geniuses": 0, "RT @bailesokawaii: your move Microsoft http://t.co/7CtYLjN50O": 0, "@thetone @azroberts for the large part yes. Although a couple like Apple, VW, Ford and Microsoft will simplify again. All are two detailed.": 0, "#GetSpiced Microsofts Xbox One vs. Sonys PlayStation 4: The future is now! Last week, So... http://t.co/iRuwXzmjNH Via @spicesofafrica": 0, "Create, update &amp; delete records with Microsoft #Dynamics CRM app now available for #WindowsPhone, iPhone &amp; Android http://t.co/rbpje17zkZ": 0, "Halo programmer departs Microsoft for Naughty Dog - Polygon - http://t.co/rOSs2tPcZJ": 0, "Damn! Funny: Look Son, A legend http://t.co/XpUaGF8DiX via http://t.co/fnTDKnNbKt #funny": 0, "RT @UberTips: Cant afford Microsoft Word? \n\nGet open office\n\nIts the same thing except its free and has more features.": 0, "IE 10 is a hellacious train wreck. Can't you get it right, yet? @Microsoft #Microsoft #LearnFromApple #Amateurs #Sad #GeeksInBasements": 0, "RT @e_kaspersky: Microsoft to Roll Out Encrypted Message Service for Office 365 http://t.co/W0HumdnFSp Okay..": 0, "Is Microsoft Word not responding an acceptable excuse for not doing homework. That shit isn't my fault": 0, "RT @TerhorstTim: Gettin real tired or your shit Microsoft": 0, "[Tech] Review: Xbox One: The wait for Microsoft's next-gen console finally ended on Friday with the syste... http://t.co/kTbrvSLyW8 #YAF": 0, "Giveaway -  2 Xbox Ones!!! And Microsoft Swag Bags!: http://t.co/NOuLbgOZ99 via @youtube": 0, "RT @businessinsider: Microsoft sells 1 million XBox ones in first 24 hours http://t.co/mqdXpRol36": 0, "RT @Xxwickedspliffx: @Under_Inspired CoD ghost runs at 720p because microsoft was worried that it would bring down the consoles performance": 0, "I have a feeling Apple fan boys will say @Microsoft copied Apple when PrimeSense tech becomes incorporated into Apple products": 0, "Vogue Australia: Shop smart: The seven deadly sins of shopping and how t... http://t.co/QTJoHWDxC7 via http://t.co/qiQqBbpNxe": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/kfyTFaKcgq": 0, "Funny jokes &amp; pics: new image http://t.co/ZppLeAo387 via http://t.co/fnTDKnNbKt #funny": 0, "RT @Xbox: @PlayStation @Microsoft Thanks! It's been a #GreatWeektoBeaGamer": 0, "@HaloWaypoint @XboxSupport @Microsoft i cant believe what you make your employees do,i felt his grief when i shook his hand &amp; apologized": 0, "@JaneJaneheg 2/2 Please take a moment to share your thoughts on our service at http://t.co/tUI2Lg0BAV . We value your feedback. ^MG": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/VwIKitZ0Px #UX #CX #IA": 0, "Enter to win a 1-Year Microsoft @Office 365 Home Premium so you can #GetItDone! Via @BayAreaMommycom! http://t.co/UfOi6TEi2x": 0, "Wireless WoW MMORPG gaming mouse for Microsoft Windows PC and Apple Mac http://t.co/KIVrXmKron": 0, "Trying to edit my movie but window maker is being a total poopie face. Microsoft about to get sued.": 0, "It's one thing to use filters to make ur pics look better, but when it looks like you used Microsoft Paint there's no hope for you.": 0, "Listen to the Adventures of Sherlock Holmes in project Gutenberg with m.Aloud for windows 8.1\nhttp://t.co/lDQZ34L4mK http://t.co/R1sKbil1Us": 0, ".@Microsoft emerson, gates, and ballmer": 0, "Dealing with this shit makes me wanna buy an xbox one instead of the ps4. Never had this problem with microsoft.": 0, "RT @temitopeybnl: Oloun!\"@Boobs_r_big: WE REALLY DONT CARE BRUH \"@thimmyt: Dear Microsoft Word, I'm pretty sure I spelled my name right\"\"\"": 0, "RT @saumilmehta: Another writedown! \"@mashable: #Microsoft #Surface 2: What to Expect http://t.co/pb3m4WT4cs\"": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies - http://t.co/N4FNuHE3vo http://t.co/WzewiIiYFC": 0, "@Microsoft enable Super Xbox, linking a user's Windows PC and the console to boost Xbox's performance to PC gaming levels for nerds.": 0, "@Sergey_Kozerod \"@techdelight: Microsoft apparently negotiating to buy Winamp and other nullsoft tech #technology http://t.co/cvGRagEq3L\"": 0, "Spread my ashes over Microsoft Word": 0, "Microsoft end use acclimation enhances virulence in point of employees: AIdqy": 0, "RT @ReginaTuneGunz: Lmao RT @Jetlife_DJ: MICROSOFT @_Ammond: @EBread_ wass the word": 0, "RT @HeyRatty: Sara Bareilles sold out to Microsoft because Excel users are SO BRAVE #SNF": 0, "UCLA game design students better game design by using this link: http://t.co/z7GIia6S2J #Win8 #FunApps": 0, "RT @TheComedyJokes: Dear Microsoft Word, I'm pretty sure I spelled my name right.": 0, "UCLA computer science students understand usability in games by reviewing their game, use this link: http://t.co/uIm96rqpYD #Win8 #FunApps": 0, "@appletize new Surface commercials expose reality; Microsoft sells to IT depts, not consumers": 0, "Microsoft acknowledges problems with disc drive of its new Xbox One console http://t.co/5PIyKbwY8V": 0, "ISNT THERE SOMETHING ON MICROSOFT WORD THAT HAS A CITATION CREATOR or something to help form thattt ??!! Or no.....": 0, "Egypt Passes Harsh New Anti-Protest Law http://t.co/B7LEJziIJh #worldnews via http://t.co/3cVMRz99nh": 0, "RT @RobTiffany: Microsoft to get EU approval for $7.3 Nokia deal, report says http://t.co/MUoN6n2hTw via @CNET": 0, "Just had a heart attack cause I thought I didn't have Microsoft word anymore ": 0, "Microsoft just allowed Apple to raid its backyard... Htf did they let them get PrimeSense?": 0, "Deadline Hollywood: Microsoft's Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/ruvbpEXpvK": 0, "@Batman_CTF You can get a free Microsoft Points here:  http://t.co/GAHQxsCGRD": 0, "RT @DualShockers: Microsoft Releases All the Xbox One Voice Commands for Easier Navigation #videogames http://t.co/PPNnSCvurQ": 0, "Integrated function for Microsoft Outlook to post copy of email text or pages directly to a web application http://t.co/jfv8kAKehL": 0, "no microsoft word my last name is not spelled wrong": 0, "Apple buys the company that built the Microsoft Kinect sensor. Strange times. http://t.co/f6wFmU4LN7": 0, "Check out these funky dance moves! http://t.co/s14lENM1o5 #jd2014 #ubi #jdtv": 0, "@LivingKarma @Smokeydogg7  I just think PS4 runs better and i hate all the bullshit Microsoft tried to pull on us. Gamers deserved better.": 0, "Alex Zanardi wins Best Male Debut at Paralympic Sport Awards http://t.co/0LldELPw0D #olympics via http://t.co/jDAwU42y28": 0, "Why is it so bloody difficult to install windows 8 on an SSD?? @Microsoft fix your shit": 0, "Looking for to eviscerate an industry titan? @Blackboard is easy pickings. It is akin to Microsoft's IE 5-7, or IE period. Just terrible.": 0, "TV Guide Magazine: Patrick Jane has his long-awaited showdown with Red Jo... http://t.co/piKWHq6Fej via http://t.co/tXjObGiDiU": 0, "Hipopotizante! http://t.co/YYpxgqJfjp #Vimeo #kinect #music #motion #dance #live #xbox #microsoft #processing #ableton": 0, "I love that Microsoft's tablet commercial uses the soundtrack 'I wanna see you be brave.' Irony? I think not. #aintanapple": 0, "RT @Pusha_TeeWat: Lil Mama dress was designed by Microsoft?": 0, "End of consoles as phone gaming takes off? @BloombergTV: 2.3 mln people are on GameStop's wtg list for new game Sony and Microsoft consoles": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/lXzRteaX8E": 0, "#Business AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/14umqtDEFc": 0, "iPad still rules RT @ChrisPepin: On Chris Pepin dot com: Microsoft Surface tablet impressions: Thumbs down http://t.co/qTTefjBPDR #mobile": 0, "Week in review: AppSung 2, internet funneling and a look inside Microsoft's CEO search.  #bpulse #tech  http://t.co/dkYGO5xzSg": 0, "Why over pay for XBox #video #games when you can buy them at a #discount here: http://t.co/8i4PZwDKLR #microsoft #deals #xbox #xbox360": 0, "Fashion: Would you change anything ? Share = Like http://t.co/qw8xIBgtTx via http://t.co/qiQqBbpNxe #fashion http://t.co/nBU6qZbPCW": 0, "I have Microsoft 1776 on my computer": 0, "I think I'm going with the Microsoft Surface": 0, "#PWIB13 is fully booked! You can still follow the Twitter buzz all day tomorrow :-) @Microsoft_SG @StarHub @AthenaNetworkSG  @connectedwomen": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/yZ5tv7ACB0": 0, "One Microsoft Way: Half an operating system: The triumph and tragedy of OS/2 http://t.co/VcO2hBgcAS": 0, "Microsoft has announced that Sunset Overdrive will be released for the #XboxOne in 2014 http://t.co/9Ll2wxaKHL": 0, "@shilovesdabeat writing papers in Microsoft word is disheartening....iPhone is everything.": 0, "@JVB That's the new Microsoft. Release half baked products and fix them later (Windows Phone, Windows 8, Surface...). Give them a year :-)": 0, "So I can't even use the Outlook that #Microsoft Office installed on my computer unless I pay $99 more dollars. Thanks, @Microsoft. #agenda": 0, "@Ricker666 you've been watching those Microsoft commercials, haven't you? ;)": 0, "Probably get the Microsoft Surface for a change, the iPad always the same": 0, "RT @Jetlife_DJ: MICROSOFT @_Ammond: @EBread_ wass the word": 0, "Will Microsoft succeed to recoup glory of... http://t.co/x1vT7BZQAb": 0, "Google responds to Microsoft smear campaign with witty retort about ... http://t.co/FmuhCAryvN": 0, "Microsoft's Xbox One Launch Appears Relatively Smooth So Far   via @forbes http://t.co/31zdI9T1f6": 0, " http://t.co/4ERjVmUgq1 78 Xbox One | Microsoft's New Xbox One Sells Out | olive recipe smoked dessert apple oil |": 0, "Video - Self-Service BI for Microsoft Dynamics ERP with Excel and PowerPivot http://t.co/Vtv6sAeWBP #MSBI": 0, "\"I'm so done with this,\" I mumble to a blank Microsoft Word document.": 0, "Xbox One console breaks sales record http://t.co/eCKjP91YRD": 0, "This is legit - Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/C2StCue8FL": 0, "I liked a @YouTube video http://t.co/kCsmuzrhwS Child Porn Images Blocked by Google and Microsoft": 0, "#Win Microsoft Office 365 Home Premium for 1 year ($99) from @office to #getitdone @babylovingmama #ad #giveaway http://t.co/N5K2BHfCnm": 0, "@MattHDGamer The power of Microsoft...": 0, "RT @LiveSpeakRadio: http://t.co/KOfDcV03Js #Google #Microsoft #scroogled #wearabletech #wedoitlive #livespeakradio": 0, "Partner Account Executive Job: Microsoft - Kuwait - Job Category: SalesLocation: Kuwait http://t.co/xXyfi6PKCK": 0, "Really glad Microsoft word has a word count so I don't have to sit here and count every single word.": 0, "Microsoft might be beating Google at retail http://t.co/1vHoauHAKj via @lydiadepillis": 0, "Once Upon a Time: Long standing questions will finally be answered on the... http://t.co/wAtq3JqMPX via http://t.co/tXjObGiDiU": 0, "WINDOWS 8 I HATE YOU SO MUCH AND YOUR STUPID SIDE MENU RIGHT NOW. thanks for killing me in-game microsoft gg": 0, "After @Xbox #XboxOne sales exceeded 1M units I can see the bright future of @Microsoft &amp; now wait to see their very own #smartphone soon": 0, "Microsoft's Xbox One joins the game - http://t.co/O30L9A9AYl http://t.co/upbRGQzkqs": 0, "Just seen the infamous blue screen on my PC. Microsoft has a crude way of telling you to buy a Mac.": 0, "Motivate your Mondays! Be productive yet fun with the Hide Your Notes app FREE on #Windows8. Download now: http://t.co/Rbt7UEDsJS": 0, "YesRT@Chet_Palumbo22 Is there anything more intimidating than a blank Microsoft word document knowing how much writing you have ahead of you": 0, "@_alastair @AntDeRosa Microsoft built their own version from scratch for the Xbox One, etc.": 0, "@lesliej_k cool!  I used to work for Microsoft in Redmond (Red West and Millennium bldgs). Are you based in Boston?  Nice to meet you.": 0, "@ClaytonMorris A little bigger and Microsoft could have spared us from Windows RT.": 0, "That awkward moment when Microsoft Word informs you your name is spelt wrong. http://t.co/Prd6w0fPjX": 0, "@Microsoft So not only was launch late, yet many are defective? How do you manufacture \"dead\" consoles? \n#xboxonebroken #xboxone": 0, "@kathyrogonza Please take a moment to let us know how we're doing at http://t.co/JRg8c9F135. Thanks. ^JVO": 0, "very frequent updates for #Microsoft Office for Mac 2011. #apple #fb": 0, "Should Microsoft ditch the Xbox? http://t.co/N6Kj54pGO6": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/9bm2GItjeD": 0, "Damn! Funny: Pretty much http://t.co/cT95bchOOl via http://t.co/fnTDKnNbKt #funny": 0, "RT @mAloud_wpApp: I have no data yet. It is a capital mistake to theorize before one has data.  - Sherlock Holmes. m.Aloud windows 8 http": 0, "#GetSpiced Microsofts Xbox One vs. Sonys PlayStation 4: The future is now! Last week, So... http://t.co/nepIjGh3BO Via @spicesofafrica": 0, "@whosjenna  you open up microsoft word": 0, "@reckless The nfl gets that Microsoft money not Fox.": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store http://t.co/4jK2kaBtsY #news": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/OPJgc0rmlw": 0, "http://t.co/hPfhCSmh2r: Jordin Sparks hits the AMA red carpet in a super-spiky gown!\n... http://t.co/xZZXfJcg7l via http://t.co/lZ21fxpl5d": 0, "RT @alexisohanian: I'd like to use this tweet to remind that software patent reform died in the House thx to IBM + Microsoft http://t.co/KE": 0, "check out the Microsoft surface!": 0, "RT @FinlandNY: .@nokia, once the worlds biggest #mobile phone maker, is reinventing itself. Again. @TheEconomist: http://t.co/28NabuD8mx #": 0, "MMA Fight Club: Oh F***!! http://t.co/vGxp2sdUCG via http://t.co/ABUaH7ML8Q #mma http://t.co/FJnK3nv4nH": 0, "RT @ChuChuTrain: taking a well deserved break after opening Microsoft word": 0, "We just shipped Visual Studio plug-in 0.99.1, which hopefully addresses the issues with 0.99.0. http://t.co/tWcMXs3Yyc": 0, "Microsoft is America's most inspirational company waaaaat?": 0, "RT @Erry_dey: Thank God for autosave on Microsoft Word": 0, "@AJMertz @taiping2 he's going to two private homes in Medina (former Microsoft exec.)": 0, "@travisdwoo because Microsoft likes to keep it a little more gangsta": 0, "@GameStop @Microsoft so what happens to my $10 upgrade for ghosts and BF4 if I can't get a Xbox one by 12/31 because they are sold out??": 0, "Microsoft : Unfinished Xbone with innumerable errors, force kinect interfacing.\n\nSony : Blue lights, eats discs\n\nNintendo : Fully functional": 0, "It's a good day when Microsoft Word finally recognizes my name as an actual word and not a spelling mistake": 0, "@johnneh cant say i have but its on the Xmas list now from whatever pennies i can muster after paying Microsoft my entire Xmas wage": 0, "Marc Benioff To Steve Ballmer: Yes, You're 'An Emblem Of An Old Era' And It's Time To... http://t.co/6S1vK7NrAx": 0, "RT @virendra170189: shared a link http://t.co/nOc6vamMao": 0, "Microsoft Addresses Xbox One Hardware Problems. Day one, can't expect everything to be 100% up and running. http://t.co/wr6U7E30ZO": 0, "Amazing shoes and bags: new image http://t.co/quQOiLJiMm #fashion via http://t.co/qiQqBbpNxe http://t.co/YoWQFaj6GV": 0, "The game has changed for Microsoft and other industry giants. Here's how it will affect the company's new CEO: http://t.co/NusXdGxhCU": 0, "Spokesperson says purchase of the 3-D sensing company behind Microsoft's Kinect sensor is a done deal. http://t.co/M8KCJ5kVXD": 0, "#VIRAL: Microsoft starts selling anti-Google merchandise http://t.co/CNv0vVpCSJ": 0, "@elviobr Thanks for getting back to us. Try the steps at http://t.co/TcTyw5gY92. Let us know if it helps or if you have questions. ^JVO": 0, "One Microsoft Way: Half an operating system: The triumph and tragedy of OS/2 http://t.co/Up0nKGguVW": 0, "@Microsoft_Zach I don't want you to have it cuz then you'll know it's me when I sext you anonymously...": 0, "RT @TheTechn0sexual: #Fuckery Everyone seems to be buying windfarms... #Microsoft #Google &amp; now -- #IKEA Invests In Canadian Wind Farm htt": 0, "http://t.co/s2pgtCQZ1x found article on  http://t.co/EdUeuIq4Ul  Campaigners angry over Microsoft  Skype #privacy #ruling": 0, "@amandaxlouise @radhasvibes have fun with Microsoft paint for the rest of eternity": 0, "Evaluate and give advice to students by installing this Win 8 app http://t.co/E6yVHywTm2 #windows81 #seo #CallOfDutyGhosts": 0, "Access DB Creation For Insurance Agency by gabrieljanusa: Every month we receive insurance commission statemen... http://t.co/bldI6iVdba": 0, "RT @ruse: Nothing like staying up to date Phil! \nhttp://t.co/ZT1DxIsyxK": 0, "\"@tomwarren: Apple confirms it has acquired the company behind Microsoft's Kinect sensor http://t.co/FAkhLtjVAr\"": 0, "RT @HUTLeafs: Just letting ppl know my team for HUT that i am selling is for PS3, i want 50 dollars Microsoft points because i got XBOX 1, ": 0, "Goodbye, Microsoft. | \"Apple completes buyout of Kinect sensor company PrimeSense\" http://t.co/aNFh67HG9y": 0, "@xboxsupport3   people have been using Free Microsoft point genarators. P.s good luck with further development ;-)": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/7iMNfQTkW4": 0, "RT @surfer5671: Assist UCLA game design students better game design by using this link: http://t.co/C9QL7yQl48 #Win8 #FunApps": 0, "Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsofts Kinect Tech: Apple has acquired Prime... http://t.co/GGB26cLsYy": 0, "RT @c_e_l_e_b_s: 50 Cent: #frigopopup FRIGO REVOLUTIONWEAR party in NYC. http://t.co/Y6HSPqI7cR via http://t.co/lZ21fxpl5d #celebs http://t": 0, "The Microsoft Store has Xbox ones in stock.": 0, "RT @lilmoekarols: \"@TheComedyJokes: Dear Microsoft Word, I'm pretty sure I spelled my name right.\"": 0, "Microsoft cursive epilepsy countersign rescue: a compulsion entryway facet anent omission disappearance: euJoaOph": 0, "@GamerBillbert Thanks for asking. See http://t.co/kvC03FJj2u for a possible solution. Let us know if it helps or you have questions. ^JVO": 0, "RT @TechCrunch: Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours, But Takes 11 More Countries To Do It http://t.co/v3r2uF87": 0, "RT @Perficient_MSFT: Thanks for sharing! RT @Justinvolved Ways to Expand on Sitecores Content Personalization Capabilities http://t.co/gHh": 0, "The future of Windows - Microsoft's devices head hints at further OS unification http://t.co/ipSwwtUJf7": 0, "Microsoft's SkyDrive app for Apple's iOS gets automatic photo uploads, and a ... - GeekWire http://t.co/5Qm6fUDai6 #apple Digital Trends ...": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg: Microsoft Corp. (MSFT) said it... http://t.co/CnzxB8jsg0 #tech #news": 0, "@businessinsider let me guess: unless u want a Microsoft style anal cavity search get in bed with Big Gov &amp; seek that rent? #cronycapitalism": 0, "RT @tbhfuckoffpls: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/D7o77zVsE5": 0, "valid license key and I still have to call Microsoft...what the heck. #stupid": 0, "Orphan Black: new image http://t.co/jmC0ILq3Bp via http://t.co/tXjObGiDiU #tvshows": 0, "RT @TAS_technology: Apple surpassed Mic... http://t.co/icJLrIuqn4 #technology #tech #technologyfacts #technologyfact #techfacts #techfact #": 0, "RT @windowsserver: Success with #HybridCloud: The Components of a Microsoft Hybrid Cloud in detail http://t.co/O3CaB8bgUr #WinServ": 0, "Rumor: Microsoft in talks to acquire Winamp and Shoutcast from AOL http://t.co/r3dB8gMdK7": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/wuT7FZ0goy": 0, "am I crying because microsoft word isn't working or am I crying because Blake opened my snapchat and didn't respond? idk": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/2gJ0WJxxBU": 0, "Dug out my old 360 box. Microsofts Xbox branding has definitely matured in the past 5 years. #XboxOne http://t.co/HFjMopTbw6": 0, "Candice Swanepoel: new image http://t.co/cg7FPZY0Jc via http://t.co/PEiph2vUXV #fashion": 0, "I'm glad Microsoft Word knows the difference between affect and effect because I sure as hell don't. #stillconfused ": 0, "@Jetlife_DJ: MICROSOFT @Dat_Guy_Yung: Wats the word": 0, "Color-changing mouse for Microsoft Windows PC and Mac OS http://t.co/S1a7We3EUD": 0, "Microsoft is losing people to as Oklahoma State. http://t.co/ts5vMtShFG": 0, "TheWrap: VIDEO: American Music Awards Live-Streaming the Red Carpet #AMAs http://t.co/ijZke23ms3 via http://t.co/lZ21fxpl5d": 0, "@schulte_shuffle duh but even Microsoft's figured they should output audio through it.": 0, "#microsoft office 2010 proofing tools http://t.co/zMO7KcCQ2k": 0, "RT @YoungBased_Josh: I leave the pussy Microsoft like Windows Vista": 0, "Biggest #Xbox launch ever: #Microsoft says it sold 1M #Xbox Ones in less than 24: VentureBeat: Microsoft said ... http://t.co/aGAATK0tDN": 0, "Can't believe it took more than 4 hours to install @Microsoft office all because of some server issues &amp; I still have issues": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership - Neowin http://t.co/dJi5G47y4N": 0, "Using @bing on @InternetExpoler and it says 'Get to bing search faster with Internet Explorer' Really @Microsoft !! http://t.co/DUiKr5NS57": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/snYjNygEiL": 0, "Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours But Takes 11 More Countries To Do It http://t.co/oE8JnO0a9C via @techcrunch": 0, "Dear Apple, I hate you. Bring back Microsoft.": 0, "Google Nexus 10 2 vs. Microsoft Surface 2: Which 2 is a Better Buy? - International Business Times AU http://t.co/YarQiZiv2R": 0, "Microsoft updates remote desktop apps for iOS, Android and Mac OS X |... http://t.co/MpIemlnbMZ": 0, "fuck having a Mac when school uses Microsoft everything uhuuugghhhj": 0, "No Surround Sound When Playing DVDs With Windows Media Player: Hi, I'm currently running Windows 7 Home Premiu... http://t.co/tevlTzKF7c": 0, "\"Don't get Scroogled,\" Microsoft warns in leaked video http://t.co/B3uSvJbqLO": 0, "Microsoft Future Vision 2011 - future of productivity - HD: http://t.co/GDhMrtHIRm via @youtube": 0, "How the heck do you make a brochure on Microsoft word on the Mac": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/CwfoHwDswr": 0, "RT @KrisWB: #XboxOne console breaks sales record. More than 1,000,000 sold in 24 hours. http://t.co/4Tc0pJUxF8 #XboxOneLaunch #ThisisXbox": 0, "@nokia @Microsoft @Windowsphone #twitter feed in people hub stopped updating since last Tuesday &amp; it seems many R suffering from this issue": 0, "@BenRubery That's dangerous.... You're converting to Microsoft?!": 0, "RT @forbes: A San Francisco startup takes aim at Microsoft's $20B cash cow http://t.co/wYz8IlFpda": 0, "RT @tealtan: @_alastair @AntDeRosa Microsoft built their own version from scratch for the Xbox One, etc.": 0, "@kappley @Microsoft @whymicrosoft @MicrosoftStore Pretty bad when a #Microsoft employee agrees that the company's operations are a sham.": 0, "Is it fitting that I found the salesperson at the @Microsoft store less helpful and harder to understand?  #applestore": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/O8ZFuOLYPU... http://t.co/OexZZQRnYN": 0, "New York City may still have lots of Xbox One units for sale: Microsoft may have claimed that the Xbox One is ... http://t.co/PnstTV0IdG": 0, "RT @Microsoft: Join Microsoft employees supporting ISHA Foundation and other youth causes #GivingHero: http://t.co/iUYR664Gtx http://t.co/b": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console, BRAND NEW SEALED: $680.00 (0 Bids) End Date: Monday... http://t.co/P2IlW1LLCS": 0, "Does anyone have Microsoft office for macs that I could download?? #please #help #computercrashed": 0, "F1 Around the World: new image http://t.co/8zTPFQLOSq #F1 via http://t.co/u6brH2PXVg": 0, "What the Xbox One tells us about the new Microsoft' http://t.co/ImcpytERjq via @Appy_Geek": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/VQiwTew6Gq": 0, "Microsoft Planning To Unite Their Windows Operating Systems via Ubergizmo - When it comes to ... http://t.co/5Ypuxnb9ge": 0, "Microsoft hints at wearables coming next year: http://t.co/h7lw0pUYOn #iot #wearables": 0, "RT @HuffPostTech: Does Microsoft even need Xbox at this point? http://t.co/miQcED05Tj": 0, "Dear Twitter, Microsoft sucks. Sincerely, an irritated college student.": 0, "How the wall came down between Microsoft and Xbox - 42Kmi http://t.co/owvoLfQYle": 0, "Hiring a Microsoft Software Configuration Engineer job in CT in Wilton, CT http://t.co/e1PiTlvBt6 #job": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/wT7sSwIDEA": 0, "Apple finalizes the purchase of PrimeSense, company behind Microsoft Kinect, http://t.co/bKgC8kO4xu": 0, "FITE ME @MICROSOFT": 0, "@Jason_Rubin @Stealth____ that doesn't apply to Sony or Microsoft as well?": 0, "******** Giveaway Winner ******\nIts that time again! This Weekends Winner of Microsoft Points or PlayStation... http://t.co/3PcOeFRKsS": 0, "Some of Americas largest technology and telecoms companies, including Facebook, are backing a network of... http://t.co/Vue1YMGwQA": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/BuYpkYrLL9": 0, "Xbox One: Microsoft ships consoles off two weeks early by mistake http://t.co/lq6h53CTUx #SocialMedia": 0, "There are only a select few who can say they spent portions of their childhood making cartoons on Microsoft Paint": 0, "I've lived my whole life thinking tomorrow was spelled tomarrow\nand I wondered why microsoft word always tried to correct me": 0, "@lukavcl03 Nintendo is cool but my brothers are bigger Microsoft fans.": 0, "'Microsoft Planning To Unite Their Windows Operating Systems' http://t.co/odLHPiYF8u": 0, "RT @manguilgrand: It's sad that Microsoft has to mention the iPad in their commercials just to get people to consider the surface.": 0, "@Mike4Crabtree Please take a moment to let us know how we're doing at http://t.co/4fqDYiQeaP. Thanks. ^JVO": 0, "Microsoft Planning To Unite Their Windows Operating Systems http://t.co/JNqptc5qY9 #MS": 0, "@EricDJuly I'm already knowing... It's lookin real good for PlayStation right now, since microsoft act like Dey can't ship out more systems": 0, "#XboxOne Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One consol... http://t.co/Xxvcjw1COL": 0, "Accepting Applications: Java Developer with Microsoft SQL (T-SQL and SQL administration) in Memphis, TN http://t.co/F08r0azK2p #job": 0, "I wnder  how many sales Microsoft had on the Xbox One.l": 0, "Now this is real passion for your company http://t.co/mlJ3VpbEDo": 0, "Candice Swanepoel: new image http://t.co/VTZMLdCtvt #fashion via http://t.co/PEiph2vUXV http://t.co/DBHDEok8Fd": 0, "@majornelson , I have 2 Xbox ones and both are having issues. Microsoft support was no help,": 0, "Check out these funky dance moves! http://t.co/5Q8Awzlzdz #jd2014 #ubi #jdtv": 0, "#AlltopTwitter What Games Are: Xbox One Is Microsofts Spruce Goose http://t.co/VJMNY9zkuy #elaineossipov #twitter": 0, "RT @BingAds: Have you checked out the Bing Ads Agency Hub? http://t.co/zuJdBMReUc #marketing #advertising": 0, "Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsofts Kinect Tech http://t.co/IcQDGjuME9": 0, "RT @MSLearning: Watch the re-broadcast of the Microsoft #Virtualization training course tomorrow &amp; Tuesday for a free exam voucher http://t": 0, "http://t.co/Roc6gFIq7L: EXPRESSIONS: MASON HO\n\nMason Ho raps out about winning Sun... http://t.co/3QX7Idrj7S via http://t.co/mn3EFmuNyP": 0, "RT @pgralla: Microsoft 'Scroogled' campaign gets early holiday gift: Google evangelist calls privacy an \"anomaly\" http://t.co/9sABvwBTwi": 0, "Xbox Is a Test for the One Microsoft Strategy http://t.co/j8njCcgS27 via @BW": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/M1fmrgH8DV": 0, "RT @BloombergNews: More than 1 million Xbox One consoles sold in less than a day: Microsoft | http://t.co/oUI2s43LMB": 0, "Apple has confirmed its acquisition of PrimeSense, the startup behind the 3D sensor in Microsoft's Kinect camera. http://t.co/L83r9lu8XO": 0, "Sustentative webstore explication upon microsoft kinesis rms: xcMyJYqW": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/kuPiWrNvMq #tech": 0, "Microsoft video attacks Google's Chrome as surveillance technology - Boing Boing http://t.co/7yRh1FQtdp": 0, "Swag #xbox #xboxone #microsoft http://t.co/WcdPhHjE8T": 0, "What going on with MY Microsoft Word hoss?! Steups..": 0, "Funniest tweet this morning. \"@PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits\"": 0, "@PickUps4Christ: I like my men like my Microsoft Word documents...SAVED!": 0, "Microsoft Corporation (MSFT): The Microsoft Future... One More Time $MSFT http://t.co/qZDvotyheB": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/8hpkKEIsqW": 0, "Xbox One Kinect Voice Commands Now All Available on Microsoft Tumblr (LINK) http://t.co/7jCakZe8qo via @cheerup_us": 0, "Why didn't anyone tell me that @XboxOne #ghosts multiplayers can't play with #xbox360 multiplayers. That sucks. Microsoft make that happen!": 0, "Candice Swanepoel: new image http://t.co/r5UsAJa4JN via http://t.co/PEiph2vUXV #fashion": 0, "Turn Windows Phone into a magic wand for Microsoft Office presentations http://t.co/oDHB94vwyh via @windowsblog": 0, "I'm thankful for the synonym application in Microsoft word": 0, "La.espera valio la pena #picoftheday #xboxone #microsoft #videogame #gamer #happy #xbox #great #weekend http://t.co/WPQTUCuIyQ": 0, "Facebook and Microsoft Help Fund Right-Wing Lobby Effort, Report Finds | Alternet http://t.co/kldj1HzpIQ": 0, "Buy me Microsoft points": 0, "I've stared at a blank page on Microsoft word all day, and still no theology rough draft done...": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console (NTSC): $689.99 (0 Bids) End Date: Monday Nov-25-2013... http://t.co/Gjgevz1fF4": 0, " http://t.co/lPKPUAFKW6 18 Winamp | 'AOL wil Winamp verkopen aan Microsoft' | how to meet people | watch movie on ipad": 0, "Showtime Networks: Would you go all the way for science?\nPlay along, down... http://t.co/T7on49BeFS via http://t.co/tXjObGiDiU": 0, "http://t.co/JLgAhgcNC4: A charger at Pascuales is given a little time to rec... http://t.co/5pNQ74ctuu via http://t.co/mn3EFmuNyP": 0, "@chanelthick: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/ch6KHDSgsq": 0, "Oh and making \"Lumia Exclusive\" apps aint going to expand your OS Microsoft xxx": 0, "Refer microsoft critical success in company corridor easy never mind facing cowl lace servers: WLl": 0, "why on Microsoft word on the MacBook Pro does it only let me see page one and not the other pages? someone helppppp me #teplytweet": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/Wx5B07R5Vb http://t.co/Wp1iCV98vU": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/y608bIPVdm": 0, "Halo programmer departs Microsoft for Naughty Dog - Polygon http://t.co/8XbC5Pcp94": 0, "What's new in #WS2012 R2?  PaaS for the modern web and hybrid networking are two great examples http://t.co/VwGoQ1qMqR": 0, "Microsoft took the build idea for Xbox one from the ps4": 0, "The Be Brave Microsoft commercial cracks me up.": 0, "Jaguar looks to land young drivers http://t.co/126LWtb4op via http://t.co/3cVMRz99nh #worldnews": 0, "#Just thnk how different the technology landscape would be if Microsoft hadn't been prevented from integrating their products for a decade.": 0, "Insanely Funny Shit: new image http://t.co/rEv9bWVgyu via http://t.co/fnTDKnNbKt #funny": 0, "70-664 microsoft lync bailiff 2010, configuring great go is specially habitual in place of professionals upon s...": 0, "RT @HardwareNewz: A closer look at the Xbox Ones launch woes: Microsofts faulty and scuffed consoles - http://t.co/IMsqXQ0yXy - itproport": 0, "[AllThD] AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/HFzeU03jvj": 0, "Dad, Microsoft Office 2003 happened in 2003- 10 YEARS AGO.  I think it's time for an upgrade.": 0, "Xbox One launch day woes for Microsoft as some users complain of disc drive issues. http://t.co/3PlpzJypb0": 0, "@Bradmaster240 Got it. If you sign in at http://t.co/3kQCQmzbiZ do you see any notices on your account at all? ^AD": 0, "So, if I have this right, Microsoft is telling me that buying their tablet is an act of bravery at the end of each commercial. Infer away.": 0, "@EvictTheseWords @Microsoft @whymicrosoft @MicrosoftStore You made Microsoft tech support break the script? Someone's getting fired.": 0, "Sally Fitzgibbons: TouchDown in Toronto!!One more flight to go : ) http://t.co/RX34o4WYpJ via http://t.co/mn3EFmuNyP http://t.co/OnPsXxWPi4": 0, "RT @boyroberts: Xbox One console breaks sales record http://t.co/gVywn7y2Vv": 0, "@_luispaez_ Technically speaking, I've been with Microsoft since the 360 in 08' lol": 0, "@Benbbjcrew_real We have some great apps to get work done: http://t.co/5lGJalivPb - You can check 'em out!": 0, "Essence Online: The stars are arriving to the 2013 American Music Awards... http://t.co/cExzWD1QFo via http://t.co/qiQqBbpNxe": 0, "The Windows 8 phone setup is the most frustrating thing I have ever encountered @Microsoft": 0, "Google puts down Microsoft for selling Scroogled merchandise http://t.co/MkOsAKTws7": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/XqRfzJMDc1": 0, "RT @SexMahone: I'm at the Microsoft store using my iPhone.. Ooooo the contradictory": 0, "RT @BloombergNews: More than 1 million Xbox One consoles sold in less than a day: Microsoft | http://t.co/bfHJ5KYESY": 0, "Download Nature Themes for Windows7 from the Artist Raymaker See: *** http://t.co/MKG2X75jHt": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live ...: Ray Cox IV, who curren... http://t.co/pvLDCgcT9d #blackmannrobin": 0, "Photoset: buzzfeed: Every Pixar movie summarized in terrible Microsoft Paint drawings. http://t.co/IsPwnwbvQC": 0, "Microsoft updates its OneNote Metro app with Share Charm integration, camera scanning, and OCR support http://t.co/jasbXfAFce by @epro": 0, "@fxshaw I want to know what the Xbox one sends back to #Microsoft. Does it track what I watch? What I play? How many people in the room?": 0, "RT @JamesASmithescu: Xbox One Kinect Voice Commands Now All Available on Microsoft Tumblr (LINK) http://t.co/7jCakZe8qo via @cheerup_us": 0, "Amazon Microsoft Black Friday Schedule - News - Bubblews http://t.co/7t7uHZIGjE #bubblews": 0, "Funny Wall Photos: new image http://t.co/y7PqsS4CUM via http://t.co/fnTDKnNbKt #funny": 0, "Breaking down Iran's nuclear enrichment programme http://t.co/Um6kgpXiti via http://t.co/3cVMRz99nh #worldnews": 0, "Microsoft Dynamics NAV is an accounting system that can grow with your business http://t.co/I3gGhanbLv #MSDynNAV #ausbiz": 0, "RT @VTTechnology: Updated. Hyper-V: Survival Guide : http://t.co/tB63Q6obKt": 0, "Okay fuck you Microsoft word, I won't do my fuckin homework then FUCK": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/WFzCJ2cvM7 #technology": 0, "#Microsoft #Software #Configuration Engineer #job in #CT (#Wilton, CT) https://t.co/KOwE7XH6gV": 0, "Damn! Funny: tut tut tut http://t.co/wkW31lDXqj #funny via http://t.co/fnTDKnNbKt": 0, "Ford microsoft mcsa empowerment modernized the premier get under way: SrYMUNhx": 0, "RT @CNET: What console war? Microsoft sells 1 million Xbox Ones in first 24 hours http://t.co/DLiygaplyZ": 0, "I favorited a @YouTube video http://t.co/tbMRLHLqQP EMIT - MICROSOFT": 0, "Wrasslin/Football/Microsoft Excel": 0, "F1 Around the World: new image http://t.co/X99tE1JwSe via http://t.co/u6brH2PXVg #F1": 0, "shit I don't have Microsoft word. shit fuck": 0, "MMA Fight Club: DEC 7 http://t.co/h7YkiVCjGU via http://t.co/ABUaH7ML8Q #mma": 0, "want a discount on a Microsoft Surface Pro? talk to me about a code to get a discount on http://t.co/rKX9YD9Cn4!": 0, "I Love Funny Pics: new image http://t.co/3MvW3pv6yA via http://t.co/fnTDKnNbKt #funny http://t.co/3j33rd8zF1": 0, "Quoted: Nathan Myhrvold on how Microsoft and Google are different http://t.co/YS99h2Aw9K via @siliconbeat": 0, "A Halo 4 programmer left Microsoft to team up with Naughty Dog http://t.co/LPuUNG4au7": 0, "If you're good at Microsoft Excel, please help me ": 0, "I'm going to #GetItDone with Office 365! You can enter to too from @JackieCross http://t.co/HWA39eqQ9R": 0, "Set de fotos: buzzfeed: Every Pixar movie summarized in terrible Microsoft Paint drawings. http://t.co/KzojIlzE4w": 0, "RT @canadacomTech: In leaked internal video, Microsoft warns web users not to get \"Scroogled\" by Google http://t.co/OFVqYvX3rF": 0, "RT @KingJohnson_32: @_luispaez_ Technically speaking, I've been with Microsoft since the 360 in 08' lol": 0, "Scroogled: the Microsoft attack ads that treat Google like a political ... http://t.co/GZgRfNG9Sj": 0, "*To monitor WebAthenticationBroker traffic with #Fiddler add a loopback exemption to the microsoft.windows.authhost.* AppContainers #win8dev": 0, "I liked a @YouTube video http://t.co/tbMRLHLqQP EMIT - MICROSOFT": 0, "@jbromez i opened microsoft word and cried tbh": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/dkYbQwXdXt": 0, "Does Microsoft Even Need Xbox? http://t.co/1Ptouvk8Ao": 0, "The Xbox used to be Microsofts ugly stepchild. Not any more. http://t.co/oE5b0LlpEK": 0, "Naughty Dog hires Halo 4 programmer Corrinne Yu http://t.co/hvSd8lAFHT\nBillion dollar game to unknown company.  @Microsoft @retweet_google": 0, " http://t.co/B3q7hNLGxY 26 Office 365 | Microsoft's Office 365 Gets Encrypted Emails From Early 2014 | enable javascript see application |": 0, "Microsoft DNS servers down; Hotmail, http://t.co/c2jydRbVhK , others down  #microsoft #dns": 0, "RT @infowarsstories: Microsoft Ends MSNBC Joint Venture After 16 Years Over Fears it Was Too Left Wing: Daily Mail | One of the facto... ht": 0, "Apple or Microsoft? Why not both? http://t.co/3r48c4gXQ5": 0, "RT @NHl14_HUT_360: Selling my whole team for Microsoft points please DM me I'm selling them cheap RT this please @hut_trades9 @NHL14TRADEHU": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/qeprr2ewlO #tech #news #web": 0, "@AdamFowler_IT Given how limited the feature set is, I think Microsoft should already be talking publicly about the next big update.": 0, "@Microsoft @MicrosoftHelps Microsoft Word can suck my fucking dick after it FORCED CLOSED and ERASED my ENTIRE paper AFTER I SAVED IT": 0, "F1 Around the World: new image http://t.co/EUin3ODwjK #F1 via http://t.co/u6brH2PXVg": 0, "RT @SlickHomieQuan_: \"@JibriMontega: Leave the pussy microsoft like windows vista\"": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/DjN4HRTYfL": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/Y7V1EHUt3S": 0, "Love Quotes and Sayings: Love Quotes and Sayings http://t.co/qrZAdHWriY via http://t.co/gxktWhKfbI #quotes": 0, "#GetSpiced Microsofts Xbox One vs. Sonys PlayStation 4: The future is now! Last week, So... http://t.co/523Tsn933v Via @spicesofafrica": 0, "Watch the re-broadcast of the Microsoft #Virtualization training course tomorrow &amp; Tuesday for a free exam voucher http://t.co/IceBc2n69K": 0, "Microsoft Releases All the Xbox One Voice Commands for Easier Navigation #videogames http://t.co/PPNnSCvurQ": 0, "UCLA game design students improve their design chops use this link to download the Win8 Store app: http://t.co/ukVCsHQmIY #Win8 #FunApps": 0, "What Do Iranians Think Of The Nuclear Deal? http://t.co/HRICjfpXuv via http://t.co/3cVMRz99nh #worldnews": 0, "Of course google probably has enough money to actually buy all the mugs microsoft could create.": 0, "I liked a @YouTube video from @itsknd http://t.co/lfT2j3yHTu I WON A FREE XBOX ONE!! THANKS MICROSOFT!!!": 0, "If you need an accurate, neat and organized typing job, then here's a virtual secretary that always delivers on time. http://t.co/vYyZ55ePVx": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console w/ Kinect + 11 Games: $149.99 (0 Bids) End Date: Sunday... http://t.co/ZIaluD682x": 0, "Insanely Funny Shit: new image http://t.co/i6JjHoiq4A via http://t.co/fnTDKnNbKt #funny": 0, "Why is it so fucking difficult to install Microsoft on my computer. No wonder everyone has a fucking mac this is bullshit": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/K5Gt07cbWG": 0, "Kind of weird that NFL is sponsored by Microsoft Surface but there are Kindle Fire ads on the Fox NFL set?": 0, "#Movies: Microsoft's Xbox One sold 1 million+ units in 24 hrs.  If you're feeling dj vu reading this, it's l... http://t.co/Hsjnp87M49": 0, "RT @DiscountSoldier: Microsoft Office Professional Plus 2013 is available for $9.95 for active military and reserves ... http://t.co/rzGNQu": 0, ".@Microsoft literally has a webpage titled, \"What to do when Internet Explorer stops working.\" How about just MAKE THE SHIT WORK. #Microsoft": 0, "Microsoft Xbox 360 20 GB White Console W/ GTA 5, NBA 2K14, Madden 25, and More: Price 125.0 USD (0 Bids) End... http://t.co/UfLaWidLpk": 0, "@fxshaw #Microsoft, its simple, to describe, unless you dont want us potential customers to know that youre selling us.": 0, "@ynefel @AlexAndHisPants \"I am an entitled gamer. Microsoft should be paying me!\"": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/l4v9JAIrlX #apple": 0, "Microsoft Research Connections Blog - Site Home - MSDN Blogs http://t.co/jgMDrrchFh": 0, "Development Manager - USA-CA-Rocklin: Esurance systems are built using the latest Microsoft and Java technolog... http://t.co/uRzKkyKgx1": 0, "Microsoft Xbox One Day One Edition 500 GB With Any Game And A Year Of Xbox Live http://t.co/MtiuuvKaaa": 0, "#Microsoft #News: \"AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside ... - AllThingsD\" http://t.co/CFpFrBATJp": 0, "So it's ten past twelve and me and Brandon are discussing our favourite fonts on Microsoft word @Brandotron_": 0, "Microsoft Word- squiggly green line Fragment (consider revising) thanks for the help.......": 0, "wow c Xbox has ven gotten to Toonami? super aggressive marketing by Microsoft.": 0, "Thank you microsoft for being the main reason why world laptop sales went down by one more": 0, "Microsoft make your Xbox ones faster goddam": 0, "RT @msdev: Enrolling at Microsoft Virtual Academy is as easy as signing upor signing in. Class is now in session: http://t.co/6dmbPiHTK4": 0, "Really Microsoft? Who counts from zero to 360 and then to one?": 0, "Win a Microsoft Surface from Sweepstakes Advantage http://t.co/3KBqsN40J7 via @PunchTab": 0, "RT @TechFaster: Now this is real passion for your company http://t.co/mlJ3VpbEDo": 0, "Lady Ga Ga Thank You To My Brand http://t.co/nWggjy519g My Schedule Was To Hectic To Be On Stage Right Now Yourself?": 0, "RT @justfollow61: Nintendo congratulates Sony and Microsoft! http://t.co/jjMu2oVNSB via @imgur": 0, "Microsoft's way of handling defective consoles is so legit. Check this out.  http://t.co/FLMzX718Tf #XboxOne": 0, "@Xbox @Microsoft @Majornelson \"'Xbox: Where's My Free Game?'\" http://t.co/cXy78CQ6IF": 0, "Steve Miller Band: A crate of Papyas! http://t.co/RUZjW2P2Hq via http://t.co/ZY1cU2DvHH #rockbands": 0, "Join @Microsoft employees supporting ISHA Foundation and other youth causes #GivingHero: http://t.co/TOHDgHiRwQ http://t.co/S40QQeNw5O": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/C2ljg65fle": 0, "It is just fitting that the Microsoft is doing very well with its XBOX One Sales: http://t.co/rkLk6U8X1C": 0, "Welcome to Sony, Corrinne Yu (Halo and Microsoft's top program engineer). Enjoy being on a team with Naughty Dog": 0, "UCLA computer science students in learning how to use feedback from players, use this link: http://t.co/HMdvRszkfQ #Win8 #FunApps": 0, "Transfer pricing: how to grossly inflate a country's GDP or legally evade taxes. http://t.co/7OO1pIDBW1 #singapore #apple #microsoft": 0, "Microsoft Xbox One IN HAND READY TO SHIP Launch Edition- 500 GB Black Console: $525.00 (0 Bids) End Date: Monday... http://t.co/YbjcDTpjl2": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/hri9JaQq80": 0, "Weired anti #Google campaign by @Microsoft. They call it the #Scroogled store. Sorry Microsoft but that's weak! http://t.co/vYZHisJ9fT": 0, "Microsoft video attacks Googles Chrome as surveillance technology | Thought FTW http://t.co/fUOGhoL1DO": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/jrrVGqDhn3": 0, "@HaloWaypoint @XboxSupport @Microsoft Day1 2001 November 15th, i remember it vividly,my GT was Probably one of the 1st you ever had DeSnake": 0, "@masoncrawshaw he was just in Jacksonville for the opening of our Microsoft store": 0, "my xbox is a piece of garbage.  microsoft sucks the big one...where is my playstation 4?": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/JFtVZdfZxV": 0, "My short term memory loss makes me forget things every 14 minutes so thank the Lord for the Microsoft Exchange emails every fifteen.": 0, "MICROSOFT ACCESS 2010 by noorelmie http://t.co/1HlY6Bw0SX": 0, "How to Recover Deleted Word Document files: DOC is a Microsofts proprietary word format used by Microsoft Wor... http://t.co/CffqahVr8U": 0, "Officially tweeting from my brand new @Microsoft Surface Pro 2! SO OBSESSED!": 0, "Insurance Firm Chooses Microsoft over Google for Easier-to-Manage Online Services http://t.co/78NnoGj6Kv": 0, "Download Windows7 Sci-Fi Themes by the Artist Arcipello http://t.co/LO3Ces3SmR": 0, "RT @NigelFenwick: Tech news: Microsoft to buy Nokia phones arm http://t.co/YJWqXecMDX": 0, "Microsoft moments is out! http://t.co/u79yftSspi": 0, "@_TLambright im hoping for it in windows 9. Don't disappoint me microsoft": 0, "RT @CRPDisabilities: Developing #Accessible Applications for Windows Phone - #Microsoft #Accessibility Blog http://t.co/HOvx6UZMuO": 0, "@PetiteImouto me too!my computer is xp!too late!so I use iPad now.it's Microsoft and McDonald's big": 0, "Microsoft 70-669 questions differently answers sullens: RcGg": 0, "IOW making use of an electronic spreadsheet by microsoft..": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search: In case you missed... http://t.co/RqTjqs0UJ5": 0, "Breaking News: Apple Buys PrimeSense, Company Behind Microsoft's Kinect... \nhttp://t.co/MOjiBhErzu": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/XZ4sIX9ueC": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/K0EV2eWrdZ": 0, "Microsoft Announces the 2014 NZ Expert Educators and Mentor Schools http://t.co/B0kbC59iFZ": 0, "Xbox One console breaks sales record http://t.co/pHc3p3ZIjR": 0, "227's YouTube Chili' Microsoft Planning To Unite Their Windows Operating Systems: \n\nMicros... http://t.co/5cZsiawQU2 Jamaal Al-Din - NBA": 0, "RT @censorednewsnow: #OccupyTheBanks - Let's ROLL!: #DARKCABAL LIAR #NWO MICROSOFT #SKYPE #NSA http://t.co/YxlymJJCYm": 0, "69 Office 365 | Microsoft's Office 365 Gets Encrypted Emails From Early 2014 | Encrypted messaging coming to... http://t.co/vwvJGwUbmk": 0, "I m wondr how many sales Microsoft had on the Xbox One.": 0, "RT @renegade_roo: For those of you who haven't seen it yet, Nintendo congratulates Sony &amp; Microsoft on their launch http://t.co/aD1B8BXcLn": 0, "Richard's F1 Blog: A must see for all webber fans http://t.co/yxf2S9slXY via http://t.co/u6brH2PXVg #F1 http://t.co/5T4cmqY30F": 0, "Jesu!\"@temitopeybnl: Oloun!\"@Boobs_r_big: WE REALLY DONT CARE BRUH \"@thimmyt: Dear Microsoft Word, I'm pretty sure I spelled my name right": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/AUl4EiuLYA": 0, "Love Life And Life Will L...: new image http://t.co/ixdoFgb3L6 #quotes via http://t.co/gxktWhKfbI http://t.co/6qXXsJvKva": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/JzL8PQsJsR": 0, "#AllTop Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours, But Takes ... http://t.co/xF5QsqI2JT": 0, "Microsoft brings rich node.js support to Visual Studio http://t.co/u2XjCMuhYV": 0, "Hey Microsoft. I like you guys. I do and 8.1 is awesome, however IE11 breaks way too much.": 0, "@HaloWaypoint @XboxSupport @Microsoft the look on your employees face was even sadder than mine": 0, "$1500 but insurance nd microsoft RT @MrHerrera_23: @_ChristleMETH how much was yours ??": 0, "Microsoft sells more than 1M #XboxOne in 1st day of 13-country launch, same as Sony #PS4 which was launched in Nth America alone": 0, "Hey @leolaporte + @twitlive perfect for MacBreak Weekly, lol MAC being used at Microsoft event for Xbox One. http://t.co/FGdyml8RXd": 0, "RT @JOSHYCONKER: @a_brooke08 LOL and they don't pay their taxes either that team reminds me of the #Microsoft and the #Xbox #hottmess": 0, "@DaveyHolsapple no like, it's a physical problem with the console , but it can still turn on , and idk where a Microsoft store is": 0, "#SocialMedia Xbox One console breaks sales record - More than 1m Microsoft Xbox One games consoles bought in t... http://t.co/YRiegD0c5T": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox O... http://t.co/VynbgWNV72 #socialmedia #uni": 0, "@_SirSmoke_aLot I gotta finish it n u gotta have some microsoft silverlight sht": 0, "Microsoft blew its shot at making their Xbox division profitable. Watch for it to be sold off in the near future http://t.co/h0dIXM1Use": 0, "Global launch for Microsoft Xbox One http://t.co/Tgt6IBXjkV": 0, "@saifjayah @PlayStation @Xbox @Microsoft Fuck, they didn't go through the effort to attach a pic.": 0, "F1 Around the World: new image http://t.co/QIJUCfli3Q via http://t.co/u6brH2PXVg #F1": 0, "#Microsoft considered releasing new Halo game as #Xbox One launch title: GameSpot: Had #Microsoft shipped a Ha... http://t.co/Rb9MCpltMa": 0, "RT @GodReviveUSA: Microsoft is a combination of the words \"microcomputer\" and \"software,\" and the name was originally spelled as \"Micro-sof": 0, "Leave it to Microsoft word to change \"more trustworthy\" to \"trustworthier\" and then realize that's not even a word. #solegit": 0, "@XboxSupport @microsoft Refused to Swap out their own product, dont believe me? Ill be posting the conversation to Youtube &amp; link to twitter": 0, "From Deadline: Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One ... http://t.co/fxGKflISD6": 0, "@albarran_george Well let's take a look there. Do you see the purchase of Ghosts showing up at http://t.co/3kQCQmzbiZ currently? ^AD": 0, "@andrewjclark @zcichy Just seeing how much Microsoft has used the technology of Kinect for TV use.. I can only imagine.": 0, "Microsoft Interested to Buy Winamp from AOL? - http://t.co/t1iXCNJxmP http://t.co/BxUJkym2t2": 0, " http://t.co/Qq8aFTkJf2 85 Winamp | 'AOL wil Winamp verkopen aan Microsoft' | save free green app go money | single parent": 0, "twitter feed can't sync in People Hub WP 7.8 http://t.co/CJZsRufQzr cc: @windowsphone": 0, "I'm selling my #XboxOne on ebay right now!  Ends Next Sunday. http://t.co/OrhzVT4fZu": 0, "http://t.co/KOfDcV03Js #Google #Microsoft #scroogled #wearabletech #wedoitlive #livespeakradio": 0, "Download Windows 7 Wallpapers  Digital Paintbrushing by AbusoRugio See *** http://t.co/x7Z8T1HOC3": 0, "Microsoft&amp;#039;s Asia Pacific Analyst Summit 2013: A Tale Of Two Days | Forrester Blogs http://t.co/3135UZbRrL": 0, "Microsoft sells 1 million Xbox One consoles in 24 hours http://t.co/DPRwXULvpB": 0, "Meet the New Pack Rats: Exxon, Microsoft and other companies are pressing the federal judiciary to insulate them... http://t.co/cRjdXJV9hk": 0, "@bronthong .avi is a movie file extension. It stands for Audio Video Interleave and was created by Microsoft. Avi on twitter means avatar": 0, "RT @AllThings4Free: For more giveaways and to enter for your chance to win an Xbox One Retweet http://t.co/9gY7rwUaFK": 0, "I just need Microsoft to tighten the reception a bit and it will be all good.": 0, "Those who mind dont matte...: A baby girl decides to sing a duet with he... http://t.co/xzfRPyAxJW via http://t.co/gxktWhKfbI": 0, "RT @PvblicF: 2day is last Vote! Help stds win $10K! Vote 4 winning idea @NFTE http://t.co/GAhOvzfCR6  tablet/smartphone app design challeng": 0, "taking a well deserved break after opening Microsoft word": 0, "by AllThingsD -  AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's... http://t.co/2ykGzbCkWY #General #News": 0, "Microsoft Xbox 360 White Console (NTSC) GOOD SEAL with 120 GB Hard Drive Bundle: $89.99 (0 Bids) End Date: Sunday... http://t.co/oAKWMYZzZF": 0, "Whose mom got their hands on Microsoft Word and did the graphics for the #AMAs?": 0, "RT @IGNUK: Sony congratulates Microsoft on the Xbox One launch: http://t.co/n8CvHTccji #WeekendRecap": 0, "Global launch for Microsoft Xbox One - http://t.co/qA0FwIU1WK": 0, "Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/bqJJ0ne6hi": 0, "\"@businessinsider: BREAKING: Microsoft Sells Over 1 Million Xbox One Units In Less Than 24 Hours http://t.co/KGsHRvkbCf\" wow.": 0, "Kendrick Lamar is looking at Nelly right now thinking, \"I could start doing Microsoft Surface ads and still keep more cred than that.\"": 0, "F1 Around the World: new image http://t.co/iB2DBEKAOs via http://t.co/u6brH2PXVg #F1 http://t.co/q4r60OcDxR": 0, "Tech reviewers say Nokia's Lumia 2520 beats Microsoft's Surface 2 on design http://t.co/aa2JYL9EXx #tech #gadgets": 0, "go fuck yourself Microsoft http://t.co/HZcY0BuYTd": 0, "@ducidni: Microsoft, I love you http://t.co/33ZsqstEyi": 0, "#Previously_on_radiomidas: Microsoft supports NITA to implement e-governance project http://t.co/3TFDc8xBHZ": 0, "@TechCentury same as owning an xbox would make us all Microsoft fanboys haha (I hate the word fanboy lol)": 0, "And Then Microsoft office decides not to work the night before i have an essay due. :D": 0, "#Xbox One smashes console sales #record with one million sold http://t.co/gO1wZeKLIA via @DailyMailUS #Microsoft": 0, "Microsoft updates SkyDrive for iOS with photo auto-upload http://t.co/wXXL1usIex via @CReviewer": 0, "MICROSOFT @_Ammond: @EBread_ wass the word": 0, "RT @dianalalata: Life would be so much more enjoyable if Microsoft Office just came with Mac for free. I strongly dislike Pages.": 0, "Microsoft admits that the Xbox One has problems reading discs. This wouldn't matter if it was a toaster, but it's a disc-reading machine.": 0, "RT @angggmancuso: Only thing I want for Christmas is Microsoft Word. ": 0, "LMFAOOOO Microsoft would have to see me https://t.co/Zy3Tj58caL": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/yZzwTLRGvd": 0, "Every 2 out of 5 Xbox One consoles are bricks.... Not good odds Microsoft": 0, "Set off against microsoft biodynamics crm in consideration of visionary crm: mcEGZhdVs": 0, "@kpereira but wait, Microsoft had no idea what they were talking about": 0, "Why does every ad for @Microsoft 's Surface have a keyboard in it? Are they trying to tell us something? Oh, kb is extra, btw.": 0, "Help UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/IQCI0mrMOO #Win8 #FunApps": 0, "@XboxSupport Best Buy was sold out.  So after spending 5 hours with Microsoft on the phone I am getting a new replacement.": 0, "Doesn't sound that useful then does it? (for sys admins only!): \" http://t.co/arpZeBUUNu": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/yq0wXcNIfr John Callaham": 0, "\"@JibriMontega: Leave the pussy microsoft like windows vista\"": 0, "Give feedback to students Win 8 app by installing from this link http://t.co/mzYUe30TIo #windows81 #seo #CallOfDutyGhosts": 0, "Assist UCLA computer science students in learning how to use feedback from players, use this link: http://t.co/QBRz614OUA #Win8 #FunApps": 0, "To  whoever stole my Microsoft Office account: \n\nI will find you\n\nYou have my Word\n\n(See what I did there)": 0, "Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsofts Kinect Tech: Apple has acquired Prime... http://t.co/fAwWf3r63W": 0, "Q: How many Microsoft executives does it take to change a light bulb?": 0, "@chidseyc Thanks for clarifying. You may need to activate by phone via http://t.co/rnbAGL6FCV. Let us know how it goes, Christopher. ^JVO": 0, "Yahoo slams Microsoft Outlook in eccentric memo, even though most of them use it: As it turns out, just a few ... http://t.co/tns3yPVLCB": 0, "Canceled #Skydrive. A good backup solution ruined by @Microsoft integrating it into #Windows 8.1 breaking the continuous backup functional.": 0, "#Microsoft, you don't acknowledge your competition. #duh": 0, "@Microsoft #Apple @amazon @PayPal Go fuck yourselves.": 0, "Just sthnk  how different the technology landscape would be if Microsoft hadn't been prevented from integrating their products for a decade.": 0, "This is something to follow! #apple #microsoft #kinect #PrimeSense #buyout http://t.co/7i9iEsfV0U": 0, "Microsoft Selling Shirts and Mugs that Make Fun of Google Stealing Peoples Data\n\nDear Kettle: You are black.... http://t.co/MVaiTTuWGH": 0, "@jasonmasney Thanks. Can you sign in at http://t.co/wz56oG8AVD to confirm the region listed in the upper right? ^CW": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/HhzQH2uoSq": 0, "New post by @HalfDecentP; Forza 5 Review http://t.co/cjdOYhN7sb. Come check it out ##forza_5 #microsoft #xbox_one": 0, "F1 Around the World: new image http://t.co/kAFhLdsDoz via http://t.co/u6brH2PXVg #F1": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Microsoft Corp. said it sold more than 1 million... http://t.co/a30CmpqLsR": 0, "Xbox One console breaks sales record - More than 1m Microsoft Xbox One games consoles bought in the first 24 h... http://t.co/uwlLy6DLog": 0, "Amazing shoes and bags: new image http://t.co/Bo40OYtbAO via http://t.co/qiQqBbpNxe #fashion": 0, "Biggest #Xbox launch ever: #Microsoft says it sold 1M #Xbox Ones in less than 24: VentureBeat: Microsoft said ... http://t.co/iCBHBEyIPM": 0, "Partner Acct Exec  Bus Sol Job: Microsoft - Kuwait - Job Category: SalesLocation: Kuwait http://t.co/dJ5rY1SuJ8": 0, "RT @BloombergTV: #FastFact 2.3 million people are on GameStop's waiting list for new game Sony and Microsoft consoles": 0, "#Microsoft wins spot in school curriculum! This @smh article has the full story: http://t.co/5IUtgnPRjH": 0, "Microsoft 70-635 oral examination expenseless showing: rmDRvas": 0, "F1 Around the World: new image http://t.co/cLTQtmVNF0 via http://t.co/u6brH2PXVg #F1": 0, "Microsoft: October Patch Tuesday vulnerability patched in November http://t.co/ZM5LnpxW0F": 0, "MA Senate Approves $11 Minimum Wage http://t.co/A5UZAwnQWm via http://t.co/hdZI6v6ii9 #uspolitics": 0, "Microsoft Sells Google-Bashing Mugs, T-Shirts on its Website http://t.co/v5WGsfRUkr": 0, "Who wants to give me Microsoft points please": 0, "Personally, I believe microsoft is jumping the gun on the post-PC era thing.  Look @Dell and @ToshibaUSA.": 0, "Insanely Funny Shit: new image http://t.co/LpFNVje2QO via http://t.co/fnTDKnNbKt #funny http://t.co/zRF3UnEIjr": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/xjAIseUS6C": 0, "Mascot on the weekends, MSFT employee during the week. Meet the man behind Blitz, the mascot of the Seattle Seahawks. http://t.co/Pjs3Zz3wOr": 0, "@danielgotskillz Just your Microsoft live account preferences. Everything else is for local files. #Legend": 0, "Just bought a Microsoft surface for school because all their programs run on windows. I feel like a traitor. #ilovemymacbook": 0, "i hate the fact that i have enough money for xbox one but they are sold out everywhere  #microsoft #getyourshittogether": 0, "#Microsoft Scores Big #Office365 Customer Win: MetLife | http://t.co/sImKfmAhzb via @Talkin_Cloud ~ So? What're you waiting for?": 0, "Road to gettin that #Sponsorship. @Microsoft I've been talking up #XboxOne with so many people today! #Disney #Epcot http://t.co/tkoiAFK40Z": 0, "@Smokeydogg7 @VirtuaMe Microsoft sold 1 million through 13 regions whereas Sony did that number only in NA. Xbox fanboys grasping lol": 0, "Get accredited as a Microsoft #Presales Technical Specialist, enter for chance to win an Amazon gift card http://t.co/lbOplI8tuT #mspartner": 0, "@OhNoRobertLuke In that case, use a working MS account to select \"I need to reset my password\" at http://t.co/NSBqcuPFWu. Does it help? ^JVO": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/bkKosCeZBh": 0, "RT @MicrosoftStore: Want to get the latest holiday deals from Microsoft store delivered directly to your phone? Text MSSTORE to 30364.": 0, "What the Xbox One tells us about the new Microsoft http://t.co/GvSGmYpkM9 via @BGR": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/Y9GTFZGkmQ": 0, "@kimchiman99 Microsoft Right-Handed Comfort Mouse 6000 is now on sale for $21.61 at Amazon. Product page: http://t.co/sCwuLKiYHX": 0, "Fashion: BuyTrends: Fantastic outfits for the party! Do you like this?\nd... http://t.co/V8iColCPAj via http://t.co/qiQqBbpNxe": 0, "@MitchyD is there a micro transaction to buy a different ending? If not it would seem Microsoft missed a good opportunity.": 0, "RT @ITProPortal: Microsoft counter-sues patent troll: A lawsuit filed by Microsoft claims that Acacia... http://t.co/D6EiN4IyGm #tech": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/Cd1fmDkyhJ #wp": 0, "#MSDynComm #MSPartner News: #MSDynGP Integ'n; #MSDynCRM book; #CPQ Win; BI for #AX2012; #MasterVAR growth... http://t.co/54KY79zKHL": 0, "Dell Venue 8 Pro review: When Microsoftannounced plansto support 7- and 8-inch tablets with Windows 8.1, I w... http://t.co/iTx0coWVNM": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/rkztAy2fKb": 0, "@ghettogothk just google Microsoft office torrent and one from piratebay should come up ?": 0, "RT @MicrosoftASIA: Create, update &amp; delete records with Microsoft #Dynamics CRM app now available for #WindowsPhone, iPhone &amp; Android http:": 0, "@itsJACKW That would be the Microsoft account you use to sign into Xbox Live. ^CR": 0, "Microsoft Xbox 360 60 GB Video Game Console HDMI W/ Cords: Price 23.0 USD (18 Bids) End Time: 2013-11-30 22:33:41... http://t.co/hB3pIVzMM2": 0, "It looks great and I appreciate that @Microsoft used the tile scheme in all #XboxOne apps, but the @netflix app is terrible.": 0, "I get CoD: Ghosts, and my Xbox FUCKING RED RINGS EVEN THOUGH IT WORKED 2 FUCKING DAYS AGO... #Microsoft": 0, "@Pr0ph3cyX @xShananiGUNS Because Microsoft wants you to spend more money. Duh.": 0, "F1 Around the World: new image http://t.co/EOf2IrQAoV #F1 via http://t.co/u6brH2PXVg": 0, "Microsoft Excel 2010 for Medical Professionals (Illustrated (Course Technology)) http://t.co/X0QSCbUgM8 #informatics": 0, "@Ketuan Read story in YSU's fall alumni publication. Congrats on on Ur new position at Microsoft. Wishing u continued success in your field.": 0, "Test4pass microsoft oral examination 70-247 examen sullens showing unselfish 4shared: IphpzvN": 0, "May 31, 2013- Microsoft released Power View connectivity for Multidimensional models http://t.co/zBw4EYbMP5 #MSBI": 0, "Any chance of me getting an extension on my assignment under the reasons my Microsoft Word is acting the absolute cat the night before": 0, "RT @mashable: Microsoft Sells 1 Million Xbox One Consoles in 24 Hours http://t.co/29VPavfUHW": 0, "RT @farnamstreet: Microsoft is the Sears of the internet.": 0, "@JackD29991 @Kotaku yep and watch the Internet sheep play it off as not an issue and make it into Microsoft's fault": 0, "I m in \"Building  Digital Marketing BI on Microsoft technologies\" session at #wpc13. Looking forward to their ideas.,": 0, "via @CReviewer -&gt; Microsoft updates SkyDrive for iOS with photo auto-upload http://t.co/T8mkDxaBfQ #technology #Canada": 0, "For the battery life alone, you have to @WindowsITPro @EverythingMS 'Microsoft Surface Pro 2 vs. Surface Pro: Should You Upgrade or Not?'": 0, "I find this Microsoft word class annoying because I know the content already,": 0, "Yeah how do I uninstall programs that you included with my purchase but I have no access to? @MicrosoftStore @whymicrosoft #Microsoft": 0, "Surfing Life Magazine: new image http://t.co/43GRduQrW6 via http://t.co/mn3EFmuNyP #surfing": 0, "Microsoft Xbox 360 S Call of Duty: Modern Warfare 3 Limited Edition Bundle 320 G: Price 100.0 USD (1 Bids) End... http://t.co/Otia2AxyY6": 0, "RT @iamMeKay: @Jetlife_DJ: MICROSOFT @Dat_Guy_Yung: Wats the word": 0, "@Microsoft MSN China got innovation product gold award at 6th ROIfestival with [Microsoft Operation System ad--AiA] ! http://t.co/vaNUlMpwGg": 0, "They told Jesus he wasn't the savior, bill gates professor said Microsoft wasn't realistic,  jay z and Oprah grew up in the projects.....": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/dfgRJzrCQS": 0, "Just entered to win a $550 Microsoft gift card from @TheGameFanatics! You should enter too! #MicrosoftStore #XboxOne http://t.co/9dJnNxExLi": 0, "I hate my brother I would sell him for 2 wawa meatball subs, 2400 Microsoft points, and a bag of chocolate chip cookies": 0, "@ChesnoidGaming microsoft guy called me bro": 0, "RT @MyICTCloud: Global launch for Microsoft Xbox One  http://t.co/8DY8WHuDdb": 0, "New #rqmnts post: Requirements Tools: Sharepoint - Like many companies, Seilevel uses Microsoft Sharepoint to stor... http://t.co/VFdFv8EqeY": 0, "Apple confirms it has acquired the company behind Microsoft's Kinect sensor http://t.co/4Nqd0LtBFu": 0, "RT @TrapJFK: I hate my brother I would sell him for 2 wawa meatball subs, 2400 Microsoft points, and a bag of chocolate chip cookies": 0, "Help UCLA game design students better game design by using this link: http://t.co/LhQdlkilbl #Win8 #FunApps": 0, "Microsoft Xbox 360 BenQ Replacement DVD Disc Drive: Price 9.04 USD (14 Bids) End Time: 2013-11-25 07:52:05 PDT http://t.co/qpcBaD758z": 0, "@BillGates The microsoft word founder is the most interesting software for any job around the globe. The  Best and the Only.": 0, "RT @siliconrepublic: Catch up: @Microsoft creates 95 jobs in Dublin #jobfairy http://t.co/fRtjjp3uxw": 0, "Microsofts Xbox One | First Look  #CONSOLE #GAME #GregKumparak #XboxOne": 0, "F1 Around the World: new image http://t.co/PDMCqdujnC via http://t.co/u6brH2PXVg #F1 http://t.co/gVxS0mqAga": 0, "I liked a @YouTube video from @jaminbbc http://t.co/KGUSNe6B48 MICROSOFT LIES: XBOX ONE GAMES RUNNING ON PCs?! - *ANTI* XBOX ONE NEWS": 0, "Reincarnation at Nokia: Planning the next bounceback http://t.co/TprVzbmZAL": 0, "@frankcantu Sony doesnt do software very well. Microsoft does (sometimes)  or at least way better than Sony.": 0, "Microsoft sharepoint fostering-needs must differently possibilities: JsMms": 0, "Amazing shoes and bags: new image http://t.co/XwutmIxozz via http://t.co/qiQqBbpNxe #fashion http://t.co/T5JYxMgxJo": 0, "Just my luck Microsoft Word would have a completely meltdown and lose my 20 page document I just wrote.": 0, "I hate you Microsoft word": 0, "Tech reviewers say Nokia's Lumia 2520 beats Microsoft's Surface 2 on design http://t.co/sdYOLPocfD #tech #gadgets": 0, "\"@ducidni: Microsoft, I love you http://t.co/D690Y6aOOw\" play you on madden bro!": 0, "#1: Learning Microsoft Windows Server 2012 Certification Training - Exam 70-410 - Training DVD: Learning Micro... http://t.co/lKc8PqI2dC": 0, "Microsoft sold over a milli launch weekend. Same as Sony. Can we end the debates. Clearly people still love both! Enough said": 0, "Top TV Series: Just what is THE GOVERNOR thinking?\n\nGo inside his mind he... http://t.co/lo0Tcv6Dqd via http://t.co/tXjObGiDiU": 0, "Check out this week's best seller via @TpTdotcom Tier II #Vocabulary bundle!  #words #grade4 #grade5 #CCSS http://t.co/qv8uzkx4xw": 0, "I'm buying and selling players for Microsoft points will sell giroux gaborik and Parise for only 40$!": 0, "Microsoft is banning people for swearing over private skype conversations. LOL\nhttp://t.co/CyrfF8HPDq": 0, "http://t.co/Bkzx1kURcJ\n\nThe Nokia Lumia 520 has been one of the most important phones for Microsoft and Nokia.... http://t.co/QHKbjSyHTs": 0, "Check out Microsoft Xbox One - Day One Edition 500 GB Black Console Brand new Sealed 1 on @eBay http://t.co/25JO1bNtec\n\nbid on my #xboxone": 0, "\"@TheComedyJokes: Dear Microsoft Word, I'm pretty sure I spelled my name right.\"": 0, "Bitter Clingers: Yahoo Employees Hang Onto Microsoft Outlook For Dear Life http://t.co/cBHWlyiL60": 0, "Why can't @Microsoft and @Sony come together and make a console called the Playstation X": 0, "Jul 16, 2013 - Microsoft released Cumulative Update Package 5 (CU5) for SQL Server 2012 SP1 http://t.co/yAdX30laPb #MSBI": 0, "RT @PickUps4Christ: I like my women like my Microsoft Word documents...SAVED!": 0, "Good morning (@ Microsoft (Thailand) Limited) http://t.co/AkbD5zw7rO": 0, "@PLu7o Microsoft don't want u talking to your broke niggas Lol": 0, "I've been sitting here for an hour just staring at Microsoft word hoping my essay would write itself :-(": 0, "RT @mmaballer13: @RICHFlair_ The Kinect in the xbone is a spy cam too. Microsoft is in bed with the NSA. Protect your privacy dont ever get": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/rQCaHqPNmh": 0, "Now you can do a \"3D Selfie\" using #Microsoft Kinect. https://t.co/zZkHiW9Yi9": 0, "LJ: Principal/ Senior/ Solution Architect (Microsoft Technologies) http://t.co/mGgVbb8J2X": 0, "@geoffkeighley Dang so artist and Microsoft employees get white ones smh money talks": 0, "HELSINKI (Reuters) - Nokia shareholders are expected to approve the sale of its mobile phone business to Microsoft on Tuesday, with the deal": 0, "@amandaxlouise @radhasvibes awe, well have fun learning MICROSOFT IN HELL": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside ... - AllThingsD http://t.co/P6NNqwKe19 #microsoft": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/jgd6Caxsdr": 0, "Report: Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts (Mike... http://t.co/Gd8w4XA1wI": 0, "@JarrettRowland Boot the system (keep pressing F8 for the boot to complete). Once done, choose restore http://t.co/Pguy6YgcfC for a fix. ^MG": 0, "RT @EndHateRadio: It's one thing to poison your own brand  @modchamber quite another to drag @Microsoft down w/you. #stoprush #scum http://": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/xBZs5ASVE1": 0, "Canadian pharmacy chain Jean Coutu Group plans major Microsoft Dynamics for Retail deployment in 2014 ttp://ow.ly/r8DBA #msdyncrm": 0, "#GoodDeal Buy Xbox 360 4 GB Console (Refurbished) - Microsoft Store --&gt; $179.99 (http://t.co/Ak7yS3aYnQ):  http://t.co/WjN63WSvHJ": 0, "Microsoft gives highest Gamerscore holder first lifetime #Xbox Live #Gold membership #PS4 http://t.co/6vIfSFg6Xx": 0, "I have no data yet. It is a capital mistake to theorize before one has data.  - Sherlock Holmes. m.Aloud windows 8 http://t.co/lDQZ34L4mK": 0, "Insanely Funny Shit: new image http://t.co/0ZIEU7pYJc via http://t.co/fnTDKnNbKt #funny": 0, "Time to glue my eyes to Microsoft word and type away. #paperspaperspapers": 0, "Photoset: buzzfeed: Every Pixar movie summarized in terrible Microsoft Paint drawings. http://t.co/QQRLhCzKEL": 0, "RT @Kemsleyyy: Little boy got his dream concert thanks to @SeanOLinn!! @microsoft @mackelmore_ http://t.co/sx1byUzN8h": 0, "@mikebaz Just what is their reason for life, I want to know. That non-purchase was Microsoft's greatest move ever. Thank you, Jerry Yang!": 0, "Waves: new image http://t.co/3all1pAKMJ via http://t.co/mn3EFmuNyP #surfing": 0, "@MsSoCaLSAVAGE not yet, I ordered one from Microsoft": 0, "Leave The Pussy Microsoft Like Windows Vista": 0, "If you want to be dumb and stupid and repair the console yourself, dont blame Microsoft when it breaks again on you.": 0, "hAppls new IWork suite for OSX and IOS7 is awesome! No need for Microft Office anymore! #apple #iwork #microsoft #Office365 #technology #fb": 0, "Microsoft Surface Pro 2 vs. Surface Pro: Should You Upgrade or Not? http://t.co/DLlrg9vlxg": 0, "Remake yours project via scene erudition microsoft outbrave 2000 courses: YETUGyz": 0, "Microsoft Office Professional Plus 2013 is available for $9.95 for active military and reserves ... http://t.co/rzGNQuoTc8": 0, "F1 Around the World: new image http://t.co/76T679NGOg via http://t.co/u6brH2PXVg #F1": 0, "@HaloWaypoint @XboxSupport @Microsoft i cant believe u guys wanted me to pay you $1,086.22 (tx incl) In order to receive a working #XboxOne": 0, "Grear job Microsoft.... For selling the most expensive broken system on the market!!!!!! http://t.co/qjAWsbMstc": 0, "Microsoft need stop they shit they know them Windows tablet een worth a damn": 0, "A new blog post has been added by sheltonscottlina: SaaS Technology and Microsoft Offerings\n            Softwa... http://t.co/iZPp0b8cwZ": 0, "I want to #win @Office 365 and #GetItDone this holiday season from @SavvyMomNYC http://t.co/vKWefwA0TT": 0, "@xboxsupport I got an xbox one on day one for my son for Xmas, if he opens it up Xmas morning and it's broke, I'll never buy Microsoft again": 0, "RT @zpower: if microsoft comes out with an \"xbox one pro\" in two years that has a cablecard slot and integrated DVR, I will pay $800 for it": 0, "Aropostale: Teens For Jeans is back! In the past few years we've collec... http://t.co/qolAsPI7ZC via http://t.co/qiQqBbpNxe": 0, "Brief as respects microsoft strengthening preparatory study: TPvCrjx": 0, "Dear Microsoft, I'm poor and my dying wish is an xbox one. Please help @Microsoft": 0, "\"Don't get Scroogled,\" Microsoft warns in leaked video http://t.co/M4get4TXj8": 0, "I leave the pussy Microsoft like Windows Vista -  Lil Wayne": 0, "Round-up: Monster Gaming Week: A round up of the last week's Console... http://t.co/TqKMT94PER #Roundup #XboxOne #Microsoft #Gaming": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/1WRjmCUFhg": 0, "I hate when I have to use Microsoft access because I don't have it and have to struggle to find someone who does": 0, "#Win Microsoft Office 365 Home Premium for 1 year ($99) from @office to #getitdone @babylovingmama #ad #giveaway http://t.co/mB8Em6mSaE": 0, "#FastFact 2.3 million people are on GameStop's waiting list for new game Sony and Microsoft consoles": 0, "Honestly, I don't know how businesses survive working on Microsoft's platforms. Sheesh...": 0, "Pitbull: One hour until all these seats are filled. #AMAs http://t.co/XLFBaRf2KE via http://t.co/lZ21fxpl5d #celebs http://t.co/KC5f9xylfY": 0, "RT @gizmag Review: Xbox One: The wait for Microsoft's next-gen console finally ended on Friday with the system... http://t.co/qjMPiANwnh": 0, "#Windows 8: I love it and am impressed. Good from #mobile brought to desktop. Is #Microsoft still the best and we wont admit it? #PC #asus": 0, "Find out what's next for Microsoft's next-gen console. - http://t.co/ippANdG2FB": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/X5CBAIpC7J": 0, "Microsoft losing people to Sony. http://t.co/BLdUcLR7W3": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/Wxxk3CUDLi": 0, "Why isnt it called \"microsoft words\"?": 0, "Microsoft promises an app catalogue to rival Android and Apple by 2015, http://t.co/RURU7PscVq": 0, "I really get pissed when Microsoft Word tries to fix passive sentences.": 0, "RT @TabletsOnSale: Microsoft Office Professional 2010 Retail Box New  $89.99 http://t.co/UGjFtFTn1w #computer #desktop": 0, "RT @SteelCurtainMUT: NO DOLLAR GENERAL GOT RID OF 1600 MSP!!!! Ugh I hate buying $25. $20 was perfect, fuck u Microsoft you Greedy pricks": 0, "Funny jokes &amp; pics: new image http://t.co/qLSruEOanM via http://t.co/fnTDKnNbKt #funny http://t.co/VhVgtdVv7c": 0, "Yu have got be kidding me... \"Halo programmer departs Microsoft for Naughty Dog\nhttp://t.co/4TfGbwC7E8\"": 0, "Week in review: AppSung 2, internet funneling and a look inside Microsoft's CEO search. -by @heyheyesj http://t.co/R1PNn0LKHF": 0, "If you're having any serious issues with your new Xbox One, Microsoft will send you a replacement before you ship your broken console back.": 0, "\"This product does not support Windows Starter Edition.\" Obrigado, Microsoft!": 0, "Microsoft Word became my bestfriend of the day with him since this morning": 0, "@GENIUSA1A @turtlebeach turtle beach basically I S.O.L. and then shifted the  blame to Microsoft.": 0, "i need Microsoft Office Publisher!!! .. Bilis na .! Gagawin ko lahat XD .. I need it ~! XD": 0, "@MattHDGamer probably, considering Microsoft are trying to shove it down our throats like Google are doing with Google+": 0, "Investing passageway microsoft certifications in behalf of la numinous driftage: WYhEQM": 0, "RT @BurritoBrosShit: The Microsoft Store has Xbox ones in stock.": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search: In case you missed... http://t.co/AAfg1qsWLl": 0, "The Law Of Attraction: Bob Proctor, Jack Canfield and Michael Beckwith a... http://t.co/7RNh9im2rL via http://t.co/gxktWhKfbI": 0, "Step into a whole new world. #XboxOne #Microsoft #UCrew": 0, "Gravid exaction in passage to explain away minix issues nigh microsoft: wuFd": 0, "Microsoft Xbox 360 250 GB Black Console: $200.00 (0 Bids) End Date: Sunday Nov-24-2013 17:16:40 PST Buy It Now... http://t.co/ucjxRwZtMB": 0, "#Respect the competition nigs miamis_chosen_one. #Gaming #Gamer #Sony #Microsoft #PlayStation #Xbox http://t.co/wB4zwyBBD5": 0, "oh no! the tweets and snapchats are flowing more than microsoft word is #notgood #whydoialwaysdothis": 0, "Writers block every time I open up Microsoft word ": 0, "RT @NeowinFeed: Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/ynxxTI8GdB #microsoft #xboxl": 0, "I need to call apple and google and Microsoft @adamprokopchuk and I are geniuses": 0, "Microsoft video attacks Google's Chrome as surveillance technology but do they have the moral high ground here? \nhttp://t.co/JdMLCzBadO": 0, "RT @itgrooveSMB: #Microsoft Scores Big #Office365 Customer Win: MetLife | http://t.co/sImKfmAhzb via @Talkin_Cloud ~ So? What're you waitin": 0, "MICROSOFT WORD IS PLAYING MIND GAMES ON ME.": 0, "I've been telling myself that I'm going to start writing my college essays for a week now. Haven't even opened a Microsoft word yet.": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/5K6D78duJd": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership\nhttp://t.co/dEdVdG4LEd": 0, "More emphasis on employee growth &amp; development. Feedback 2 help employees learn &amp; grow. Why not in Ed too? @BillGates http://t.co/DqbcO4C4J3": 0, "Isnt @NFLonFOX sponsored by @Microsoft for surface? If so why is @curtmenefee doing @amazon commercials for the HDX? Strange.": 0, "RT @sforkmann: Think #Microsoft has nothing to do with open source? Think again. These are the OSS projects that ship with #vs2013 http://t": 0, "MICROSOFT @Dat_Guy_Yung: Wats the word": 0, "Have you checked out the Bing Ads Agency Hub? http://t.co/zuJdBMReUc #marketing #advertising": 0, "RT @zzeed: Because Microsoft thought people love Windows.\n\nNo, people dont. But they put up with it.": 0, "@GarnettLee @jeffcannata What a joke. Stay classy Microsoft!": 0, "[BOT-ANDIKA ARYA- V2]: PrimeSense fesses up: it's the magic behind Microsoft's Project Natal @dikapratamaarya": 0, "Halo programmer departs Microsoft for Naughty Dog - Polygon http://t.co/WPsVUfLZI4": 0, "@SGNewsTeam Global launch for Microsoft Xbox One: The global launch of Microsoft's the Xbox One game console took plac...  @orgasmicgomez": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/jqZhiCDHxJ": 0, "Microsoft's DFSR great 98% of the time, But that 2%...": 0, "The Xbone is definitely going to fail. With all of the blunders Microsoft has made and a lack of exclusive titles, the Xbone has no chance.": 0, "Check out Microsoft Xbox 360 250GB w/ Kinect! Over a $600 value! (PVR, Games, and more!) on @eBay http://t.co/GveOzlW8oe": 0, "Glad I just spent 2 hours on my resume to have Microsoft crash on me ": 0, "RT @Polygon: Halo programmer departs Microsoft for Naughty Dog http://t.co/uJ1qQegXro": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/hAN8C07vT3": 0, "@inman_richard What is the exact error you're receiving? Also, can you try entering it on http://t.co/F3DtFEu9mX? ^JG": 0, "Meanwhile  at Microsoft s Xbox One HQ    http://t.co/SfHHayJ2ou": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership: Ray Cox IV, who currently ... http://t.co/E2rhBvbW2Q": 0, "Glad I got the #XboxOne to work after the #XboxOneLaunchFail no thanks to #microsoft been enjoying #Forza5 #DeadRising3 #KillerInstinct": 0, "my dad doesn't have Microsoft so I had to type my paper via email": 0, "Forums Links For Microsoft .Net Developers http://t.co/pX85CWbPxP": 0, "RT @Nyxxisnite: Microsoft video attacks Google's Chrome as #surveillance technology http://t.co/2EfPrGoZMs": 0, "#Fuckery Everyone seems to be buying windfarms... #Microsoft #Google &amp; now -- #IKEA Invests In Canadian Wind Farm http://t.co/2DmykEt5ba": 0, "@XboxSupport1 I can't use Skype but I'm getting the Microsoft link from my live email account.": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership #microsoft #xboxlive http://t.co/xRIeqFsROj": 0, "I can't use #Microsoft Office 2010 bc it freezes.  I have business to conduct. This upgrade is taking HOURS #Irate http://t.co/0tgyh82Q48": 0, "Give ratings to students Win 8 app by installing from this link http://t.co/4KeC8vqRBc #windows81 #seo #CallOfDutyGhosts": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/9aHwuwlVkm": 0, "I liked a @YouTube video http://t.co/lM16h3Se4Q Microsoft LifeCam HD 3000 - Unboxing &amp; Quality Test": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/8OUFttpCJS": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/ccN4IOC15t": 0, "Microsoft Store on Michigan Ave in Chicago - Xbox One! http://t.co/nt6Ba5ORsH": 0, "Microsoft Dynamics NAV Consultant (#Dallas, TX) https://t.co/HOCA8zpcef": 0, "@iamMeKay: @Jetlife_DJ: MICROSOFT @Dat_Guy_Yung: Wats the word I see this nigga @Jetlife_DJ  got jokes today and sht ": 0, "Performance Reviews Get Two Very Different Overhauls at Microsoft and Yahoo http://t.co/uAXUi3uNqp": 0, "I'm such a fail at Microsoft Excel": 0, "You can get a free Microsoft Points here:  http://t.co/ATHLHDEMTl": 0, "@IsaLudovice #commerceproblems our Microsoft Word has never experienced 15 pages #500wordsorless": 0, "Enter to win a 1-Year Microsoft @Office 365 Home Premium so you can #GetItDone! Via @BayAreaMommycom! http://t.co/piVrMY4hAe": 0, "Microsoft projects that the initial Xbox one sales will exceed one million! #xboxone": 0, "Apple commericals are pretentious, and Microsoft commericals are desperate.  Need a third party.": 0, "Very slowly downloading the trial of microsoft office so I can correctly print my math final review. Stupid internet.": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million http://t.co/FZK6RhZEAv": 0, "Anybody a beast at Microsoft Access??": 0, "RT @alainfiocco: If your ISP provides #IPv6  your Xbox will perform better http://t.co/opN5X5LDzE": 0, "Does anybody know anything about the Microsoft Surface RT? Yes, Im actually asking that question.": 0, "Fashion: Lady, U should love this ...\nBlazer: http://t.co/0AAnElQlek via http://t.co/qiQqBbpNxe #fashion http://t.co/WTWOsjsWcJ": 0, "Insanely Funny Shit: new image http://t.co/Os6SKVfCk4 via http://t.co/fnTDKnNbKt #funny http://t.co/W44P7QHQZt": 0, "@Kemsleyyy @Microsoft @mackelmore_  No problem! I hope he had an awesome time!!!": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours - Read on http://t.co/reOjBJ2X6X #TV": 0, "Starting early 2014, you can send encrypted emails in Microsoft Office 365 to anyone http://t.co/auWAkN6EML #email": 0, "New achievement unlocked: Ganamos el Desafo Microsoft en @AngelHack #AHSCL #ForeverAwesome": 0, "RT @the_ironsheik: MILEY CYRUS WIN #AmericanMusicAwards FOR DUMB BITCH": 0, "His inspiration includes goat rodeos with Microsoft http://t.co/NBBgkxUD5Z &amp; conversations with monks while packing &amp; delivering eggs.": 0, "Stephanie Gilmore: BIG CONGRATS to the pretty lady in the back! Kelia Mo... http://t.co/pPdNlg0oLp via http://t.co/mn3EFmuNyP": 0, "Sam Stosur: Stairs, ropes and being shown how flexible i should be! http://t.co/hB6PBP00TX via http://t.co/jDAwU42y28": 0, "holy hell, I just went 19/2 and MVP in a round of Conquest on #bf3. get the fuck outta my face, Microsoft!": 0, "3 Microsoft Dynamics CRM Partner Consulting Traits to Look For http://t.co/oZde4IaUEt": 0, "SA Microsoft Surface Giveaway (ENDS 11/30) Enter Below for your chance to win your very own SA Microsoft Surface... http://t.co/IXelIyhc0S": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/iudfouhcY3": 0, "@JarrettRowland Refer to the post by Ronnie Vernon at http://t.co/GBNnK0Uz6H to create a restore point. Does this help? ^MG": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/jBaOCHWJ03": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/b3cHkV0Uvl\n Connect http://t.co/9FuDDwo3MZ": 0, "Anyone notice the hidden Target logo in @Microsoft Office 2013? #YouCantUnseeIt http://t.co/3Pbi2H71z1": 0, "OneNote app has an update in the Store http://t.co/tXi1cBU7Ql": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/AKPXNqaGOo": 0, "Windows 7 Home Premium Installed by a Microsoft Authorized Refurbisher, Dell 745 Optiplex Tower Computer, Featuring http://t.co/U8m7wHn6v9": 0, "MMA Fight Club: new image http://t.co/f876en5nPp via http://t.co/ABUaH7ML8Q #mma http://t.co/yNUpzJfujv": 0, "\"My tablet has a keyboard, a USB port and Microsoft word.\" So a laptop, what you have just described to me is a laptop.": 0, "RT @SethAFitzgerald: Microsoft sold 1 million Xbox Ones on launch day. http://t.co/ff0xT7Q87d\n\nI guess that's 1 million people that can eas": 0, " http://t.co/UsBHVfkoxs 100 Xbox One | Microsoft's Xbox One hits store shelves | free movie download for ipod |": 0, "F1 Around the World: new image http://t.co/SkxESqlp80 #F1 via http://t.co/u6brH2PXVg": 0, "F1 Around the World: new image http://t.co/kdGrOr8Ypk via http://t.co/u6brH2PXVg #F1": 0, "Fashion: How about the outfits ?#jacket #boots http://t.co/5hYdoLXuXO via http://t.co/qiQqBbpNxe #fashion": 0, "@nickf360 yeah 2 day shipping so Wednesday the women said in the Microsoft chat": 0, "Thinking about your move to Windows 8? XP end of support is not far off now... Visit http://t.co/7nu00gvLCz to get prepared": 0, "Microsoft and Google make it harder to find child porn online http://t.co/FGIdGrHu5R #tech": 0, "Give advice to students Win 8 app by installing from this link http://t.co/In1qjbbIXw #windows81 #seo #CallOfDutyGhosts": 0, "@a_brooke08 LOL and they don't pay their taxes either that team reminds me of the #Microsoft and the #Xbox #hottmess": 0, "Gonna spend 4200 Microsoft points on fifa this Wednesday if I don't get anyone I'll commit #FIFA14 @EASPORTSFIFA": 0, "i need to be studying for my microsoft cert  and compTIA A+ exams ugh.": 0, "@AllthingsD AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's ... http://t.co/i1G730s5wK #apple #kazoku_nl": 0, "@MYMicrosoft names 4 Malaysian #teachers as Expert Educators, selects 'Mentor School' http://t.co/kfDnWmZEEW": 0, "Hybrid engines promise to shake up F1 http://t.co/tsfXYK2ksm via http://t.co/3cVMRz99nh #worldnews": 0, "Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 Hours, But Takes 11 More Countries To Do It http://t.co/sTTvb3Ui1J via@techcrunch": 0, "WHOOPS: #Microsoft replacing #bricked consoles to frustrated #gamers within 'a matter of days' http://t.co/YPT6zOrPMq via Geekwire": 0, "Win one year of @Office365 free with this #giveaway with @AmyBarseghian. http://t.co/aG9KUGteKe": 0, "Nobody, I mean NOBODY, can match Microsoft for torturous user interactions! You want me to enter a 60-digit # to your broken phone ux?!?": 0, "NZ Developers, want to go in the draw to win a new XBOX ONE? FInd out more here http://t.co/xj5qsOCx3A": 0, "http://t.co/HkL0oEeBDk So rather than dropping $500 and getting fucked over by Microsoft, why don't... http://t.co/UpbbVsahJC": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million\nhttp://t.co/Ujn4E8lUzy": 0, "RT @CoralieAlison: Google, Microsoft move to block #childporn http://t.co/LOUFP52k6d via @CNNMoney #humanrights #talkporn #pornharms #antip": 0, "UCLA game design students in learning how to use feedback from players, use this link: http://t.co/XQNXRxQtCs #Win8 #FunApps": 0, "I'm now ranked Dedicated (top 40%) in Microsoft Mahjong on Raptr! http://t.co/iUF5uiaKMP": 0, "RT @FourLokoHandz: Road to gettin that #Sponsorship. @Microsoft I've been talking up #XboxOne with so many people today! #Disney #Epcot htt": 0, "@StarkRahul Windows 8 comes wit Windows Defender built in. See http://t.co/2Gqt76thcY for ways to keep your PC secure. Anything else? ^JVO": 0, "Did Microsoft buy Comedy Central? I've never seen a product advertised and embedded in a channel so much": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque http://t.co/MPcMI4WXQR #wp8 #windowsphone": 0, " http://t.co/UcaeUSfabr 7 Xbox One | Microsoft's Xbox One hits store shelves | ipod 5 | application of nano": 0, "Check out the Makerbot at the Florida Mall Microsoft Store!": 0, "FUCK I DID BULLSHIT, I FORGOT 2 BUY MICROSOFT POINTZ": 0, "@HaloWaypoint @XboxSupport @Microsoft do i just call 18004myxbox to cancel my live subscription(s) or can u guys just plz do it for me?": 0, "Microsoft Xbox 360 S 4 GB Matte Black Console (NTSC): $125.00 (0 Bids) End Date: Sunday Nov-24-2013 16:51:29 PST... http://t.co/66cRSq8jCM": 0, "Error in query with CAML JOIN #Sharepoint Apps http://t.co/6RIcXqChoa": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/pO7EhtbqAY": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/6h1W18d598": 0, "Microsoft finally sees punitive ranking system is actually hurting company. It has a similar effect in Ed. #education http://t.co/DqbcO4C4J3": 0, "@windowlicker79 @Star_Fawkes @flyinglotus Microsoft just tried to take gamers rights away(xbone DRM etc)Microsoft DESERVES TO GET HACKED": 0, "@markimbriaco Buy Microsoft still ended up with a better launch lineup. So far I'm very happy with my XBox one, but haven't seen the PS4 yet": 0, "Updated: Active Directory: Glossary : http://t.co/TgsEYB92FH": 0, "Microsoft, you messin up bad making these defective xbox's $500": 0, "New York City may still have lots of Xbox One units for sale: Microsoft may have claimed that the Xbox One is ... http://t.co/dizzueu0lr": 0, "Whoever stole my Microsoft Office is in big trouble. You have my Word!": 0, "Job opportunity: Microsoft Server Admin. Are you a fit? in Tokyo, Japan http://t.co/vFcDCACdkk #job": 0, "After all these years Microsoft has still managed to make Windows a PITA": 0, "@VitaBrevi wow. maybe ur better off with microsoft security essentials? there are like 200 updates I'm doing after the re-install. not fun.": 0, "5 Free Alternatives to Microsoft Office": 0, "@Boogie2988 I got to play it at a Microsoft Store, dear lord it was amazing. I want.": 0, "@ReneBuest Interesting fact. If #AWS burns, Twitter is full of complains. If #Azure fails, nothing to hear.  http://t.co/y8sLOs4E5q  \n#Cloud": 0, "Microsoft is a combination of the words \"microcomputer\" and \"software,\" and the name was originally spelled as \"Micro-soft.\" #random": 0, "Just Try Not To Cringe At The Anti-Google Merchandise In Microsofts Online Store - http://t.co/SDWSWlKaop": 0, "RT @thehrisworld: #Microsoft Unveils What's Next for #Enterprise #IT http://t.co/xuj8BfEyb6 #tech #hrtech #cloud #connecteddevices": 0, "Xbox One Release Date, Review Roundup: Will Microsoft's Console Edge the PS4 in Sales? http://t.co/0LP0qgWbsE http://t.co/JPbLidbcv4": 0, "Microsofts Scroogled campaign jumps the shark, now offers merchandise - http://t.co/N3FrkoliNo http://t.co/kcnWGN7xIq": 0, "@JoshTheBeerSnob @jmaysnc HD DVD. You bought into that Microsoft bullshit didn't you? That's one place where XBox failed": 0, "aJust thnk how different the technology landscape would be if Microsoft hadn't been prevented from integrating their products for a decade.": 0, "@hutscammers @hut_trades9 just scammed me for my fucking Neil and sharp, told me he would give me $50 Microsoft points for the two players": 0, "Badass  RT @SexMahone: I'm at the Microsoft store using my iPhone.. Ooooo the contradictory": 0, "@toffee_skye ahhh ;p isn't photoshop expensive too? Microsoft paint editing skills :p": 0, "Who remembers this game, now remade - Star Trek Classic (http://t.co/jQVRL1mRH0) http://t.co/jQVRL1mRH0": 0, "Book of Quote: new image http://t.co/bpQzORrlcF via http://t.co/gxktWhKfbI #quotes": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/gKbpzhF0hi #technology": 0, "Report: Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsoft's Kinect http://t.co/mQRid2n3uR": 0, "Microsoft mb7-839 braindump: xvmp": 0, "New post has been published on Technology Tools | Latest news about  Apple, Google, Microsoft, Facebook... | Techno.. http://t.co/lFYIY487Y8": 0, "your move Microsoft http://t.co/7CtYLjN50O": 0, "WHY IS MICROSOFT WORD CRASHING": 0, "New on ebay Microsoft Xbox One Day One Edition and Playstation 4 . FREE SHIPPING! http://t.co/seXe6m1xon http://t.co/YUP1XCfL0e": 0, "Help I'm stuck http://t.co/HSeKl6WBXq": 0, "Review: Microsoft Wireless Desktop 800 + Keyboard + Mouse http://t.co/y5tOmfHY5L #Device/Gadgets": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/otAHIEhKGV": 0, "Best of the Best of the Year: Fortune: #Microsoft's #Xbox One costs $500 (compared to $400 for the PS4), but t... http://t.co/ZGBWy5b872": 0, "MMA Fight Club: new image http://t.co/0CXOfBQ9Fj via http://t.co/ABUaH7ML8Q #mma": 0, "Corrinne Yu abandona Microsoft y se marcha a Naughty Dog.\n\n-Havok http://t.co/AqeYNAW0uX": 0, "RT @thecanadacom: \"Don't get Scroogled,\" Microsoft warns in leaked video http://t.co/B3uSvJbqLO": 0, "@KkyroGamingg do u have 800 microsoft points i can use": 0, "RT @Abdiirahman23: Kelly Rowland sent this message via Microsoft Excel and then wonders why she didn't get a reply back  http://t.co/jnT": 0, "I get artists want to sell their songs but disappointed Sara Bareilles' song Brave is in a Microsoft commercial.": 0, "#technology Xbox One console breaks sales record http://t.co/s1psstf2Zh (@guardiantech)": 0, "Richard's F1 Blog: new image http://t.co/nK6z6ZzHpy #F1 via http://t.co/u6brH2PXVg": 0, "Microsoft is so good they wrote Windows in java #Java": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/X6PcskiMRk": 0, "\"@TheRealMar6: Microsoft made 500 million dollars off the xbox one in 1 day. Dam\" &amp; that is why bill gates is the richest man in america": 0, "How does Brian not have Microsoft word on his computer.. Like what. #imfucked": 0, "@johnobeto yes, in retrospect, the complete insanity of Jerry Yang's ego saved Microsoft and shareholders from a big mistake.": 0, "F1 Around the World: new image http://t.co/Q4j6u5BA8n via http://t.co/u6brH2PXVg #F1": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership: Ray Cox IV, who currently ... http://t.co/lhINjr1TU5": 0, "16 new blank documents opened since the last time I closed Microsoft Word.": 0, "@jevvv @onslaught86 We're right on the Viaduct Harbour - the big Vodafone building next Microsoft. We have @mojocoffeenz downstairs ;-)": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search: In case you mi... http://t.co/hQ7AtlkPBc #IT": 0, "$10 dollar Microsoft card #giveaway! Must #RT this and be following me and @Regret_Ryno! Winner announced 11/25! #RT http://t.co/w7EWOMnPhq": 0, "Microsoft Xbox 360 Pro 20 GB Matte White Console (NTSC): Price 100.0 USD (0 Bids) End Time: 2013-11-25 05:13:00 PDT http://t.co/ZXkoq5eZJA": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search: In case ... http://t.co/q9GsuCcx9C #newstech": 0, "I still occasionally use a Microsoft Zune. Godamn, I'm cool. http://t.co/XkroWr5MRw": 0, "Apparently \"suspceptible\" is a word. No red underline from Microsoft Word. #WordProblems #Idontwanttodothis": 0, "Microsoft Office 2013 best gla..everything..everything! nak installer can call me ;D graphics, efficiency..everything!": 0, "joppebijlsma AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/WF2DZAzemM": 0, "I need Microsoft on my laptop sooooooo bad ! I refuse to pay for the shit": 0, "_So Microsoft is express shipping me a new console and a coffin for the old one. Pretty great cstomer service!": 0, "Spokesperson says Apple purchase of Israel's PrimeSense, the company behind Microsoft's Kinect sensor is a done deal. http://t.co/iY8MxTGIm6": 0, "MICROSOFT LIFECAM MODEL VX-1000 WEBCAM: $1.99 (0 Bids) End Date: Monday Nov-25-2013 9:08:20 PST Buy It Now for... http://t.co/sSJCRAFq7E": 0, "RT @MoTheRipper: LMFAOOOO Microsoft would have to see me https://t.co/Zy3Tj58caL": 0, "@MicrosoftHelps I'm using windows 8 but it's not a system problem, Microsoft simply hasn't given Steam the key to activate the game.": 0, "Help UCLA computer science students better game design by using this link: http://t.co/QZ8MDLptTT #Win8 #FunApps": 0, "I love it when a new product comes out and they make enough to supply less than 3% of the population #XboxOne @Xbox @Microsoft": 0, "Microsoft acknowledges Xbox problem http://t.co/OoEgtu7Xd4": 0, "The Young Turks: GOP Congressmans Coke Bust Apology http://t.co/VXlynPf1nx via http://t.co/hdZI6v6ii9 #uspolitics http://t.co/yuXyHT0z3h": 0, "RT @mAloud_wpApp: Listen to the Adventures of Sherlock Holmes in project Gutenberg with m.Aloud for windows 8.1\nhttp://t.co/lDQZ34L4mK http": 0, "Life would be so much more enjoyable if Microsoft Office just came with Mac for free. I strongly dislike Pages.": 0, "@cedricbrichau http://t.co/h3JRuHNmvq Sign this useless petition while Microsoft fucks you in the ass. Have a lovely day.": 0, "Anybody know how to do greek letters on microsoft word? I'm trying to get some epsilon &amp; delta action. #asktwitter": 0, "RT @birkdesign: #Birkdesign Microsoft advertisement created by Weber Shandwick that uses our original song Angel http://t.co/oPp4IjyB5m": 0, "@LexorAdams @Star_Fawkes PSN was hacked by cyber terrorists.THEY tried to take ur info.Sony stopped em.Microsoft happily gives ur info away": 0, "Viral on Google News: Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/iEv2uokK5G": 0, "@TheCrackEA I'm a Microsoft fan but..... I'm srry PS4 it looks so fun and better srry @PlayXBLA": 0, "#Win Microsoft Office 365 Home Premium for 1 year ($99) from @office to #getitdone @babylovingmama #ad #giveaway http://t.co/copX8TpENX": 0, "Access Deined: http://t.co/4GrVI5U5PX": 0, "Microsoft vs. VMware. How do they compare? Check it out for yourself: http://t.co/494IRdzt6S": 0, "@SecondSamuel boy, let me grab microsoft word and get started because 140 characters isn't justice": 0, "Microsoft Security Intelligence Report Volume 15 http://t.co/IxIwP6hwv4": 0, "Microsoft Launches Node.js Tools For Visual Studio http://t.co/2SpmnYejof": 0, "@tbhfuckoffpls: kelly rowland sent a text message via microsoft excel and wondered why she didn't get a reply http://t.co/T1gtQy5p4Q ": 0, "@xboxuk @Xbox @GAMELeicester The Xbox One has taken over my life. What have you done Microsoft? :P": 0, "Google Nexus 10 2 vs. Microsoft Surface 2: Which 2 is a Better Buy? - International Business Times AU http://t.co/YarQiZiv2R #Nexus": 0, "#TipOfTheDay: To help reduce the risk of #identitytheft, use Microsoft Update to check your #security updates: http://t.co/4plOXajR2r": 0, "@Faeris_ Yeah it's stuff like that which is why I don't buy any AAA games from EA, Activison or Microsoft.": 0, "Help UCLA game design students in learning how to use feedback from players, use this link: http://t.co/2WcUwEvgDS #Win8 #FunApps": 0, "RT @9to5mac: Report: Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsoft's Kinect http://t.co/y8mL2b": 0, "Microsoft Sells Over 1 Million Xbox One Consoles In Less Than 24 Hours http://t.co/VfxtRhOZwm": 0, "2 Xbox 360 consoles Microsoft White Broken As Is for parts or repair: Price 4.99 USD (0 Bids) End Time:... http://t.co/t6rNgBksxj": 0, "RT @My_Nexus_Time: Google Nexus 10 2 vs. Microsoft Surface 2: Which 2 is a Better Buy? - International Business Times AU http://t.co/YarQiZ": 0, "The \"One Experience for Everything in Your Life\" tag line by @Microsoft presumes we want to recreate work at home. #nope": 0, "RT @LifeHacks: If you want change your Xbox Live gamertag ask your friends to report it as offensive. Microsoft will force you to change it": 0, "Microsoft handed the NSA access to encrypted messages http://t.co/Z1ZoJOdwsj DO NOT CONTRACT TO THESE CONTRACT TRAITORS": 0, "#Nokia is not dead &amp; out : Reincarnation at #Nokia - Planning the next bounceback  http://t.co/HrUfS4c9Fi": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies | WMPoweruser http://t.co/E2oBnpkvOu": 0, "RT @nzthiago: Rooftop nibbles and hearing from @Spendvision and @Datacom about building websites with @VisualStudio? Yes please!  \nhttp://t": 0, "Fashion: BuyTrends: Red juicy apple, would u like to bite? :p \nBite now: http://t.co/maPpZD1uZ9 via http://t.co/qiQqBbpNxe": 0, "Microsoft needs to stop focusing on PC tablets and touch screen PCs. Just focus on what you were good at. A mouse based computer.": 0, "Installing,configuring,and administering microsoft qnx xp masterful: cvOk": 0, "\"@MSLearning: Watch the re-broadcast of the Microsoft #Virtualization training course for a free exam voucher http://t.co/jUfpHKTICM @ScioMx": 0, "@goodguy736 @GregorJake I live right next to Microsoft headquarters I'll ask my friends dad to get me one he works there.": 0, "**ITS LIVE** HOT GIVEAWAY ALERT!! Enter to win a $500 Microsoft Gift Card! There is going to be 5 winners!... http://t.co/SdZhnEsgTB": 0, "RT @robertmclaws: Just think how different the technology landscape would be if Microsoft hadn't been prevented from integrating their prod": 0, "This is why Sony craps all over Microsoft and their lust for your back pocket! - http://t.co/aKT9kgYuWw": 0, "Hey @Xbox @Microsoft y'all should make a Spartacus game. Just saying.": 0, "RT @BenBajarin: Intel and Microsoft's mentioning of the iPad in #2in1 and Surface commercials is an admission that the iPad is not just a c": 0, "These Anti-Google T-Shirts Just Make Microsoft Look Pathetic http://t.co/ACn9I6gsET #tech #science": 0, "RT @PlayStation: Congrats, @Xbox @Microsoft! #NextGeneration #GreatnessAwaits": 0, "Every time I open Microsoft Words to do my c/w I just end up closing it again.": 0, "#PS3 Might Be Too Costly For... http://t.co/okls9IiEWy #EA #game #microsoft #nintendo #playstation #playstation3 #Sony #XBox #xbox360": 0, "Microsoft Project Daily is out! http://t.co/xVqyibotz1 Stories via @TechAssoc": 0, "@Maff50 why not? When Sony sells them everywhere, the PS4 will be way ahead of the XboxOne. Sony needed 2 countries to beat Microsoft": 0, "Download Robot Wallpapers and Themes for Windows7 from the Artist Rettag *** http://t.co/gTXl3I5hFK": 0, "TIL: Microsoft Surface has incredible handwriting recognition": 0, "Microsoft Wasn't Ready for the Xbox One Disaster http://t.co/tsQAJB0IPZ": 0, "@Polygon Microsoft will find another and they still have many great minds on #Halo": 0, "Win a Microsoft Surface from Sweepstakes Advantage http://t.co/5XaOgwKXPx via @PunchTab": 0, "@benlick You can print out the commerce page at http://t.co/F3DtFEu9mX if you would like. ^AC": 0, "Xbox One sells over a million units on day one: Microsoft has announced on the weekend that they have sold over a... http://t.co/IYujmUotRh": 0, "Youre talking to the guy who hasnt approved a stapler purchase in 3 years makes me realize why I dont buy Microsoft.": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/1Mbr1BGiDN #hollywood": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/IZVspKiPk2": 0, "New York City may still have lots of Xbox One units for sale: Microsoft may have claimed that the Xbox One is ... http://t.co/qaOK3icpco": 0, "Omg don't do this to me Microsoft word": 0, "Seriously Microsoft, stop changing the \"a\" in \"et. al.\" to a capital. I've had enough of your shit.": 0, "Microsoft Install fest ! Go to CSB Taft Campus at LRC Main Lobby for free softwares including Windows 8.1": 0, "Inspirational quotes abou...: new image http://t.co/jX36lN5l3x via http://t.co/gxktWhKfbI #quotes http://t.co/fiaMwsi8nA": 0, "Microsoft gets aggressive for the holiday season, offering a full line of \"Scroogled\" anti-Google merchandise.... http://t.co/ASyxKRjgzW": 0, "Provide pointers to students Win 8 app by installing from this link http://t.co/Ao6gBkDQCq #windows81 #seo #CallOfDutyGhosts": 0, "RT @AppAdvice: Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsoft's Kinect Tech http://t.co/WQ8wCoCFMo": 0, "Microsoft Report Exposes Malware Families Attacking Supply Chain http://t.co/P8EmRlnlhe": 0, "I don't think Microsoft or Sony could have made their next-gen console power or eject buttons any harder to find in the dark if they'd tried": 0, "Impressed at how quickly &amp; thoroughly Microsoft turned Skype into an unreliable piece of crap. Every single time it crashes in a new way.": 0, "My answer to Program Manager at Microsoft, Product Manager Rotational Program at Facebook, Product Fellow at KPCB, o http://t.co/uPXBoVSDZN": 0, "@Ianerlaz Please take a moment to let us know what you think of the service we provide at http://t.co/Nbpr3kYXNZ. Thanks. ^JVO": 0, "Microsoft video attacks Google's Chrome as surveillance technology http://t.co/4QxnnscD4j": 0, "Those who mind dont matte...: new image http://t.co/qzZ89jD1IK via http://t.co/gxktWhKfbI #quotes": 0, "RT @danielpunkass: Apple buys the company that built the Microsoft Kinect sensor. Strange times. http://t.co/f6wFmU4LN7": 0, "Congrats @Microsoft, @Xbox One sales hit 1 million on first day http://t.co/giNTWVN6Ns . #Xbox #gaming #news": 0, "@mrmikedude100: What the heck. http://t.co/cy9ulq9pGF Microsoft lies again, tried to cover up Xbone is shit, is anyone surprised?": 0, "Assist UCLA game design students better game design by using this link: http://t.co/C9QL7yQl48 #Win8 #FunApps": 0, "NIB Microsoft Xbox One (Latest Model)- 500 GB Black Console w/ reciept: $595.00 (0 Bids) End Date: Sunday... http://t.co/E3prUtE8eo": 0, "I wanna get an Xbox 1 but for $500??? Microsoft must be outside their minds.": 0, "@Mike4Crabtree Our Tech Support agents would be happy to help. See http://t.co/wapDvXJymy for the number. Let us know how it goes. ^JVO": 0, "Just letting ppl know my team for HUT that i am selling is for PS3, i want 50 dollars Microsoft points because i got XBOX 1, Canadian only": 0, "RT @alxanders: Cracks me up that Microsoft is using the song \"Brave\" to sell their tablets. Thanks I'll stick to iPad. Don't need to be bra": 0, "@Crecenteb  \n\nI have had the worst support at Microsoft on Xbox One due to a very poor policy. Please help me with this! #XboxOne": 0, "@Microsoft Windows 8.1 SUCKS because of the forced use of IE 11 which is not compatible equipment like check scanners. No downgrade allowed.": 0, "Apple vs. Samsung 2 and Inside Microsoft's Search for Next CEO - Eric Johnson - General - AllThingsD http://t.co/i7XI5eZCCT": 0, "We announced our expanded partnership with @Cisco last week for our #enterprise #cloud solutions. More here: http://t.co/GNNax0Pb4O": 0, "@lukavcl03 You like Sony Microsoft or Nintendo the most?": 0, "@lolrenaynay @infinitesadd if you have a copy/key just use that. if it doesnt work, call microsoft and theyll give a new one": 0, "Microsoft Sells Over 1 Million Xbox One Consoles In 24 Hours - Huffington Post http://t.co/Ct6HIYfF5r #microsoft": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/Hck5BuCn8c": 0, "@CNETAustralia How much money does Microsoft lose on each unit sold? $MSFT or is Xbox finally profitable?": 0, "Collection of cool, nice,...: new image http://t.co/XtgIOvVWvg #funny via http://t.co/fnTDKnNbKt http://t.co/2YYDjTqyCC": 0, "@TNF1343 @Fausty99 @NewLeafLucas @SootopoIis Are they like Sony/Microsoft fanboys or": 0, "@HaloWaypoint @XboxSupport @Microsoft sory 2002 i got #Halo &amp; #XboxLive years crossed....": 0, "http://t.co/JLgAhgcNC4: Peacful Sunday everyone from the deep blue. http://t.co/KbclxWYV3n #surfing via http://t.co/mn3EFmuNyP": 0, "Microsoft is thinking big with its Windows Phone OS update  http://t.co/6pbuZdMSXX": 0, "Half an operating system: The triumph and tragedy of OS/2 http://t.co/9cDzLCXXSR #OS2 #MinistryofInnovation #microsoft #Features": 0, "RT @SoaRZoomi: $10 dollar Microsoft card #giveaway! Must #RT this and be following me and @Regret_Ryno! Winner announced 11/25! #RT http://": 0, "I just wrote my entire paper on google docs cuz my Microsoft isn't working and it just exited out and my whole paper got deleted WTFFFFFF": 0, "I'm exploding mentally. \nI can't blame HP for this mess, it's all microsoft fckry. I have so much to do. \nTechnical difficulties suck": 0, "wow  Xbox has even gotten to Toonam? super aggressive marketing by Microsoft.u": 0, "@_ProphetofHate_ I love knowing people in dice and Microsoft": 0, "Great results, awesome rewards just for searching with Bing. Join @BingRewards! I'll get a nice bonus too: http://t.co/1iQsYMFM1c": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/KNW7egHGhG": 0, "RT @InformationWeek: #Microsoft's #Scroogled campaign sells hats, mugs to attack perceived #Google privacy threats http://t.co/eRm8SvujGi h": 0, "@cr @CaptSkyRocket @dmseto adding you now to the Microsoft Box.\nDon't be thrown by my name, please lol": 0, "@Yasmina9513 since when was Microsoft Office ever free": 0, "I'm starting Baby Girl early and the right way. #Xbox360 #Xbox #XboxGirls #Microsoft #Niece http://t.co/AxQyCcSXbg": 0, " http://t.co/2mzOgAknHk 37 Xbox One | 'Microsoft maakt winst op verkoop Xbox One' | meet online community people friend networking | olive": 0, "Microsoft Planning To Unite Their Windows Operating Systems via Ubergizmo - When it comes to ... http://t.co/AMVbpq0QkG": 0, "RT @JessMoulin17: @Stretch_Swagg15 that's why you can't trust Microsoft #teamps4": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership: Ray Cox IV, who currently ... http://t.co/nhBOYpCPj9": 0, "RT @FarikoSerpentes: We're giving away TWO 1,600 Microsoft Points when we hit 1,600 followers! Just RT and follow to enter. http://t.co/erD": 0, "F1 Around the World: new image http://t.co/GODmhjtqPe #F1 via http://t.co/3ND1IhhPrC http://t.co/WS4hypdDy4": 0, "No Microsoft Word... I really do mean pericope. Not periscope. Let's say it together... per-i-co-pe.": 0, "UCLA game design students better game design by using this link: http://t.co/uEMenDjYdN #Win8 #FunApps": 0, "Microsoft Excel's best secrets, saving you time &amp; frustrations http://t.co/ro5UkEsYXA": 0, "Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsofts Kinect Tech: Apple has acq... http://t.co/FWrP4lO8so #Tech #App": 0, "#social #socialmedia #CorpGov #battlerot Is #Google About to Destroy #Microsoft? http://t.co/bvaxga96Tl": 0, "Dear Microsoft Word 2011,\nThe word centre is spelled centre not center in English (CAN).\nSincerely,\nEnglish Canada": 0, "Some day I'll buy one! Just waiting to see if there are next gen \"red rings of death\" - Xbox One review http://t.co/Jwiq66QCJ2 via @verge": 0, "@scorcher117 You would need to contact the Microsoft Store directly - hopefully it arrives first thing tomorrow ^JG": 0, "Think Positive to Make Th...: View more quotes at [http://t.co/FMRtHa6iN4] http://t.co/ypYgeyEWdf via http://t.co/gxktWhKfbI": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold... http://t.co/sa0fXKMz3F": 0, "RT @MSAU: #Microsoft wins spot in school curriculum! This @smh article has the full story: http://t.co/5IUtgnPRjH": 0, "70-685: how are the case hardening tackle otiose a la mode preparing as things go microsoft windows nt 5.2 7 or...": 0, "F1 Around the World: new image http://t.co/BryzKoscFP via http://t.co/u6brH2PXVg #F1 http://t.co/VEg8Dzo0iv": 0, "Dear Microsoft Word, Racialized is a word, so is sexualized. The sooner you learn that the easier this whole thesis thing will be. Love, Me": 0, "Apple Confirms Acquisition Of PrimeSense, The Company Behind Microsoft's Kinect Tech http://t.co/WQ8wCoCFMo": 0, "APPLE FINALLY ADMITS TO BUYING THE MAKERS OF MICROSOFT'S KINECT http://t.co/pan1JkNxQU": 0, "Dear Microsoft Word, I'm pretty sure I spelled my name right.": 0, "@HaloWaypoint @XboxSupport @Microsoft i had product in hand Face to face &amp; @you Refused to make a Fair Exchange to with a fellow human being": 0, "RT @jacknutting: Dear Microsoft Sharepoint: Please die in a fire.": 0, "Assist UCLA computer science students in learning how to use feedback from players, use this link: http://t.co/R4zJq4GSbV #Win8 #FunApps": 0, "@BkLiveWire We're happy to help, Matt. See http://t.co/AcaOC9Bpzv for steps to take. Let us know if they help or if you have questions. ^JVO": 0, "Which is better, the iPad or the Microsoft Surface?": 0, "Best English Quotes &amp; Say...: new image http://t.co/tBcgq5iqgQ via http://t.co/gxktWhKfbI #quotes": 0, "@didgeridoodler: @amandaxlouise @radhasvibes have fun with Microsoft paint for the rest of eternityI do love the paint": 0, "#geek #nerd #gamer: This Microsoft Exec Is Also The Seattle Seahawks... http://t.co/0WXPZjyV1n\n #PaulAllen #RyanAsdourian #SeattleSeahawks": 0, "Microsoft Xbox One (Black Box) Day One Edition 500 GB Black Console w/ Forza: $800.00 (0 Bids) End Date: Sunday... http://t.co/uhAmMMsetH": 0, "Microsoft Planning To Unite Their Windows Operating Systems - Ubergizmo http://t.co/3JbEwSdE6H": 0, "@AlexaRayC \nI have had the worst support at Microsoft on Xbox One due to a very poor policy. Please help me with this! #XboxOne": 0, "RT @forbes: A San Francisco startup takes aim at Microsoft's $20B cash cow http://t.co/sN1xxXqbqh": 0, "RT @Deadline: Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/8OUFttpCJS": 0, "@EmmaPaigez I should probably get Microsoft word on my computer now http://t.co/zyErpDNreX": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/IwEGsOlDTJ": 0, "F1 Around the World: new image http://t.co/DJmO1vDkUA #F1 via http://t.co/u6brH2PXVg http://t.co/FJQP9uvLRZ": 0, "Windows 8 is fucking stuuuuupid. The people at Microsoft need to understand windows 8 specializes for TABLETS. And should not be for desktop": 0, "@Bine646 thanks @Microsoft": 0, "RT @washingtonpost: The Xbox used to be Microsoft's ugly stepchild. Not any more. http://t.co/MJST8auUf2": 0, "@COUGforLIFE nope, Comcast didn't activate the modem that I had installed on Friday. They kept telling me that it was Microsoft's fault.": 0, "@Jonoooo_ @emm4f3rgy im goin to my dads next weekend 1v1 me noobtard my dad works for microsoft i'll get u baned!!": 0, "Skinit Oklahoma City Thunder Kevin Durant #35 Action Shot Vinyl Skin for 1 Microsoft Xbox 360 Wireless Controller http://t.co/s6Rk7he9nG": 0, "Insanely Funny Shit: new image http://t.co/Y5qtsNpfHj via http://t.co/fnTDKnNbKt #funny": 0, "Insanely Funny Shit: new image http://t.co/BVbuQKV3DU #funny via http://t.co/fnTDKnNbKt": 0, "@_ProphetofHate_ I have a thing going on with Microsoft and they are allowing me to download bf3 for $10": 0, "Love Quotes and Sayings: new image http://t.co/CkYWEBlZQh #quotes via http://t.co/gxktWhKfbI": 0, "PS3 has  always had slghtly better graphics, but Microsoft has always exceeded in everything else.'": 0, "RT @thurrott: Microsoft Sells Over 1 Million Xbox One Consoles in First 24 Hours http://t.co/f63u0t7lK5": 0, "@CruelLEGACEY @Microsoft I wonder what people with bad PS4s do if theirs go bad?": 0, "RT @Kanishkalive: Global launch for Microsoft Xbox One http://t.co/5isKIsxdQS": 0, "Since Microsoft already cool with Google, they should just contract Chrome into all the new Window OS in the future": 0, "50 Cent: #frigopopup FRIGO REVOLUTIONWEAR party in NYC. http://t.co/Y6HSPqI7cR via http://t.co/lZ21fxpl5d #celebs http://t.co/8DxXH3bBOk": 0, "I hate things that have to do with Microsoft word": 0, "Xbox One sales top one million units in first 24 hours: Microsoft: Subscribe in a reader http://t.co/Sqgp8Rs172": 0, "@kathyrogonza That is not from Microsoft, Kathy. We recommend resetting your password via http://t.co/sVNvuU5Qzt to be safe. ^JVO": 0, "I have date with Microsoft Word and Robert DeLong tonight.": 0, "@doganGtr I had to download stuff on it like microsoft and virus stuff and I might need a root canal tomorrow": 0, "Microsoft Xbox 360 S with Kinect 4 GB Matte Black Console. No reserve: Price 78.0 USD (19 Bids) End Time:... http://t.co/bfKTZiqMsu": 0, "RT @MalaysianiPhone: iOS: The iPhone 4 is 3 years old, but well give you iOS 7. \n\nAndroid: The lucky ones get updates. \n\nMicrosoft: No pho": 0, "i love the way it 'OMG, HARDWARE ISSUES ON NEW CONSOLES, IT THE END OF THE WORLD' microsoft xbox going bust": 0, "Windows 8.1 3rd Bluescreen in 2 days... last chance microsoft or i will move to ubuntu.": 0, "#Microsoft has captured another #Soul with its colorful screens. Lol #Windows8 #Seattle #PNW #Cat http://t.co/MgySJnxtaU": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/2GGJ52WYbd": 0, "RT @hozboy: I have to admit I love the Kinect it's fucking amazing great job Microsoft.": 0, "RT @JibriMontega: Leave the pussy microsoft like windows vista": 0, "Review: Xbox One: The wait for Microsoft's next-gen console finally ended on Friday with the system's global l... http://t.co/tigSd6mlmA": 0, "@Stretch_Swagg15 that's why you can't trust Microsoft #teamps4": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search http://t.co/0xdW1TYez8": 0, "Download Microsoft Toolkit 2.4.3 Stable\ndisini ( http://t.co/GwqibLZVRI ) http://t.co/G1XtZsqOFS": 0, "Fashion: #Gorgeous #Blue #Platform heel, ur style? \nThe http://t.co/8CizOohMBb via http://t.co/qiQqBbpNxe #fashion": 0, "More than 1 million Xbox One consoles sold in less than a day: Microsoft | http://t.co/5OgLLH8H0F": 0, "USA Water Polo: Three automatic bids have been earned to the 2013 NCAA M... http://t.co/Puta3FDyCP via http://t.co/jDAwU42y28": 0, "Microsoft gives highest Gamerscore holder lifetime Xbox Live Gold http://t.co/KqqiyGbPDH #thetechgame #gamingnews": 0, "WTF is taking this site so long to review the xbox one how long does it take for microsoft to wire money to ign?": 0, "RT @tomwarren: Apple confirms it has acquired the company behind Microsoft's Kinect sensor http://t.co/4Nqd0LtBFu": 0, "@FemaleRevan (I'm an Xbox boy myself, but Microsoft fucked up the Xbox One)": 0, "MICROSOFT: Most Intelligent Customers Realize Our Software is Only for Fools and Teenagers.": 0, "@johnhenrymuller me to \"nothing\" except this article from 2007 : http://t.co/D8hDeay8L5": 0, "Updated. Hyper-V: Survival Guide : http://t.co/tB63Q6obKt": 0, "RT @Tim_Stevens: I don't think Microsoft or Sony could have made their next-gen console power or eject buttons any harder to find in the da": 0, "Xbox One console breaks sales record\n\nhttp://t.co/osHTBpnfEH": 0, "@NJDevilNYGuy RDR GOTY Edition is $15 on Amazon. http://t.co/hWA6U9xFxi": 0, "One thing Sony and Microsoft are forgetting about the UK for their console launches - The UK has a complete shite broadband infrastructure.": 0, "Microsoft advance database-high brimful ornament in order to yours pool: AGWnAs": 0, "Microsoft video attacks Googles Chrome as surveillance technology | Thought FTW http://t.co/8HdpCuzOQs": 0, "Ahw hell naahhhh RT @MoTheRipper: LMFAOOOO Microsoft would have to see me https://t.co/PiSSRjYTjI": 0, "You can get a free Microsoft Points here:  http://t.co/GAHQxsCGRD": 0, "RT @Bill_Nye_Tho__: fuck parties, I'm bout to go hard in the Microsoft Paint and draw pictures of squids #turnup": 0, "these microsoft surface commercials are the least convincing ads ever": 0, "Giveaway -  2 Xbox Ones!!! And Microsoft Swag Bags!\nAwesome giveaway on YouTube! http://t.co/4NbvoKUjhy": 0, "PopSugar: Katy Perry rocked polka dots! Head over to get a better http://t.co/vuTIrl998g via http://t.co/lZ21fxpl5d #celebs": 0, "RT @KINGRPG0: Xbox One Console System by Microsoft http://t.co/tpcq3ARO48 Welcome to a new generation of games and entertainment. http://t.": 0, "Pre-Order Consoles MICROSOFT XBOX ONE CONSOLE DAY ONE RELEASE Including FIFA 14 IN STOCK NOW:  650.00End Date... http://t.co/BX3Bnb0p3E": 0, "Interested to see how this plays out &gt;&gt; The Xbox One is Microsofts attempt to build you a better Wii http://t.co/eml42JZAY1 via @qz": 0, "@Microsoft Can Windows 8.2 be Kinect-enabled, plz? I love the Xbox skin using my HTPC in the HDMI-In but would rather have it Xbox into HTPC": 0, "Microsoft first included Solitaire in their Windows operating system to teach people how to drag and drop.": 0, "\"@Spongebulb: Dear Microsoft Word, I'm pretty sure I spelled my name right.\"": 0, "Words To Inspire the Soul: Many more great posts at  Words To Inspire t... http://t.co/14MT5WNWr0 via http://t.co/gxktWhKfbI": 0, "Microsoft has announced that the #XboxOne has sold more than 1 million units within 24 hours: http://t.co/fRTCwBs8Pk": 0, "Wanna change the ch just talk to the xbox thank you microsoft Gawds !!!": 0, "Xbox One Bundles Kinect Because Microsoft Had No Choice  http://t.co/UdERi29Fmp via @sharethis": 0, "My biggest #giveaway EVER--It's a @Microsoft Surface Pro to make digital paintings with Fresh Paint. it's AMAZING! http://t.co/ctlMAEZnxg": 0, "AllThingsD Week In Review: #AppSung 2, #InternetFunneling and Inside #Microsoft's CEO Search http://t.co/KsIAB5BkXX @allthingsd": 0, "The NEW MICROSOFT SURFACE 2 TABLET is Available Now on Amazon at http://t.co/GSho5IlKls": 0, " http://t.co/5cYWEd72HR 88 Xbox One | 'Microsoft maakt winst op verkoop Xbox One' | meet online people community networking friend | iphon": 0, "I really want a Microsoft Surface for Christmas! ": 0, "@melvinyicong You may create or delete a power plan in #Windows8: http://t.co/VwjMhQTLE4 ^Justin": 0, "@Kiedd_ 2/2 Please take a moment to share your thoughts on our support at http://t.co/AQCt1sco8Y . Thanks for your time. ^MG": 0, "@charlesharper37 Tell Apple and Microsoft to get right on that": 0, "Windows 8 - hey Microsoft, how about bringing back actual windows? #windows8": 0, "@DesignGears @GamesRadar We got it early from Microsoft?": 0, "#geek #nerd #gamer: Google, Mozilla are tweaking browsers for #Web-based games -  As electronic titans Microsoft... http://t.co/D9X5MSXAH8": 0, "RT @Dat_Guy_Yung: @iamMeKay: @Jetlife_DJ: MICROSOFT @Dat_Guy_Yung: Wats the word I see this nigga @Jetlife_DJ  got jokes": 0, "Fuuuuuuuu @July831 HALO programmer moving on to a REAL company =)  RT departs Microsoft for Naughty Dog http://t.co/vByJp8Qb7l via": 0, "@Xbox How is Microsoft going to know a replacement one works its possible the process might go on forever?": 0, "Google puts down Microsoft for selling 'Scroogled' merchandise http://t.co/WgEWYI3r97": 0, "shared a link http://t.co/nOc6vamMao": 0, "Funny Wall Photos: new image http://t.co/ifhkvNRqnt via http://t.co/fnTDKnNbKt #funny": 0, "@microsoft's strategy for marketing the @surface: we're the tablet your annoying HR guy likes.  Why do they think this will persuade buyers?": 0, "Did you know? In 1983, Steve Jobs hosted #Apple's 'The Dating Game' with #Microsoft's Bill Gates as a contestant? http://t.co/r7ZDjiEA5P": 0, "Win a Microsoft Surface from Sweepstakes Advantage http://t.co/MWabkQE3VQ via @PunchTab": 0, "Why can't Microsoft Word have as good of auto correct as my phone?": 0, "Xbox One: A litmus test for the #OneMicrosoft Strategy.Will it pass muster? http://t.co/MdQk0SPxwd": 0, "@Xbox even though I am a PC player and getting a PS4 you guys are still good guys... Thanks Microsoft for being so loyal to you're fans": 0, "Fashion World: Daphne Groeneveld by Patrick Demarchelier http://t.co/3avvTXoALX via http://t.co/qiQqBbpNxe #fashion": 0, "Thanks for sharing! RT @Justinvolved Ways to Expand on Sitecores Content Personalization Capabilities http://t.co/gHhjVheofV ": 0, "Microsoft Xbox 360 S with Kinect 250 GB Glossy Black Console (NTSC): Price 105.0 USD (1 Bids) End Time:... http://t.co/lGcRc0OCzo": 0, "You Are My Life: new image http://t.co/zGzALq1EnR via http://t.co/gxktWhKfbI #quotes": 0, "Microsoft 70-635 blue book free-speaking showing: AgphOlT": 0, "How makes this examen ad eundem ever so much harder or else the ancillary microsoft exams: bfWgKyd": 0, "Corrinne Yu's LinkedIn profile indicates that she has moved from her position as Principal Engine Architect at Microsoft's Halo 4 de...": 0, "Is \"Microsoft IT Advixsory Council\" a Microsoft property?": 0, "@PS4Cast ps4 sold 1 mill in us alone , is somebody missing the point.more american crap , apple v samsung , microsoft v Sony": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console (NTSC): Price 19.5 USD (8 Bids) End Time: 2013-11-29 23:15:17 PDT http://t.co/V3AoguQwMv": 0, "Half an operating system: The triumph and tragedy of OS/2 http://t.co/ZegRk3Dq59 #features #ibm #microsoft": 0, "Microsoft Xbox One (Latest Model)- Day One Edition 500 GB Black Console: $540.00 (0 Bids) End Date: Monday... http://t.co/JAtPX1N2sl": 0, "RT @EverythingMS: Rumor: Microsoft in talks to acquire Winamp and Shoutcast from AOL http://t.co/QulfwDUixu": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One... http://t.co/tsC3J6V3ra #teamfollowback": 0, "The official #xbone headset is rubbish. I cannot use my 5.1 headset cos I have no adaptor. Microsoft says ~ March 2014? @majornelson #fail": 0, "#NeowinFeed Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership: Ray Cox IV, wh... http://t.co/lNNumqIfG3": 0, "Week in Review: HP Mobile, Microsoft Vulnerability, IRS Fast Track http://t.co/1Zso3lK3s0 #startup #Dubai #GCC": 0, "Insanely Funny Shit: new image http://t.co/T7LQ0dx0OX via http://t.co/fnTDKnNbKt #funny": 0, "Here are some Celebrity Pencil Drawings from Various Artists See: *** http://t.co/1ImoLWlR7r": 0, "#microsoft #IBM RT @paulblaser: Half an operating system: The triumph and tragedy of OS/2 http://t.co/LWkMVf4cr3": 0, "MICROSOFT XBOX ONE - DAY 1 EDITION - NEW: $650.00 (0 Bids) End Date: Monday Nov-25-2013 18:01:31 PST Bid now |... http://t.co/mmzbCPF0ZV": 0, "RT @Windows: Announcing the Official @Facebook App for #Windows8.1! Get it here: http://t.co/UA5LxPWH5m http://t.co/N4HKG4v1Uu": 0, "@mgafar Thanks for the retweet, Mohamed! How are things going with the new group of #MSPs? #Microsoft #ImagineCup #WeLoveMSPs": 0, "Josie Maran: Bringing nature indoors is my secret helper with holiday de... http://t.co/9J7iBNVb1t via http://t.co/PEiph2vUXV": 0, "Photoset: buzzfeed: Every Pixar movie summarized in terrible Microsoft Paint drawings. http://t.co/hxzNTbe2Z2": 0, "RT @f1d_2013: Richard's F1 Blog: A must see for all webber fans http://t.co/yxf2S9slXY via http://t.co/u6brH2PXVg #F1 http://t.co/5T4cmqY30F": 0, "Writing an essay? More like staring at Microsoft Word for a bit then going on Facebook. #thestruggle": 0, "RT @melrose24: Naughty Dog hires Halo 4 programmer Corrinne Yu http://t.co/hvSd8lAFHT\nBillion dollar game to unknown company.  @Microsoft @": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/hKVWqMfgzy": 0, "RT @GiveMeInternet: Nintendo congratulates Sony and Microsoft! http://t.co/8lJpAxVizE": 0, "Interested in Citrix, Microsoft and all thats related?! Have a look at http://t.co/begKSfoEmh Please share!": 0, "microsoft word. dont you dare underline my 'behaviour' as incorrect and suggest 'behavior'. how rude.": 0, "Join Bing Rewards http://t.co/qcxvLxQ3gF": 0, "#Gartner analyst slams #OpenStack, again @ http://t.co/uJjBgDdylk": 0, "Insanely Funny Shit: new image http://t.co/k3hZAk1rXy via http://t.co/fnTDKnNbKt #funny": 0, "Played Microsoft Mahjong (WSA) in the last 24 hours. http://t.co/V7WTgouA0v": 0, "@nickis2qt2bstr8 Janeway was Voyager, Picard was Enterprise. Same issue on Voyager tho. Maybe Microsoft did the security? ;)": 0, "Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/IDVdgzqDqU": 0, "Microsoft can suck my fucking dick. I don't need parental settings I'm a fucking big boy. And no idea how to remove them": 0, "@Forbes: Aaron Levie on why startups like Box will beat Microsoft http://t.co/jSrbeT43Qb": 0, "New Microsoft ad uses the \"Brave\" lyrics in its ad: \"...I wanna see you be brave.\" That's... unfortunate.": 0, "RT @ForbesTech: Google employees are rushing to by the Microsoft gear that makes fun of Google http://t.co/M4ucpAPOPk http://t.co/pmjj2Fsx4f": 0, "#xboxone Xbox One disc drive issues being reported by a few new owners, Microsoft responds http://t.co/VldvZmIQd6": 0, "Assassins creed 4 now available on:\nMicrosoft Windows\nXbox 360\nPS3\nWii U\nXbox One\nPS4\n.... Jesus Christ.": 0, "RT @FailedImages: Microsoft customer service failure http://t.co/ltA5KNkuyk": 0, "sony just feels so much more sleek and clean and microsoft feels crowded clunky annoying like lime green and white ? worst colours": 0, "Microsoft Xbox One (Latest Model)- 500 GB Black Console: $499.00 (0 Bids) End Date: Friday Nov-29-2013 16:32:14... http://t.co/u3QxbP6xpG": 0, "RT @TomPelissero: Good to see Microsoft Word now accepts the word \"Cordarrelle.\"": 0, "RT @iurbanteen: iUrban Code Camp launch on Saturday, big success! @VanJones68 @EBONYMag #blacktwitter #STEM @Microsoft http://t.co/tebLzpxx": 0, "RT @Safer_Online: #TipOfTheDay: To help reduce the risk of #identitytheft, use Microsoft Update to check your #security updates: http://t.c": 0, "@Yasmina9513 do you have a google account because google docs is free and it includes everything Microsoft has. go to http://t.co/ZUEgtZoJqO": 0, "microsoft excel - the bane of my GPA.": 0, "Positive Thoughts: LOVE BEGINS WITH YOU: Your inner voice is where your ... http://t.co/QItFfJSmXc via http://t.co/gxktWhKfbI": 0, "New iPad app allows you to use Microsoft Word, Excel http://t.co/Fa21DDP2gI": 0, "@LisaTav Sure, not a problem. Please check that your DNS settings are set to automatic? If you're using a PC, http://t.co/4xywqj6zSj ^JP": 0, "An offshore partner can change the paradigm for Australian #Software businesses http://t.co/fgpYBmZjKT #Microsoft #Java #DotNet": 0, "Check out these funky dance moves! http://t.co/JhT4XgHnCm #jd2014 #ubi #jdtv": 0, ".@xboxsupport @microsoft Check out @tymoss video about his broken Xbox One Kinect! - http://t.co/X8269Y1Oum": 0, "fashion lady: new image http://t.co/lOT7pYCIiv #fashion via http://t.co/qiQqBbpNxe": 0, "I liked a @YouTube video http://t.co/Dn2dCxdwi5 The Making Of Yoteslaya Limted Edition Microsoft Xbox One (Only Model)- 500 GB Black": 0, "RT @thatzachallen: I just LOL'd for a solid 5 minutes! @PlayStation @Xbox @Microsoft @NintendoAmerica #NextGeneration http://t.co/KqDm4T1s3u": 0, "On Chris Pepin dot com: Microsoft Surface tablet impressions: Thumbs down http://t.co/VAn6rCx9zM #mobile": 0, "Microsoft releasing Windows 8.1, a year in making -  LOS ANGELES Microsoft is releasing its long-awaited Windows... http://t.co/UDSTQzkUAo": 0, "@richardaandrews If you have a moment, please let us know how we're doing at http://t.co/ypPDZjOonS. Thanks Richard. ^JVO": 0, "Review: Xbox One - Gizmag: Microsoft's hotly anticipated Xbox One console has finally hit stor... http://t.co/HcekNI2KpP #blackmannrobin": 0, "Evaluate and give feedback to students by installing this Win 8 app http://t.co/nH7DMXiiWh #windows81 #seo #CallOfDutyGhosts": 0, "#Apple acquired Kinect inventor microsoft technology is in trouble http://t.co/5izELAb2bx": 0, "Microsoft excel is giving me heartburn": 0, "Meet the New Pack Rats http://t.co/dh5Bkcnjt2 Exxon, Microsoft and other companies are pressing the federal judiciary to insulate them ...": 0, "Photos That Show The Xbox One Is A Massive Console - It's also larger than Microsoft's .\nHere it is next to a... http://t.co/E4UbrnmNPc": 0, "The Economist | Reincarnation at Nokia: Planning the next bounceback http://t.co/8DoOgoJGFH": 0, ".@idubbs I know right? @Microsoft needs to fix it.": 0, "RT @Computerworld: RT @pgralla: Microsoft 'Scroogled' campaign gets early holiday gift: Google evangelist calls privacy an \"anomaly\" http:/": 0, "Apple confirms deal for 3-D sensing company PrimeSense: Spokesperson says purchase of the 3-D sensing company behind Microsoft's Kine...": 0, "#GetSpiced Microsofts Xbox One vs. Sonys PlayStation 4: The future is now! Last week, So... http://t.co/T29ZLI3gdb Via @spicesofafrica": 0, "Useful Microsoft Word tools for academic work http://t.co/LSJf5huTvH": 0, "One Microsoft Way: Half an operating system: The triumph and tragedy of OS/2 http://t.co/kHWbsXGjvl": 0, "#News Apple confirms deal for 3-D sensing company PrimeSense: Spokesperson says purchase of the 3-D sensing company behind Microsoft'...": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/77wpzWcGni": 0, "F1 Around the World: new image http://t.co/KdiOXTeaAN via http://t.co/u6brH2PXVg #F1 http://t.co/hQkYXEmau1": 0, "Microsoft kinesitherapy: WNwet": 0, "RT @SocalSam: UCLA game design students improve their design chops use this link to download the Win8 Store app: http://t.co/iS7mjq0KyP #Wi": 0, "Why doesn't Microsoft just drop Internet Exlporer from their roster? They already ppl gonna go download Chrom anyway": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/VDvXkaZ3sN": 0, "Microsoft matches Sony, sells over a million Xbox One consoles in the first 24 hours - http://t.co/ADfPWh7oGS": 0, " http://t.co/90XZxgNBrX 97 Winamp | 'AOL wil Winamp verkopen aan Microsoft' | where to meet new people |": 0, "@XboxSupport3 System is still not reading discs. Amazon is shipping a replacement faster than Microsoft was offering to send one.": 0, "Hey Guys and Gals! Don't forget that the special Microsoft Surface promotion is still going on. Just message me for more details!!": 0, "@woahSTYL @CGLCircuit @eVTournaments Xbox is known because Microsoft supports comp and Sony didn't. If they did, it still would be on PS": 0, "@Joe_Gatto @Microsoft is it better than the other xboxs": 0, "RT @wmpoweruser: Microsoft Employees Will Quit If New CEO Implements Marissa Mayer-esque Policies http://t.co/IDVdgzqDqU": 0, "MMA Fight Club: new image http://t.co/8h8YhjoZF4 via http://t.co/ABUaH7ML8Q #mma": 0, "@ChoneColeman7 I haven't used Microsoft Word in 8 years #ImOld #DontEvenOwnALaptop": 0, "RT @MYMicrosoft: Microsoft Malaysia Picks 4 Local Teachers As Expert Educators http://t.co/r1MM4FEMRw": 0, "Halo 4 is Microsoft Studios' best seller so far. Join us at #gamesGRABR http://t.co/yCqcmm4CZF": 0, "AllThingsD Week In Review: AppSung 2, Internet Funneling and Inside Microsoft's CEO Search (AllThingsD) http://t.co/MTJsPagj2e": 0, "RT @xunit: We just shipped Visual Studio plug-in 0.99.1, which hopefully addresses the issues with 0.99.0. http://t.co/tWcMXs3Yyc": 0, "MSDN Magazine RSS Feed: Talk Back: Voice Response Workflows with Speech Server 2007 April  http://t.co/oSenDTqH0L": 0, "RT @Mrkiliannailik: @ABKristian @rushsmith Good Job Microsoft, fucking idiots! Pero eso si, el kinect va de lujo #SarcasmoFTW": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/Tmc3jCBi4B": 0, "Wisdom Quotes: Subscribe us at http://t.co/tsaGLVm9dO http://t.co/D6t2iNTSQT via http://t.co/gxktWhKfbI": 0, "fashion lady: new image http://t.co/Q6kSINRf01 via http://t.co/qiQqBbpNxe #fashion http://t.co/qhTC2qalvH": 0, "Another scroogled attack @Microsoft need to fire everyone in their PR and marketing team http://t.co/hlnDhk4kA4": 0, "Collection of cool, nice,...: new image http://t.co/IqptNaLegH via http://t.co/fnTDKnNbKt #funny": 0, "Microsoft Xbox 360 S 4 GB Matte Black Slim Console COD MW3 Modern Warfare 3 Game: $150.00 (0 Bids) End Date:... http://t.co/FxYgT4V2Ag": 0, "My Christmas list is so weird. \n- A beanbag chair\n- Microsoft word\n- Lamp \n- Wireless keyboard \n- French doors for my closet \n- New case 4 ": 0, "Untaken say over joust being microsoft audition 70-680 but incomparable mcts exams: MjeLgJ": 0, "#Microsoft #video attacks #Google's #Chrome as #surveillance #technology - &gt;Boing Boing&lt; http://t.co/OYYuB6DjdO #paperli via @YourAnonNews": 0, "NaroKast 11-24-13 Ea's new rendition on Used games, and Microsoft getting rid of the Xbox???: http://t.co/PIh8zBQPL6 via @YouTube": 0, "@quiksneak Can you check http://t.co/vnMNLgBa8l to see if there are any messages there, and all info is correct? ^JG": 0, "Task for this weekend? Make a Xbox One 2.5mm headset adaptor. http://t.co/xuPKAOTBvk @Xbox @majornelson #annoying Why make us wait Microsoft": 0, "Competition in the workplace may hinder collaboration and innovation, rather than promote it. #education #educators http://t.co/DqbcO4C4J3": 0, "UCLA game design students improve their design chops use this link to download the Win8 Store app: http://t.co/iS7mjq0KyP #Win8 #FunApps": 0, "Microsoft to take over Nokias iconic headquarters next year http://t.co/3pfqgPJd1P": 0, "#9to5Mac Apple completes buyout of PrimeSense, the 3D body sensor company responsible for Microsofts Kinect http://t.co/WkbFHNGLnn": 0, "@ABKristian @rushsmith Good Job Microsoft, fucking idiots! Pero eso si, el kinect va de lujo #SarcasmoFTW": 0, "Someone please verify from America!  10$ Microsoft Card is equal to 800msp right?": 0, "@Microsoft Matches PS4 Sales With 1 Million Xbox Ones In 24 hours | @TechCrunch http://t.co/Q58bIMzjp8": 0, "Microsoft actually think people will say \"I need a tablet for Xbox and Skype\" out loud. This is how out of touch they are.": 0, "Color-switching mouse for Microsoft Windows PC and Mac http://t.co/T6Ll7RLZsJ": 0, "Giggle Palooza: Yes it is  Giggle Palooza http://t.co/QbYD1r5sTf via http://t.co/fnTDKnNbKt #funny": 0, "Giggle Palooza: Yes they do  Giggle Palooza http://t.co/TeF6iBG4rB via http://t.co/fnTDKnNbKt #funny http://t.co/C5kGFGLIBc": 0, "Assist UCLA game design students by reviewing their apps use this link to download the Win8 Store app: http://t.co/xzoPmmOvlC #Win8 #FunApps": 0, "RT @felixsalmon: \"Why does Steve Ballmer keep making critical executive decisions that effectively tie the hands of his successor?\" http://": 0, "@XboxSupport @Microsoft wanted me to PAY them an additional $499 to get a new #XboxOne, they refused to make a swap, i had product in hand": 0, "Microsoft doesn't want you to swear at your Xbox One http://t.co/eeGjczyRyC": 0, "Microsoft Files Patent for Augmented Reality Gaming Glasses http://t.co/txXXJPR9UE via @mashable": 0, "RT @ComicBook_Movie: VIDEO GAMES: 1 Million Xbox One Sales For Microsoft http://t.co/e2Y0oGpO7C": 0, "Lmao RT @Jetlife_DJ: MICROSOFT @_Ammond: @EBread_ wass the word": 0, "Microsoft Xbox 360 Slim Kinect Holiday Bundle 250 GB Black Console with Extras!!: Price 202.5 USD (4 Bids) End... http://t.co/D5ZLoZ8j10": 0, "Keep up the great work microsoft.I really love my xbox one it's better then all the rest out there microsoft and xbox one is #1": 0, "Microsoft Word claims that \"noob/n00b\" is not a word. I beg to differ, Microsoft. You are such a n00b. #amwriting": 0, "I gave @Microsoft +Kred influence in the Interior Design community http://t.co/bnRk96sYj4": 0, "Instead of licensing Roar did Microsoft license the song that it ripped off?": 0, "Source: Microsoft In Talks To Buy Shoutcast And Winamp From AOL http://t.co/f2SjkU8KFH via @techcrunch": 0, "Just to make sure, windows is registered trademark of Microsoft inc.": 0, "Review: Xbox One: The wait for Microsoft's next-gen console finally ended on Friday with the system's global l... http://t.co/SBztv8M0Uc": 0, "@DCRUColin @jamesmonty2003 Very good thanks. 360 for now. Being IT, we both know, you never buy Microsoft until SPK1...;) Then XboxOne.": 0, "New post: Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/pn0DAtWhLr": 0, "How am I supposed to graph these things in Microsoft Word....what are you doing to me Marina?": 0, "@AngelxRomero @DylanJKleese well it's not like you work at Microsoft.....": 0, "@Microsoft this is complete fuck bullshit. like hotmail doest search through peoples inbox. FUCK YOU! HYPOCRITE!!! http://t.co/D5z6Vy2QDY": 0, "@Under_Inspired CoD ghost runs at 720p because microsoft was worried that it would bring down the consoles performance. look at ps4s issues.": 0, "Tried to buy a 256GB model Surface Pro 2 from the SF @MicrosoftStore today. Sold out. Can't even order online. @Microsoft, what's up?": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/PZ2eH7PNKb": 0, "RT @orbmvf: @Dr_P5 get open office. It's free. You can save your presentation as a PowerPoint as well (as if you were using Microsoft offic": 0, "@christian_pick Hmm. Just to check, you double checked the info at http://t.co/3kQCQmzbiZ ? ^PS": 0, "Thank God for autosave on Microsoft Word": 0, ".@nokia, once the worlds biggest #mobile phone maker, is reinventing itself. Again. @TheEconomist: http://t.co/28NabuD8mx #tech #innovation": 0, "@_krazim it's available for Android and iPad lol i'm not sure if it will come to microsoft.....there's Finale but...yea XD": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership: Ray Cox IV, who currently ... http://t.co/IEIShY2ReU": 0, "RT @mikebaz: @johnobeto yes, in retrospect, the complete insanity of Jerry Yang's ego saved Microsoft and shareholders from a big mistake.": 0, "@TechCrunch: Apple Acquired 3D Sensor Company PrimeSense http://t.co/ek2tjaHndi by @chrisvelazco ...Microsoft had years to buy this": 0, "Internet Explorer 11 is fucking up group policy everywhere. God fucking dammit, Microsoft.": 0, "Microsoft Xbox 360 S 250 GB Glossy Black Console (NTSC) with Kinect + 2 Games: Price 50.0 USD (0 Bids) End Time:... http://t.co/WRkjkRIqoD": 0, "Microsoft puts internal price on carbon; Google is trying to change the economics of energy.": 0, "http://t.co/JLgAhgcNC4: new image http://t.co/6EwXfvNoQ8 via http://t.co/mn3EFmuNyP #surfing http://t.co/NQ1Z6UFAaL": 0, "RT @LegendSteveJobs: Microsoft trying to convince consumers that a Surface is better than an iPad... LOL": 0, "Why tf this miss saying he can't open a Microsoft word file... ughhh I told these mfers but to bother me on Sunday night like really": 0, "Test4pass microsoft bring to test 70-178 great go megrims rally questins 4shared: BrkAqZv": 0, "@Microsoft I should have stuck with @Macintosh. Been on Macs since before there were hard drives.": 0, "RT @tomwarren Apple confirms it has acquired the company behind Microsoft's Kinect sensor http://t.co/CchHTEVw6V &lt;&lt; bad news for Microsoft?": 0, "RT @itsmrdmc: Jesu!\"@temitopeybnl: Oloun!\"@Boobs_r_big: WE REALLY DONT CARE BRUH \"@thimmyt: Dear Microsoft Word, I'm pretty sure I spelled ": 0, "RT @the_ironsheik: CHRIS BROWN WIN #AmericanMusicAwards FOR GO FUCK YOURSELF": 0, "RT @VTTechnology: Updated: Active Directory: Glossary : http://t.co/TgsEYB92FH": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/okGmiT9pk5 #technology": 0, "I gotta teach my pops how to delete words on Microsoft Word every week......how immigrant can this man get?": 0, "#2: Learning Microsoft Windows Server 2012 Certification - Exam 70-411 - Training DVD: Learning Microsoft Wind... http://t.co/iovq6EyyJn": 0, "RT @antikewl: \"It's almost like Microsoft expects me to be there, and Sony's happy for me to be there.\" http://t.co/Yyz8SFVyum": 0, "i REALLY hope microsoft word saved that document for me D:": 0, "Xbox One console breaks sales record http://t.co/QE94pyBoUe via @guardian": 0, "@Microsoft you're ruining your console, why are people getting banned for swearing in videos? You should at least add a maturity filter": 0, "I leave the pussy Microsoft like Windows Vista": 0, "#Gossip #Entertainment Console Wars 2013: Microsoft's Xbox One vs. Sony's PlayStation 4 http://t.co/Qu7XbMeS2y #Celebs": 0, "the fact that I have to write this essay on icloud notes because my damn Microsoft word expired is kinda ridiculous": 0, "Encore Blog Archive: No Conspiracy - Microsoft Dynamics GP is Here to Stay http://t.co/g0mBF6hzp8": 0, "Damn! Funny: Dora the Internet Explorer http://t.co/MX4YUflA2H via http://t.co/fnTDKnNbKt #funny": 0, "Xbox One and PS4: The Best of Frenemies: \nWere we the only ones who noticed Sony's subtle dig at Microsoft's X... http://t.co/hKXGbvskWt": 0, "PowerObjects Launches The CRM Book, a Online Resource for Microsoft Dynamics CRM http://t.co/yQtVJE5vFi via @sharethis Very Cool #CRM2013": 0, "@kellabyte @spyced In mining the joke is, \"No one ever got fired for buying Cat(erpillar).\" In IT, it used to be \"Microsoft.\"": 0, "Is the new @Microsoft commercial implying it's #Brave to buy a @Windows tablet? #awkward #eventheyknoweveryonewantsanipad": 0, "Apple reportedly acquires the company behind Microsoft's Kinect sensor  http://t.co/FEm8mX0wpp": 0, "fJust bought Office 2013 Professionl for $9.95. Thanks to my employer Perficient and Microsoft Home Use Program.": 0, "Microsoft Planning To Unite Their Windows Operating Systems http://t.co/lOhEG9xSgC": 0, "RT @LifeCheates: Can't afford Microsoft Word? Get \"open office\", it's the same thing except it's free and has more features.": 0, "You can get a free Microsoft Points here:  http://t.co/GAHQxsCGRD @TDoAxFuZe": 0, "New on ebay Microsoft Xbox One Day One Edition and Playstation 4 . FREE SHIPPING! http://t.co/seXe6m1xon http://t.co/QfvaeMgZre": 0, "Microsoft Xbox 360 250 GB Black Console: Price 35.0 USD (31 Bids) End Time: 2013-11-26 00:59:24 PDT http://t.co/Oe9zSg9Uuq": 0, "Watch The Highlights Of #Xbox One Launch Events Around... http://t.co/DPe6Rumrnd #launchevents #LaunchEventsAroundTheWorld #Microsoft": 0, "@ehusoy how the f did u get an Xbox one. My host dad works at Microsoft and couldn't get one.": 0, "@Microsoft You should have a warning on 8.1 update that if we proceed there is no going back &amp; that we will be stuck with 8.1 &amp; IE 11 too!": 0, "Half an operating system: The triumph and tragedy of OS/2 -&gt; http://t.co/abk00oRbcj #microsoft #tech": 0, "Microsoft Moves More Than 1 Million Xbox Ones on Launch Day http://t.co/IQBK8UmOIh via @pressly": 0, "Find the biggest selection and #best priced Xbox games here: http://t.co/8i4PZwDKLR #xbox #microsoft #video #gamer #sale #games #xbox360": 0, "@TProphet Thanks!  I learned a lot at Microsoft.  But it has been fun to learn and grow outside of there as well.": 0, "F1 Around the World: new image http://t.co/NTJBVptBQp via http://t.co/u6brH2PXVg #F1": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/dCApHpZ2Ys": 0, "A good read - http://t.co/50eQKmqbzy\n#WindowsAzure": 0, "@Microsoft to get EU approval for $7.3B @Nokia deal, http://t.co/olEUEqW7kq": 0, "Harper's Bazaar: Prepare yourselves: the holiday shoe report is in. http://t.co/jxvkLh5MoS via http://t.co/qiQqBbpNxe": 0, "So, did Microsoft run out of the \"Scroggled\" mug, or did they withdraw it? I want that mug, dammit! http://t.co/FSM4j6mN7Z": 0, "Microsoft video attacks Google's Chrome as surveillance technology - Boing Boing http://t.co/NXUzDXwRFP": 0, "Week in review: AppSung 2, internet funneling and a look inside Microsoft's CEO search. http://t.co/qxT3aQcrrJ": 0, "Microsoft gives highest Gamerscore holder first lifetime Xbox Live Gold membership http://t.co/209mJpNQy9": 0, "*enjoying this new keyboard*\n\nMicrosoft does some good shit.": 0, "RT @WindowsITPro: 'Microsoft Surface Pro 2 vs. Surface Pro: Should You Upgrade or Not?' http://t.co/6Tp5ljlAuI": 0, "Those who mind dont matte...: new image http://t.co/XFrjOPKncM via http://t.co/gxktWhKfbI #quotes http://t.co/MjJXgK1WsV": 0, "Win a One Microsoft Xbox One Day One Edition Console! from Bens Bargains http://t.co/wV7wiQFngD": 0, "RT @allthingsd: Week in review: AppSung 2, internet funneling and a look inside Microsoft's CEO search. -by @heyheyesj http://t.co/R1PNn0LK": 0, "Microsoft wants to sell you anti-Google mugs andt-shirts\n\nhttp://t.co/lF0lRCrxZJ": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/hwmvMavIn4": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg http://t.co/UjfxHmMn1l #Technology": 0, "Microsoft updates SkyDrive for iOS with photo auto-upload http://t.co/1kq4metwFz #CanadianReviewer": 0, "RT @reckless: Kind of weird that NFL is sponsored by Microsoft Surface but there are Kindle Fire ads on the Fox NFL set?": 0, "@breakin419 We don't have any information on any headsets that are not official Microsoft headsets, I'm afraid. ^NX": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours http://t.co/esssBBPdrf via @NikkiFinke": 0, "Microsofts Xbox One Breaks Sales Record, Moves 1M Units In 24 Hours: Microsofts new Xbox One console moved a... http://t.co/c79YmHB2kL": 0, "#Avanade is #hiring Senior Project Manager - Dynamics AX with #1 Microsoft Gold Partner (Houston) (US) http://t.co/Uqi0XriKhZ": 0, "Installing programs on my computer that I can even access won't persuade me to upgrade. To mislead is not my style. #Microsoft @Microsoft": 0, "@mcdonavins you gotta buy the games over again. smh both sony and microsoft wont allow backwards compatibility": 0, "RT @ChrisPepin: On Chris Pepin dot com: Microsoft Surface tablet impressions: Thumbs down http://t.co/WumhAsd345 #mobile": 0, "Michel Bourez: new image http://t.co/QP6eylzDdB via http://t.co/mn3EFmuNyP #surfing": 0, "\"Microsoft video attacks Google's Chrome as surveillance technology\" http://t.co/NylVwk4EQf / clever mktg (fixed link) thx @glennattridge": 0, "Now at #1 'HTML Fixes for Kindle' by Aaron Shepard http://t.co/fc0a3OkN2F in New Writing, Research &amp; Publishing Guides #HotNewReads #sub499": 0, "#Win Microsoft Office 365 Home Premium for 1 year ($99) from @office to #getitdone @babylovingmama #ad #giveaway http://t.co/fDl9xUGjVg": 0}