{"RT @WindowsPhoneUK: Instagram for WP8 is here! To celebrate, were giving away a Nokia #Lumia1020! Follow us on Instagram to enter: http://": 0, "Photo: fuckyeahjhene: everytime he leaves the stage :) http://t.co/sbQwc4Gg3n": 0, "circumcisions: boobs and boob censorship and the point at which boobs are considered nude are so weird. you... http://t.co/aRPdkiltxj": 0, "rule number 1: You never ever tell someone to kill themselves rule number 2: You never tell someone that... http://t.co/qVsdbBD3ot": 0, "AHHHHHH SHEEIITTTT. SUB TWEETING NIGGAS AND SHIT": 0, "Photo: allblackerrthingus: Everything Hip-hop/Fashion http://t.co/OcHltSMgbT": 0, "More than 1 mln Xbox One consoles sold on launch - This is a Real-time headline. These are breaking news, delivere... http://t.co/xBREEE4epb": 0, "RT @surface: Another #RemixProject is underway with @Indabamusic &amp; @TheHives. Win a #SurfacePro2 &amp; get on @xbox music. Enter here: http://t": 0, "lookn4wins: $MSFT Chart $MSFT Most recent stock chart and tec http://t.co/nkcLFHakKY": 0, "RT @Windows: Did you know that your #Windows8.1 Start screen is your apps, friends &amp; sites in one place? http://t.co/LQqxH8zSAI http://t.co": 0, "Photoset: Last Christmas, I gave you my heart http://t.co/hIWSvQCJKJ": 0, "RT @ravennm_: im pia mia guys #msft #III #jadensmithismyleader #bffisajenner #actinglikeimintheilluminatiwhenidkwthitis http://t.co/Io6bjmy": 0, "$AAPL $GOOG $MSFT $SNE Increasing popularity of mobile games could soon threaten console sales http://t.co/QpQGG92xza http://t.co/dqjQyerfF9": 0, "RT @officialjaden: Be Different.": 0, "faller @HillbillyGossip: How Ford's Alan Mulally Already Tried To Fix Microsoft (MSFT) -  Microsoft... http://t.co/fAxuFQA5Y2\n #ChristmasEve": 0, "RT @MSFTDynamics: Must read! RT @xRMConsultant: #MSDynamics announces #CRM2013 Best Practice Analyzer - http://t.co/Lu271PcKsc #MSDynCRM": 0, "Dow #Stocks Performance #BA #TRV #WMT #UNH #NKE #CAT #MRK #GE #GS #MCD #MMM #PFE #CVX #MSFT #JPM #UTX #DIS  more@ http://t.co/TvzJfd0RGT": 0, "Join Microsoft employees supporting ISHA Foundation and other youth causes #GivingHero: http://t.co/iUYR664Gtx http://t.co/bQAsjMH31A": 0, "Video: New Devices For The New Windows. http://t.co/yIGYHY6Iwa #msft #windows": 0, "Ima remember that. (Felicia voice)": 0, "My life . http://t.co/FbDmxjt3pT": 0, "Microsoft Almost Put Smell-O-Vision In The Xbox One Controller (MSFT) -  It used to be that in certain movie... http://t.co/whmGIEqkKM": 0, "Gotta find something else to watch now.": 0, "RT @blavkhippy: fresh prince never gets old": 0, "im pia mia guys #msft #III #jadensmithismyleader #bffisajenner #actinglikeimintheilluminatiwhenidkwthitis http://t.co/Io6bjmywk3": 0, "Photo: euro-trottie: jackofalljams: theboringlifestyle: cestmlled: transientsoulscribbles: His baby mama... http://t.co/j5wcZnFaTs": 0, "Thanks for the Defective Xbox One, Microsoft!: I knew Microsoft's (NASDAQ: MSFT ) new Xbox One wouldn... http://t.co/51erOle3ck #XboxOne": 0, "$MSFT $AMD Thanks for the Defective Xbox One, Microsoft!!!!!!! Twitter ablaze #xboxonebroken http://t.co/gopONu9WD9 http://t.co/Z2J1SOZ4c0": 0, "awww angel wanted to come over my house yall.": 0, "loving my new baby  #xbox #xboxone #xbox #microsoft #nextgen #jumpahead #nextgenishere #msft http://t.co/fZZCoziuhi": 0, "RT @ASAPRockyTRILL: I don't even get mad anymore, I expect bullshit from people.": 0, "@colinbowern It's not ideal, IMHO, for MSFT to have this large of a lock on it. But that is true, making small numbers bigger isn't as hard.": 0, "@Krukester Reporting to the first party is reporting to Steam, Microsoft or Sony. MSFT/SONY will follow up on reports the same as ATVI does.": 0, "Another #RemixProject is underway with @Indabamusic &amp; @TheHives. Win a #SurfacePro2 &amp; get on @xbox music. Enter here: http://t.co/iSxDmu2aps": 0, "@vgill ironically surface 2 64 was only available model at MSFT Store near my home in SoCal.": 0, "Photo: allblackerrthingus: Everything Hip-hop/Fashion http://t.co/7toB2bLqTk": 0, "RT @ddlovato: Can't wait to sing for you guys at the @MicrosoftStore grand opening this Sat at @BurlingtonMalMA! Whos coming out? http://t": 0, "RT @ThugginGuera: I feel so pretty , like fr . ": 0, "Haven't talked to #oomf this whole day .  .": 0, "@jsmactavish75 Sorry to hear that. Restart phone. Has this phone been able to connect to wifi hotspots before?: http://t.co/LImXlNQwdf": 0, "RT @RiskReversal: If Mulally $MSFT CEO, what baby would b thrown out w/bathwater? @Danneilwsj Ford's loss is the the Range Rover's gain htt": 0, "Didn't know Google bought Quick Office. Comes with KitKat. Nice shot at $MSFT.": 0, "RT @MicrosoftASIA: Video: New Devices For The New Windows. http://t.co/yIGYHY6Iwa #msft #windows": 0, "@_jasonmelancon And it remains regardless of level or boost?  Consider a Refresh: http://t.co/rhgrpzANWT": 0, "Ambassadors of Nokia @ MSFT Indonesia http://t.co/oDzZj6MPET": 0, "peachhhh: tumblr is the only place youll find teens with the lowest self esteem who still think theyre... http://t.co/5hwQwO8hb1": 0, "@zerohedge GS est. that 40% of all op. earn. in 2014 from tech. AAPL CSCO MSFT  etc. are dragging down S&amp;P PE. Most stocks not cheap.": 0, "RT @MicrosoftBI: Here's how to improve your chances of winning some great prizes and a trip to #PASSBAC in the #PowerBI Contest: http://t.c": 0, "Dow #Stocks Trend $TRV $UNH $GS $PFE $CVX $UTX $DIS $AXP $MRK $JPM $WMT $MCD $MMM $NKE $V $MSFT $GE $PG $DD $XOM @ http://t.co/TvzJfd0RGT": 0, "@stroughtonsmith live and learn from minecraftrers MSFT. 9 year olds are running servers thanks to YouTube.": 0, "Bastards! #Android 4.4# KitKat ships w/o browser. #OEMs have to license #Chrome or build own http://t.co/pqyTVFKupA Smells like MSFT spirit": 0, "@XboxSupport2 It technically is cable, just the Set Top Box is a MSFT product and not Motorola. I just need the IR code to enter into XBOne.": 0, "RT @Windows: The @skypemoments adventure continues! See how Mike Corey used #Windows 8.1 in Greece! http://t.co/dCoTccBL5f": 0, "RT @GhettoVines: Damn nigga what the ball do to you!?https://t.co/AZfuiguSdG": 0, "We knew #MSFT would post MONSTER sales #'s, but matching PS4 Sales With 1 Million Xbox Ones In 24 Hrs http://t.co/qefuWb18UJ": 0, "Photo: jordannewt: smile through it all http://t.co/EhP0vxy7Pi": 0, "\"@Microsoft: Want to see what goes on behind this door? Right this way: http://t.co/f6rXfYM56B http://t.co/0S9xDwk409\" (HR my card please.)": 0, "RT @Office365: We've been busy making the Word Web App even better.  See whats new here:  http://t.co/iuXglhbYcd": 0, "Commented on StockTwits: Now there's some wild speculation!  UBS predicts $MSFT price 20 cents from its current pr... http://t.co/mSbiFJz1Gc": 0, "Photo: cafemusaiin: samsvirtuallife: positlvedreamer: cafemusaiin: i gave my grandma two dollars to get me... http://t.co/inNNMWfHYl": 0, "Now I'm ready for some Starbucks ": 0, "Marc Benioff To Steve Ballmer: Yes, You're 'An Emblem Of An Old Era' And It's Time To... http://t.co/6S1vK7NrAx": 0, "RT @TechEd_NA: Lay the foundation to help get more out of your #msTechEd sessions  Sign up for a Pre-Con seminar! For more: \nhttp://t.co/I": 0, "RT @StanWongTV: Over 1 million Xbox Ones sold on day one, matching PS4 $MSFT $SNE\nhttp://t.co/NtNGxabs67": 0, "Photo: fapidly: miley cyrus and robin thicke at the vmas, unseen footage http://t.co/mymKAkcChZ": 0, "Bearish on $MSFT? UBS thinks it's worth $37.23: http://t.co/EonfV3iKqg": 0, "Photo: chibird: Why do we have to grow up and stop appreciating things that make us happy? Theres nothing... http://t.co/OIyT7O4fjQ": 0, "@sergesc Glad to hear it, Sergio! We see you're training for a half marathon; have you seen the health &amp; fitness app? http://t.co/CKZbB1eWro": 0, "Found box with old (last century) Microsoft reviews, my Darth Maul light saber and my first MSFT badge http://t.co/FsnBGOia72": 0, "Photo: b0mbshell101:  i follow back  http://t.co/UAZotSPcGt": 0, "$MSFT $SNE $AMD The Xbox One is out! Sony already sold 1 million PS4 consoles. Pressure is on! http://t.co/g1oNJ6MRDQ http://t.co/6Q4kGfi1ur": 0, "RT @Simmieee_: Polar express is my movie  I can watch it 24/7.": 0, "RT @Moan_InSpanish: Don't get madWhen you see me doing what I was trying to do with you with somebody else": 0, "@aintrabar Definitely some software issues. I feel like MSFT keeps rushing too much of their software in their hurry to be a device company.": 0, "Lrt I can't stand that!": 0, "RT @Microsoft: In the last 24 hours, #XboxOne gamers have killed 60 million zombies! http://t.co/coyHNS3iFR": 0, "Enjoy your favorite digital books, magazines, newspapers &amp; comics with @nookBN, now for #Windows8.1: http://t.co/RE3fxRndbx": 0, "Shallow": 0, "RT @WindowsAzure: Get ready for the 2014 Global #WindowsAzure Bootcamp! http://t.co/Ux4KSRdleO (cc: @noopman @maartenballiauw @alansmith) #": 0, "2 Reasons #Microsoft Needs a New CEO Now #MSFT, #NOK: http://t.co/tXdTHjMgLb via @themotleyfool": 0, "That squirrel be killing me": 0, "RT @Health_IT Not only can #healthanalytics improve #patientcare, it can significantly boost operational performance http://t.co/1qESdDi4H2": 0, "RT @Microsoft: Over 1 million #XboxOne sold in less than 24 hours! http://t.co/MgHKBqtrJv": 0, "RT @Microsoft: Join Microsoft employees supporting Knock Foundation and other youth causes #GivingHero: http://t.co/atDSc2Wpsp http://t.co/": 0, "Nvm ice age on.": 0, "The way you can understand all of the social media is as the creation of a new kind of public space - Dana Boyd, Social Media Research MSFT": 0, "Photo: snowandcoco:  new seasonal blog, followsnowandcocofor more winter  http://t.co/ppVaTfxQJG": 0, "makeme-bitemylip: I dont need to pick the petals off of daisies to know he loves me not. http://t.co/yli4U2Gxla": 0, "RT @tyonnxx: BORING ass saturday with NOBODY to talk too ": 0, "RT @chvnelxovo: Staying under the dryer is EVERY black girl nightmare.": 0, "I really just want to talk to you": 0, "Microsoft Corporation: 111 (+0.36%) http://t.co/VMHghcR6Wq $MSFT #Microsoft": 0, "RT @DrakeTakeCare12: I never changed. I just learned.": 0, "Photo: shez-a-bitch: http://t.co/oUA2eVDafm http://t.co/3wNrXWhsj4": 0, "Really cool New Devices For The New Windows. Take a look to the video: http://t.co/gkOrQrC9qY #msft #windows": 0, "$AAPL I've decided. Ios7 is a waste of time and a joke. $msft would've been crucified for this. NOTHING will help.": 0, "lookn4wins: $MSFT Chart $MSFT Most recent stock chart and tec": 0, "@Xbox  heres a challenge for @sidneyrice . Im sure You can afford an #XboxOne . If $msft gives you one, donate one to someone in need.": 0, "@carolroksurwrld Continue checking the product page for the latest stock updates: http://t.co/pwE0rvi8H7.": 0, "@HungRhames Well $500 ain't shit to ppl around here. Went to the MSFT stores out here aint had any. Can't eem order them shits online": 0, "As #Microsoft #Xbox One Sells Out, Is It Americas New TV? - #Microsoft #MSFT - 24/7 Wall St. http://t.co/vupHbCXRgM": 0, "rnedia: trying to argue with someone over text is like being italian and having to talk with handcuffs on http://t.co/CO3LSKXko4": 0, "@RahulBose1 @sachin_rt Now I wrote my own piece :) http://t.co/3Om8dgMgYG": 0, "If $AMD if receiving anywhere near $100 per Xbox One or PS4 unit, then buy shares as fast as possible. It'll soar over next year $MSFT $SNE": 0, "RT @Microsoft: Weekend Reading: Game on! http://t.co/KEPYOGBvxk http://t.co/nGjKAznpTa": 0, "There are two types of best friends - Number 1:The best friend who yourereal close to. You see them at... http://t.co/tn8OGkefCS": 0, "Would Alan Mulally Be A Good Fit At Microsoft? http://t.co/7z9Po47m4a $MSFT, $F": 0, "RT @market: Seeing is believing. Xbox support wait at \"less\" than 512 minutes. #xboxonebroken $MSFT http://t.co/1krEM9zYgW": 0, "Love to the God Almighty .": 0, "that was so much fun ": 0, "Snap Up Windows #BlackFriday Deals on #Surface Tablets and Notebooks http://t.co/PZNk7CjkV6 via @sharethis #msft": 0, "MSFT: 37.57 (USD) = 23.16 (GBP)": 0, "Can #Intel turn #Android into #Windows? http://t.co/qcNS4OIeVr via @CNET #intc #goog #msft": 0, "Representation without taxation: #Tech giants and their loopy business of innovative tax avoidance http://t.co/HQ3NfcN4CQ #goog #aapl #msft": 0, "RT @MicrosoftPIL: .@AnthonySalcito explains to @BBCWorld, schools focus too much on buying #tech &amp; not thinking enough how to use it. http:": 0, "RT @Windows: Enjoy your favorite digital books, magazines, newspapers &amp; comics with @nookBN, now for #Windows8.1: http://t.co/RE3fxRndbx": 0, "RT @macklemore: #JACKSONVILLE .. Come to the @MicrosoftStore grand opening this morning to get tickets to our free show tomorrow!! http://t": 0, "jazuthewasianprincess: olgg: If I was a famous actor and had a horde of fangirls, I would stay single, and... http://t.co/dG1f3Tg8d5": 0, "Don't nobody wanna take me to kangaroo ": 0, "@Nett0t Here's a great list of #Windows8 Education Apps: http://t.co/UwCGW6NzUf. Let us know if you find any that you love!": 0, "Why Sachin Tendulkar deserves a Nobel Prize in Economics https://t.co/t6kBEkPEap": 0, "RT @tezgotdajuice: Im convinced aint nobody loyal .. Shit sad": 0, "Massive thank you to @msft_production's #SundaySurgery for today. A lot of food for thought and great feedback. http://t.co/c6kqYpI6JG": 0, "RT @Moan_InSpanish: If it takes you 5 hrs to respond back. Honestly don't even bother. ": 0, "Photo: tmyearbook: cupcakeluvsmb: I dont really like how it turned out but Im REALLY HAPPY! My butt was... http://t.co/5qxPnnp3py": 0, "I'm such a big kid.": 0, "Photo: mydicktouchthewhwta: stankydro: lol thats 4 words  http://t.co/ujHuWsOsx5": 0}