{"Announcing the brand new free #OneNote app available in Windows Store. Download today! http://t.co/JB1IzrimsD": 0, "@braintuba Hey there! Have you contacted our customer support team about this question? http://t.co/7RyjEPkIKJ": 0, "$MSFT - Apple completes buyout of Kinect sensor company PrimeSense -&gt; http://t.co/RVJBWfsz5H #stock #stocks #MSFT": 0, "RT @TupacShakurPage: Will I live to see tommorrow, am I fallin off? I hit the weed and then proceed to say fuck all of y'all!": 0, "@arodvet Hey Alex, please refer to our shipping table for more info on next day delivery for orders placed on Friday: http://t.co/hXFppVmvI9": 0, "RT @MSFTDynamics: See you there! RT @ColleenRedingto: Convergence news - great! http://t.co/d8kPtzRyWk\n #MSDynAX #AX2012 #CONV14": 0, "One of our festive friends could lead you to win a $500 gift code with the Black Friday Deals Dash. #OHWhatFun http://t.co/oY6c22XxKw": 0, "Yes he caught that": 0, "Mascot on the weekends, MSFT employee during the week. Meet the man behind Blitz, the mascot of the Seattle Seahawks. http://t.co/Pjs3Zz3wOr": 0, "We need to win this game so we can be tied with the eagles for 1st place in our division": 0, "Xbox One 1 million unit in single day.\nWell done Msft": 0, "Join Microsoft employees supporting College Success Foundation + other causes #GivingHero: http://t.co/zqgXHexx6t http://t.co/dM6KvIq10d": 0, "through the years , we all will be together": 0, "RT @TupacShakurPage: I ain't a killa, but don't push me!": 0, "have yourself a merry little christmas": 0, "FREE Webinar Nov 26 - Learn how to prepare and navigate government and large corporate contracts http://t.co/VxaiMPswTX  #SupplierConnect": 0, "@rasharm_msft @visualc @JamesMcNellis everyone got drunk essentially, and started fighting over what's the best programming language :-D": 0, "RT @MicrosoftBI: Here's how to improve your chances of winning some great prizes and a trip to #PASSBAC in the #PowerBI Contest: http://t.c": 0, "Jim Cramer's Top Stock Picks: PRGO NFLX MSFT VEEV CNQR - http://t.co/q0ovFGhMDg": 0, "i need to do laundry": 0, "RT @windowsserver: Success with #HybridCloud: The Components of a Microsoft Hybrid Cloud in detail http://t.co/c136aBKGhn #WinServ": 0, "One way to make your living room more festive. #XboxOne http://t.co/rIc6JTeZir http://t.co/7SnkacD7YZ": 0, "RT @OneDuniversal: LETS SEE HOW CAPABLE WE ARE OF LAST MINUTE VOTING \nNO MATTER WHO YOU ARE, HUMAN/ANIMAL/FISH\nJUST RT THIS \n#mtvstars One ": 0, "@pattiemallette i love you so so much ": 0, "let me know that you're all right": 0, "The #WindowsIntune Company Portals for iOS + Android are now available, get details  http://t.co/DH2JQ1uC1y http://t.co/IJv69YQmeg": 0, "RT @WindowsPhoneUK: Zoom in to capture life's greatest moments. Nokia #Lumia1020. Nothing else comes close. http://t.co/uDw2rdcHWj http://t": 0, "#Office365 is so much more than Office in the cloud.  Its like getting an IT department as well. http://t.co/5GtMmEe8qv": 0, "Microsoft Says Initial Xbox One Sales Exceed 1 Million - Bloomberg: Microsoft Corp. (MSFT) said it... http://t.co/CnzxB8jsg0 #tech #news": 0, "Ayy lets go #Cowboys win": 0, "i want to be msft so bad": 0, "Come on man they really on des bryant": 0, "Googlers Love Microsoft's 'Scroogled' Gear. Mug and Shirts Sell Out.  http://t.co/k72MWxsvDk via @forbes #Google #Msft #war": 0, "soooo mad that i have 3 tests tomorrow ...": 0, "RT @xTrueJadenatorx: #YouKnowYoureFromTwitterWhen you have high standards bc http://t.co/GClCsBACwe": 0, "@florizelmedia You can also always access Web Apps for free. http://t.co/qulaqUaENw Feel free to DM us if you have any questions. Thanks!": 0, "Watching my my #Cowboys play": 0, "See you there! RT @ColleenRedingto: Convergence news - great! http://t.co/d8kPtzRyWk\n #MSDynAX #AX2012 #CONV14": 0, "Intel's Plight: Are There Any Positives? http://t.co/M0OAliPmqC $INTC, $AAPL, $CSCO, $MSFT, $NVDA, $QCOM": 0, "Working on a Seeking Alpha article based off recent news on Microsoft. Things looking even better in Redmond.\r#seekingalpha #MSFT #investing": 0, "@malik_msft killin'em!!  #666 #skateboarding http://t.co/f7ggFMrKgX": 0, "gather near to us": 0, "from now on , our trouble will be out of sight": 0, "@justinbieber you were right when you said we werent expecting this. Rollercoaster was just perfect. Cant wait for the movie": 0, "RT @Microsoft: This guy has a day job at Microsoft: http://t.co/qP3Bc1QCdA http://t.co/IjcsLpOk15": 0, "Not happy that I'm being asked to show step by step screenshots of each step of their sign up process.  Doesn't MSFT have tech for this?": 0, "RT @TupacShakurPage: You ain't gotta be in jail to be doin' time..": 0, "Marc Benioff To Steve Ballmer: Yes, You're 'An Emblem Of An Old Era' And It's Time To... http://t.co/6S1vK7NrAx": 0, "RT @Windows: Announcing the Official @Facebook App for #Windows8.1! Get it here: http://t.co/UA5LxPWH5m http://t.co/N4HKG4v1Uu": 0, "Lets go #Cowboys": 0, "RT @martenmickos: Must bug VMware, Red Hat and IBM that Forrester sees HP, Cisco &amp; MSFT as private cloud leaders http://t.co/TCgctQEKF3": 0}