{"Seamless Wi-Fi offload at the device/chipset level by Qualcomm - very good paper and excellent insight. http://t.co/wK4oeKgaSj": 0, "everyone is gonna be at QUALCOMM watching our boys play CIF FINALS #gobucs ": 0, "Qualcomm kicks off pre-orders for its Toq smartwatch\n\nhttp://t.co/U9ssO0DlH9 http://t.co/5DBg3uRTAC": 0, "Qualcomm Is Now More Valuable Than Intel http://t.co/AadYdwVMhI": 0, "MBHS wins at RBV 56-49, headed to the Finals at Qualcomm on Monday at 11 am.  Go BUCS!": 0, "Proud to be a BUCS!!! In FINALS, GOING TO QUALCOMM!!!!!  great  job today baby!! http://t.co/Ok0YLv6Vgp": 0, "Rosner: $QCOM Overall Average: 96% Buy. $CSCO $BIOS $EA Q http://t.co/Ji2sRSjGVC": 0, "RT @Tejizlyke: #ICYMI \"Qualcomm Toq Smartwatch hits Cyber Monday\"  http://t.co/UvkiNgMnTP": 0, "\"HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones\" http://t.co/nlqwVgZWAq": 0, "cuz like everyone is saying they are going to qualcomm": 0, "San Diego has been kind to Bengals' Dalton: CINCINNATI -- Andy Dalton has played inside Qualcomm Stadium four ... http://t.co/zROmPMn75s": 0, "\"@Ssv971: I say we all ditch on monday and go watch mission bay ein CIF'S on monday at 9:00 in qualcomm\" AGREE": 0, "Qualcomm faces antitrust probe in": 0, "Googlicious - Qualcomm's Toq smartwatch will last for days: http://t.co/2fuW5zofdo\nThe Toq looks to get b... http://t.co/Iig5MT3QiL": 0, "RT @ARMEmbedded: #Qubi is a @Qualcomm #Snapdragon600 powered @Android TV box: http://t.co/rdQr6m15Ih via @liliputing #ARM": 0, "RT @elvisestrada23: CIF DIVISION II FINAL, Monday at 11 in Qualcomm Stadium #BucPride": 0, "RT @ankitv: If you've always wondered what is the difference between Mediatek and Qualcomm Quad-core Processors, here's the... http://t.co/": 0, "http://t.co/Gtos6BpwOH HTC abandons Qualcomm in favor of Ericsson chip? - Evertiq.se http://t.co/AYrVNQbtKJ": 0, "Sounds to me like we're going to Qualcomm! and Monday will be a minimum day! ": 0, "The best time of the year is going to Qualcomm and watching the Chargers even if they win or lose": 0, "Trade war of mobiles: Qualcomm faces Chinese investigations @caixin": 0, "Qualcomm - Big AR developer at AR Meet Up http://t.co/G8qon2cAZl": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones - Android Headlines - Android News http://t.co/v4I4KsrZ7k": 0, "St. Augustine make statement in win over Imperial and now they're headed to Qualcomm.\n\nHere's a complete recap of... http://t.co/29s3Lr6Br8": 0, "Qualcomm Stadium here we come!  Good job boys  #28-14": 0, "Qualcomm faces antitrust probe in China http://t.co/ZdPQuHVTSf": 0, "Qualcomm faces antitrust probe in - Chinese regulators have launched an": 0, "Regulators in China Investigating Qualcomm http://t.co/kTzjqYSW4N via @techland": 0, "RT @CherieBlairFndn: Excited to be at #CGI2013 alongside so many of our partners including @Ooredoo @Qualcomm_GA @XOMFoundation @StateDept ": 0, "@NickLachey let's get kicked out of Qualcomm Sunday. #whodey": 0, "#Qualcomm Is Now More Valuable Than #Intel: http://t.co/Ub5UYV9OtX via @themotleyfool #intc": 0, "I had a dream that Kendall and Kylie Jenner were my best friends andwe played ina pool in the middle of Qualcomm andthe stands cheered us on": 0, "http://t.co/gAilhZ0ZDL - Qualcomm under ...  via @Easy_Branches #EasyBranches #SEO #Hosting #WebDesign #Marketing #DomainNames": 0, "Well I agreed to do it if the boys went to Qualcomm so ": 0, "Qualcomm stadium swap meet now til 10 pm !! http://t.co/aeF7uoYQAQ": 0, "Qualcomm's Mirasol smartwatch display debuts in Appscomm Fashioncomm A1 http://t.co/j4cPmkfhVE": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones: HTC has used Qualcomm processors in thei... http://t.co/9qtXYkYtHH": 0, "$SOHU - Weibo: Qualcomm, Sohu Launch Counteroffensives -&gt; http://t.co/z85MnD48CT #stock #stocks #SOHU": 0, "Wireless charging war gets more interesting, as Qualcomm joins Qi http://t.co/uNyeUSgAJD": 0, "My mom better let me go to the game on Monday. I mean come on it's at Qualcomm.": 0, "RT @Janaelolo: Congratulations boys! Im so happy for everyone on the football team, and I can't wait to see you guys crush it at Qualcomm! ": 0, "Congratulations boys! Im so happy for everyone on the football team, and I can't wait to see you guys crush it at Qualcomm! #BUCNATION": 0, "@DetroitBORG do you think we will see #4K smartphones in the near future? #qualcomm #snapdragon http://t.co/Li4S2cFCZG": 0, "HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourcing | Unwired Viehttp://t.co/3OhZZP7Ljy": 0, "China's anti-trust Qualcomm probe may be aimed at 4G royalties http://t.co/4ebDevJbs0 http://t.co/Mhvf6Zw2jv": 0, "Qualcomm Says China Is Investigating Whether Firm Broke Its Anti-Monopoly Law http://t.co/b7YodmpCNU": 0, "All games on Monday will be at Qualcomm Stadium. Looking forward to it!": 0, "Who are the eagles playing against at Qualcomm?": 0, "@jorge_thouu: everyone is gonna be at QUALCOMM watching our boys play CIF FINALS #gobucs ": 0, "Qualcomm kicks off pre-orders for its Toq smartwatch: Qualcomm quietly announced its Toq smartwatch during the... http://t.co/4G3KtFCmx2": 0, "I'm so speechless. Mission Bay are going to Qualcomm. SO FREAKING PROUD.": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/xMj4IdWNv9": 0, "New Faultline available:  Hellboy explains how Qualcomm plans to exorcise the demons of WiFi; Pentagon deal gives ovhttp://t.co/ZLaPFbZEA9": 0, "RT @MHHSCounseling: Dismissal Mon. 12/2,12:20pm for Championship Football Game at Qualcomm Stadium. Ticket prices: $10 for students $15 for": 0, "RT @thesillywillie: Looks like I know where I'm gonna be Monday at 2. Qualcomm!!! Go Eagles!": 0, "RT @ElCidSports: Cathedral in victory formation, we'll see you all at Qualcomm": 0, "Qualcomm's Mirasol smartwatch display debuts in Appscomm Fashioncomm A1\n\nhttp://t.co/R5xXDu17Y9": 0, "My school football team won their game  WE'RE GOING TO QUALCOMM STADIUM!!!!!": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones - Android Headlines - Android News http://t.co/Fs5flwxHSR #India #News": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/z2OvB2Gm7H": 0, "RT @BoyensJC: San Pasqual 45y TD run, extends lead over Carlsbad to 28-7, :53 3q. Game, set, Qualcomm. #pprchat": 0, "RT @anuheachen: WE'RE GOING TO QUALCOMM ": 0, "San Pasqual is headed to Qualcomm for the Division 1 CIF Championship game! One of the teams biggest inspirations... http://t.co/dgQymTH2xC": 0, "RT @Informatm: 4G: Qualcomm unveils LTE Advanced in unlicensed spectrum, a radical move that could upend carrier Wi-Fi http://t.co/H9Xt8WFl": 0, "HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourci (Stasys... http://t.co/mN0aZjuNRT": 0, "Don't worry about a lost mobile again. Set up #Android Device Manager to remote lock &amp; wipe http://t.co/wj4okb5DUd via @androidcentral": 0, "now all there's left to do is hope San Pasqual gets there asses handed to them at Qualcomm #bleedpurple": 0, "* Chinese regulator not saying why Qualcomm being": 0, "Rosner: Stock Info: $QCOM Overall Average: 96% Buy. $CSCO $BIOS $EA Q http://t.co/7Hb01E5dMj": 0, "RT @GStyleMagazine: @Qualcomm @Snapdragon chips are running throughout our Top Tablets Holiday Gift Guide this year. Can you name them? htt": 0, "Qualcomm - Big AR developer at AR Meet Up http://t.co/iQi9KU0SGP": 0, "@htc moving away from @qualcomm chips to reduce smartphones prices and increase their sale #android": 0, "WE'RE GOING TO QUALCOMM ": 0, "Qualcomm here we come": 0, "I am sooo excited!! Can't wait for minimum day Monday! I better find a way to get to Qualcomm to support my Golden Eagles!!": 0, "My brother is playing at Qualcomm Stadium for the CIF championship football game. I am too incredibly proud of him and his team#totheQ": 0, "RT @joshua_olivos: Since Ix3 lost, it looks like st Augustine is playing the @chargers at Qualcomm": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/DxluBnDmMZ": 0, "Qualcomm Enliven The Smart Watches War http://t.co/vzXJvwZO9a": 0, "HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourcing http://t.co/FRVFvafFpx": 0, "RT @UTpreps: St. Augustine make statement in win over Imperial and now they're headed to Qualcomm.\n\nHere's a complete recap of... http://t.": 0, "And we're off to Qualcomm! Way to go Dons": 0, "RT @bylindsayhjones: Chargers announce Sunday's game against Cincy at Qualcomm is blacked out. The first blackout of the season.": 0, "see ya at Qualcomm dons @ Ramona High School http://t.co/gjGT1vGka6": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/hOrREMDqHW": 0, "Any Qualcomm experts who can answer my question? http://t.co/PopWXx3dLl /cc:@bphreaks": 0, "Is @Qualcomm being overlooked by investors because it's misunderstood? http://t.co/ZynlAT5b3S": 0, "HTC opts for Spreadtrum, Broadcom, ST_Ericsson chips, not Qualcomm for new Desires. Starts outsourcing: http://t.co/xefWRiX3kI": 0, "@Qualcomm SmartWatch It Is!!!\nhttp://t.co/NyJem8svj4": 0, "RT @jorge_thouu: everyone is gonna be at QUALCOMM watching our boys play CIF FINALS #gobucs ": 0, "RT @UTpreps: San Pasqual is headed to Qualcomm for the Division 1 CIF Championship game! One of the teams biggest inspirations... http://t.": 0, "@AdamPsilocybin every Wednesday and Saturday. And it's at Qualcomm, a short bus and trolley ride from PH": 0, "Qualcomm Toq smartwatch ready for pre-order http://t.co/h3Aj0qkgCY http://t.co/lVzKUksZ3c": 0, "Qualcomm tackling faster LTE, but how fast is up for debate": 0, "Sesame Street Augmented Reality by Qualcomm at CES 2012 http://t.co/U42sy6oLNf\n #Childrens #Demos #Education #Entertainment #Games #Toys": 0, "#China: #Qualcomm and #Samsung integrate #BeiDou in #smartphones http://t.co/sN2VjXVfgC": 0, "@hfiguiere install battery guru by Qualcomm - you'll see a big difference": 0, "So proud of the Fighting Eagles! Qualcomm here we come.": 0, "RT @missionbayhigh: MBHS wins at RBV 56-49, headed to the Finals at Qualcomm on Monday at 11 am.  Go BUCS!": 0, "Qualcomm's Revenue Up 33 Per cent In Fourth Quarter : http://t.co/pAgrbwuTOm": 0, "After last week? RT @bylindsayhjones: Chargers announce Sunday's game against Cincy at Qualcomm is blacked out.": 0, "RT @thatkidwes24: We'll see you at Qualcomm": 0, "SPs going to Qualcomm ": 0, "@GautamPW @amitabhishek lol UI. Who in their right minds would run stock anyway. AOSP all the way. Qualcomm, and N5 based so no major issues": 0, "@Qualcomm Make Ur Life Easy in USA with free App,check App rate in google play store,type Lifelongapp,(No space). http://t.co/AD4MNK9SgX": 0, "@Qualcomm hi, is there any Lumia coming with Snapdragon 805 &amp; GP Camera @ MWC 2014? So Curious about it. \rRegards, \rJuned Malek": 0, "RT @BigDumbKyle: Man I love this kid.We're going to Qualcomm! jdog8794! See you there! http://t.co/O1rvkp5Zgc": 0, "So proud of the boys ! Qualcomm here we come ": 0, "San Diego has been kind to Bengals Dalton http://t.co/V59a64Ezyw CINCINNATI  Andy Dalton has played inside Qualcomm Stadium four time...": 0, "Good luck to all the teams looking towards playing at Qualcomm next week. There's no better way to end your season than with a championship!": 0, "RT @sharpneli: @JollaHQ First Jolla phone ever running #OpenCL trough hybris layer! VERSION: OpenCL 1.1 QUALCOMM build:  (CL2961769) #Jolla": 0, "#China Chases #Qualcomm On Prices, Security http://t.co/fdDCWWeNbr": 0, "@EricStangel when's the next time you're going to Qualcomm?": 0, "Final score, San Pasqual 28, Carlsbad 14. Eagles to Qualcomm, will face winner of Cathedral vs. Ramona. #pprchat": 0, "BBC News - Qualcomm faces China antitrust probe http://t.co/04zAloaz2r": 0, "SAN FRANCISCO (Reuters) - Qualcomm Inc CEO Paul Jacobs promised on Wednesday to return 75 percent of free cash flow to shareholders through": 0, "China Launches Anti-Monopoly Probe of Qualcomm | Fox Business http://t.co/8pkLsQHVc5": 0, "HTC opts for Spreadtrum, Broadcom, ST_Ericsson chips, not Qualcomm for new Desires. Starts outsourcing http://t.co/25GiNAndIa": 0, "RT @sanjaybafna: #Tech : HTC Moving Away from #Qualcomm Chips to Reduce Smartphone Costs. |  What about quality ?": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/OsMFZrdpjK via @cellularnews": 0, "Bare metal PC/laptop with AMD/Intel CPU and Linux. Bare metal switch with Broadcom/Intel and Linux. Bare metal phones with Qualcomm/Intel...": 0, "@_aaliyahjordan oh yeah! Haha sorry but idk if CIF would rent Qualcomm for any thing else then the championship": 0, "RT @ChinaInSpace: Qualcomm enhances positioning system by including China's Beidou http://t.co/pO63dS390V": 0, "Qualcomm bound ": 0, "Qualcomm Toq smartwatch now available for pre-order, $349.99 price tag - http://t.co/4s2WGxxwLq http://t.co/tAfKxojYuB": 0, "RT @Chaaaaduhhh: So proud my alma mater is headed to the CIF division 1 finals at Qualcomm Stadium! #fightingeagles #fighton": 0, "I'm thankful for Qualcomm - Matt Harvey": 0, "HTC opts for Spreadtrum, Broadcom, ST_Ericsson chips, not Qualcomm for new Desires. Starts outsourcing http://t.co/ySLiN0zPBf": 0, "RT @technobaboy: In case you missed it: Qualcomm Toq Smartwatch Available on December 2, Priced at $350 http://t.co/0SYqQ3LXAq\n #tech #gadg": 0, "RT @cellularnews: HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/UcR5iR41sR": 0, "Qualcomm's Buttonless Toq Smartwatch Slated for Dec. 2 Debut... http://t.co/JmfJ3AzdPi http://t.co/ES10Rwz5hu": 0, "RT @mobileworldlive: Info from @Qualcomm on their Chinese licensing deals as they face investigation by local antitrust authorities: http:/": 0, "@designboom @mellis @bruces If it doesn't have GPS or Qualcomm inside it may corner the underground market.": 0, "RT @cladejarehout: SPs going to Qualcomm ": 0, "RT @shahamit99: HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourcing http://t.co/FRVFvafF": 0, "Flyin high!  Could not be more proud! #amazinggame #bestgame #CIFBound #CIF #crazy #fightingeagles #HellYeah #offtotheQ #qualcomm": 0, "RT @saammm___: Mb going to Qualcomm stadium for the CIF finals ahhhhhhh ": 0, "RT @angileekabroom: Qualcomm here we come! #blueandgold": 0, "RT @ITProPortal: Qualcomm under investigation by Chinese regulators: Qualcomm, one of the world's largest... http://t.co/rzb6R2G3Gm #tech": 0, "EH-Net Job Alert: #Security #Engineering Careers @Qualcomm - Greater San Diego Area #jobs http://t.co/7601sInuiG #software #hardware #code": 0, "android multi tools for reset spreadtrum &amp; Qualcomm http://t.co/RmvloZvbsX": 0, "http://t.co/jIBDCBkxru Qualcomm Sees Impact in China": 0, "Buzz for Qualcomm Stadium: http://t.co/LVf6NF8wQE - RT @drjeffdaly San Diego turkey kicked out of Qualcomm Stadium because he tryptophan...": 0, "RT @SDPreps: All games on Monday will be at Qualcomm Stadium. Looking forward to it!": 0, "Weibo: Qualcomm, Sohu Launch Counteroffensives: By Doug Young:Top officials from leading cellphone chip maker ... http://t.co/eZz5PiwS7A": 0, "Windows Phone 9 in testing with Nokia, HTC and Qualcomm hardware  http://t.co/vVjzMD77tl via @wpcentral": 0, "#jobs4u #jobs #sfbay Digital Design Careers @ Qualcomm http://t.co/PkiLfrT2Ui #SJ #sanjose #CA": 0, "Weibo: Qualcomm, Sohu Launch Counteroffensives http://t.co/yvhyW5vV9z $SOHU $QCOM": 0, "RT @techshout: Qualcomm reveals Snapdragon 805, the Ultra HD processor with Adreno 420 graphics http://t.co/1ZDhUkbAxN": 0, "@MikeAndrade85 @PeterRicardez21 @BigDumbKyle @Coop_Lion_ #stadiumbound #qualcomm Proud of you guys! Wish I was there!": 0, "Vista Equity Partners Takes Over Qualcomm Subsidiary Omnitracs. Inc. - complete story on http://t.co/JehNHwKYUt": 0, "RT @Qualcomm: The #QualcommForce is strong with your tweets. RT &amp; we'll donate $1 to @MakeAWish, up to $10k! http://t.co/G5ESR4w9RH #Course": 0, "We're going to Qualcomm!! Roll Dons!!! http://t.co/PI4xbVGd2B": 0, "it's actually really sick that were playing at qualcomm": 0, "Great job Bucs!!! Qualcomm bound": 0, "Qcomm worth more than Intel!  http://t.co/l48DC9pTVG": 0, "Info from @Qualcomm on their Chinese licensing deals as they face investigation by local antitrust authorities: http://t.co/sIX12IkZ9K": 0, "In case you missed it: Qualcomm Toq Smartwatch Available on December 2, Priced at $350 http://t.co/0SYqQ3LXAq\n #tech #gadgets": 0, "On 4th and one from the six, Carlsbad pass falls incomplete. 3:42 in 4th, San Pasqual leading 28-14 and marking time to Qualcomm. #pprchat": 0, "China Launches Antitrust Investigation Against Qualcomm - Electronics360 http://t.co/pxWdwibEsR": 0, "Good luck to SPHS football against Carlsbad tonight!  Hope the Golden Eagles get to play at Qualcomm next week!": 0, "@MattHarvey33 @dpshow @Qualcomm lol... man i forgot about this": 0, "If Carlsbad wins this game they are going to the championship at Qualcomm!": 0, "Qualcomm here we come! #blueandgold": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/wwqoBjsxYn": 0, "Man I love this kid.We're going to Qualcomm! jdog8794! See you there! http://t.co/O1rvkp5Zgc": 0, "RT @BoyensJC: Final score, San Pasqual 28, Carlsbad 14. Eagles to Qualcomm, will face winner of Cathedral vs. Ramona. #pprchat": 0, "RT @_SpazzyJazzy: I am sooo excited!! Can't wait for minimum day Monday! I better find a way to get to Qualcomm to support my Golden Eagles": 0, "RT @tonicofdday: Qualcomm's Toq smartwatch debuts as Appscomm Fashioncomm A1 | Tonic Of D Day: http://t.co/2gNHDReLvJ": 0, "San Diego has been kind to Bengals' Dalton: CINCINNATI -- Andy Dalton has played inside Qualcomm Stadium four times... #sports #sportsnews": 0, "We're heading to Qualcomm!!!": 0, "Qualcomm Toq: A Better Smartwatch for Business? | @scoopit http://t.co/mDEYPcBCyO": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones - Android Headlines - Android News http://t.co/xNywPjjdML": 0, "RT @asadotzler: Firefox OS on Intel hardware side by side with Qualcomm hardware. Cool. http://t.co/MZN9YZNdg7 #FirefoxOS": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/UcR5iR41sR": 0, "Appscomm Fashioncomm A1, un \"watchphone\" que hereda del Qualcomm Toq http://t.co/5HJfp2k2O5": 0, "Corruption for framebuffers above 256x256. glClear(0), which should do exactly nothing, fixes it. Thanks, Qualcomm. http://t.co/d5iUkGtFjk": 0, "YEAH, DONS!!  Qualcomm, here we come!!!! #DONS": 0, "Qualcomm Steps Up Attack on Internet of Things -  By Don Clark CONNECT... http://t.co/mAONj7HGZU\n #AmirFaintuch #QualcommAtheros #WiFi": 0, "RT @alondraD721: cuz like everyone is saying they are going to qualcomm": 0, "RT @BoyensJC: On 4th and one from the six, Carlsbad pass falls incomplete. 3:42 in 4th, San Pasqual leading 28-14 and marking time to Qualc": 0, "Qualcomm Steps Up Attack on Internet of Things -  By Don Clark CONNECT... http://t.co/klmvFgjklC\n #AmirFaintuch #NewYorkWednesday #WiFi": 0, "Mission Bay vs. Saints Monday at 11 a.m. At Qualcomm Stadium, BE THERE!!": 0, "Qualcomm Is Now More Valuable Than Intel: http://t.co/7JndhhEKzO via @themotleyfool": 0, "RT @WaterSoftenerO: Qualcomm tackling faster LTE, but how fast is up for debate": 0, "Qualcomm Collaborate  and Youku Tudou Supply Best Quality Video: Qualcomm Collaborate  and Youku Tudou Supply ... http://t.co/XXBmlPW1b7": 0, "List of 53 recent Qualcomm patents - http://t.co/XMwNmmjP3Z": 0, "Qualcomm enhances positioning system by including China's Beidou http://t.co/pO63dS390V": 0, "So happy I was able to make it to the game tonight bucs are gonna kill it at Qualcomm ": 0, "WE FUCKEN WON!!! so mad I couldn't go tonight. Here we come Qualcomm": 0, "Qualcomm unveils Snapdragon 805 processor with 'Ultra HD' mobile video http://t.co/rAFZ7N0MLn": 0, "@Rooski13 I was thinking frys by Qualcomm": 0, "@fivebums sigh i just want to go to qualcomm and make them have the boys there omfg": 0, "RT @QualcommToq: December 2 we ship. Today, you can pre-order! Visit http://t.co/zK5toWXb4C to order your #Toq #smartwatch. http://t.co/O5l": 0, "RT @geoffstead: Insider tip: making the world smaller with Virtual Photo Booth at #qualcomm #mlearn http://t.co/WMNzMxKkVC": 0, "The Division II CIF Final game Saints vs. Mission Bay at 11am at Qualcomm Monday 12/2/13 #GoSaints!": 0, "Thought my phone was using an inferior chipset. That happy moment when u find out it's Qualcomm Snapdragon. TSM! http://t.co/LdWzke1O0I": 0, "San Pasqual 45y TD run, extends lead over Carlsbad to 28-7, :53 3q. Game, set, Qualcomm. #pprchat": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/EVPvv2r0hl": 0, "see you at qualcomm": 0, "HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourci (Stasys... http://t.co/DxDPiQCl3S": 0, "RT @SPHSseniors2k14: see you at qualcomm": 0, "#qualcomm atheros ar9285 driver http://t.co/iqukcPgIbA": 0, "Mission Bay vs. St. Augustine for CIF Monday at Qualcomm #BUCS #BucMob": 0, "Good job last night eagles for whooping Carlsbad ass 28-14. See you guys at Qualcomm.": 0, "Buy - Qualcomm - QCOM - U.S Stock - NASDAQ 100 - SUCCESSFUL on 5 March 2013 (COMPLETED) http://t.co/NpnFDRoR9O": 0, "Children in #Chennai visit #Qualcomm to learn about circuits , mobile phones and processor chips. #MakeADifference http://t.co/d1HJvV3GH7": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/zaXS61ZB4X": 0, "Enter the #SnapDragon @Qualcomm http://t.co/zH6aHfA8Mt": 0, "Qualcomm with @YourQueenLexi hopefully that will take my mind off of things": 0, "http://t.co/oGO9Rwe93q China's antitrust watchdog sets sights on Qualcomm": 0, "Mb going to Qualcomm stadium for the CIF finals ahhhhhhh ": 0, "Next game Monday at 9 at Qualcomm  #BUCS": 0, "Qualcomm #chipset http://t.co/CE5YaXNNz7": 0, "@cromaretail #CromaAwards 1020 hs snapdragon qualcomm 1.5Ghz processor which is faster thany many octacore processors coz of its architctre": 0, "Full HD 6.4\" with a Qualcomm Snapdragon 800 quad-core processor. Xperia Z Ultra LTE is bringing you one of the... http://t.co/LIyltBQ2XO": 0, "Qualcomm Sees Much Broader Future for #LTE -  By Don Clark CONNECT... http://t.co/pJUPKWbG7g\n #MoorInsightsStrategy #PatrickMoorhead #WiFi": 0, "Views under the Palm | http://t.co/j3xBU506b3: Qualcomm CEO Says NSA Fallout Impacting Its Business http://t.co/srzXu05EpO": 0, "Chargers announce Sunday's game against Cincy at Qualcomm is blacked out. The first blackout of the season.": 0, "RT @MaximMag: For every cell phone run by @Qualcomm @Snapdragon, there's a similar, but even more beautiful Maxim model. http://t.co/nUxKRf": 0, "RT @Heathcliff74XDA: Any Qualcomm experts who can answer my question? http://t.co/PopWXx3dLl /cc:@bphreaks": 0, "Full HD 6.4\" with a Qualcomm Snapdragon 800 quad-core processor. Xperia Z Ultra LTE is bringing you one of the... http://t.co/1QJxkuqZvb": 0, "Insider tip: making the world smaller with Virtual Photo Booth at #qualcomm #mlearn http://t.co/WMNzMxKkVC": 0, "4G: Qualcomm unveils LTE Advanced in unlicensed spectrum, a radical move that could upend carrier Wi-Fi http://t.co/7lMDxq4lN4": 0, "RT @MallieSaidWhut_: \"@Ssv971: I say we all ditch on monday and go watch mission bay ein CIF'S on monday at 9:00 in qualcomm\" AGREE": 0, "I say we all ditch on monday and go watch mission bay ein CIF'S on monday at 9:00 in qualcomm": 0, "LG Launches Firefox OS-Powered Fireweb Smartphone http://t.co/WyFdznzSQe #lg #firefox #firefoxOS #fireweb #smartphone #mozilla #qualcomm RT": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/b2gEwm9Emt http://t.co/yCJ3OYBTPI": 0, "RT @GabyGoesRAWR1: Anyone know how to sign up for busses to take us to Qualcomm ?": 0, "Since Ix3 lost, it looks like st Augustine is playing the @chargers at Qualcomm": 0, "RT @sezertenkolu: #qualcomm atheros ar9285 driver http://t.co/iqukcPgIbA": 0, "RT @BriBeckett2: So happy I was able to make it to the game tonight bucs are gonna kill it at Qualcomm ": 0, "Sanyo SCP-3100 Sprint Qualcomm 3G CDMA CELL PHONE MOCHA SPEAKER CAMERA: $26.00 End Date: Saturday Dec-28-2013... http://t.co/jm3akaOG0j": 0, "RT @Androidheadline: HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/tOQ50fwC81 #AndroidManufacturerNews #": 0, "WE WON 28-14!!!!!!!! GOOD JOB BOYS!!!!!! QUALCOMM ON MONDAY!!!!  #sppride #eagles": 0, "Who's going to Qualcomm Monday???": 0, "I'M GOING TO SEE THE BENGALS PLAY THE CHARGERS AT THE QUALCOMM STADIUM SUNDAY!!!!!\n": 0, "I hope imperials wins so that they can play against the @chargers at Qualcomm": 0, "Hands-on with the Qualcomm Snapdragon S4 Pro (APQ8064) mobile development platform: http://t.co/Jz3PqD8sjl via @YouTube": 0, "RT @theblaxican85: Mission Bay vs. Saints Monday at 11 a.m. At Qualcomm Stadium, BE THERE!!": 0, "Goin to Qualcomm!! Heck yea!! http://t.co/q7rhCBcelq": 0, "RT @noahnewts: catch your eagles turning up at qualcomm on monday!": 0, "Qualcomm: Cometh The Reaper? http://t.co/cMQoTBcYqI $QCOM": 0, "RT @clodoggg: *We welcome San Pasqual to Qualcomm Stadium on 12/2* ": 0, "We imagined what a World Without Mobile would look like. http://t.co/178ykhvRHy via @Qualcomm": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones\nhttp://t.co/r3naH11ndc": 0, "Qualcomm faces probe in China ahead of LTE service launch http://t.co/338BnAzJg5": 0, "So uh, minimum day on Monday along with Qualcomm ?": 0, "RT @saints_info: The Division II CIF Final game Saints vs. Mission Bay at 11am at Qualcomm Monday 12/2/13 #GoSaints!": 0, "RT @macmathunat: Nice to see @Qualcomm Toq offers practicality first with wireless charging and Mirasol. http://t.co/upvcL54DvP #wearables ": 0, "Heading to Qualcomm swapmeet with the fam bam straight out #Mexican here. Hahaha": 0, "Qualcomms Virtual Photobooth App - An augmented reality based mobile app, more info via @WorkLearnMobile - http://t.co/5rug2eSWPF": 0, "RT @CNET: Qualcomm kicks off pre-orders for its Toq smartwatch http://t.co/l8k0XXFQ6v": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/nxWKsIc33p": 0, "So proud my alma mater is headed to the CIF division 1 finals at Qualcomm Stadium! #fightingeagles #fighton": 0, "Soo happy we won!:) \nGo SPHS Football Team \n#QUALCOMM": 0, "$QCOM - Weibo: Qualcomm, Sohu Launch Counteroffensives -&gt; http://t.co/dCfVzmfnKE #stock #stocks #QCOM": 0, "RT @MirandaLotze: We're heading to Qualcomm!!!": 0, "RT @itsLiyahhhh: Qualcomm here we come ": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/conJQHqfJw": 0, "cellular-news: HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/Yxqs1eeBSX": 0, "The mobile revolution, qualcomm and apple RT @dlacalle: Dotcom bubble???? http://t.co/CPhjL1PTx6": 0, "RT @unwiredtweets: HTC opts for Spreadtrum, Broadcom, ST_Ericsson chips, not Qualcomm for new Desires. Starts outsourcing: http://t.co/xefW": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones: HTC has used Qualcomm processors in thei... http://t.co/mqihaE9UmF": 0, "RT @JennyTh0: Next game Monday at 9 at Qualcomm  #BUCS": 0, "Check out Qualcomm Stadium: http://t.co/zgPwDdI8xG - RT @SDPreps All games on Monday will be at Qualcomm Stadium. Looking forward to it!": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs: Taiwan's HTC is looking to broaden its semicon... http://t.co/lOTP1pyy0j": 0, "42-0 SAINTS I THINK WERE GOING TO QUALCOMM": 0, "New post: China Targets Qualcomm With Antitrust Probe (http://t.co/lHOp1jweYB)": 0, "@Nesteezy_ right by Qualcomm??": 0, "BBC News - Qualcomm faces China antitrust probe http://t.co/iu2O7jtm2W": 0, "Qualcomm here we come ": 0, "@Toppelicom It is Qualcomm Dual Core 1.4GHz, maybe the specs have changed later.": 0, "Photo: Qualcomm Enliven The Smart Watches War Qualcomm officially enliven the smart watches markets. The... http://t.co/AmcrEXJXRw": 0, "Looks like I know where I'm gonna be Monday at 2. Qualcomm!!! Go Eagles!": 0, "catch your eagles turning up at qualcomm on monday!": 0, "RT @AbandonedPics: The old Padres dugout at Qualcomm Stadium in San Diego. Now buried under seats. http://t.co/5QgOzlz0Uc": 0, "\"@JennyTh0: Next game Monday at 9 at Qualcomm  #BUCS\"": 0, "#technology #news HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones - Android Headlines -... http://t.co/GCePy9rDUG": 0, "Rosner: $QCOM Overall Average: 96% Buy. $CSCO $BIOS $EA Q http://t.co/IBjvphMcKJ": 0, "When does mission bay play at Qualcomm ? &amp; how much ?": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/rit2TE5SXA #android": 0, "Oh yeah baby San Pasqaul won now to big Qualcomm!!!!!!! @KUSIPPR http://t.co/t28iNWd4qf": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs: Taiwan's HTC is looking to broaden its semicon... http://t.co/sBE6x2Mslu": 0, "HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourcing http://t.co/CgTDABdJ0Y": 0, "News India : HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones - Android Headlines - Androi... http://t.co/ouhmjw14WG": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/4rU9EMBgTR": 0, "Toq SmartWatch is up for pre-orders now. Read More at: http://t.co/wMPTx4czmM": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/tOQ50fwC81 #AndroidManufacturerNews #android": 0, "@JackCronin1090 @JTERogan &amp; I are excited &amp; ready 4 championships @ Qualcomm, Monday. Stay tuned for the BEST in HS Football. #HSFBonTWC #SD": 0, "Good job cathedral u won @JESSYCA_CARREON  haha saints is goin down at Qualcomm ": 0, "CIF! QUALCOMM BOUND!": 0, "#Qubi is a @Qualcomm #Snapdragon600 powered @Android TV box: http://t.co/fvW6YzNsXk via @liliputing #ARM": 0, "For every cell phone run by @Qualcomm @Snapdragon, there's a similar, but even more beautiful Maxim model. http://t.co/nUxKRfrVBc": 0, "San Diego turkey kicked out of Qualcomm Stadium because he tryptophan.  #BreakingNews #HappyThanksgiving": 0, "RT @justinm_25: Mission Bay vs. St. Augustine for CIF Monday at Qualcomm #BUCS #BucMob": 0, "HTC Moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/rJsHt33I3o via @cellularnews": 0, "CIF DIVISION II FINAL, Monday at 11 in Qualcomm Stadium #BucPride": 0, "USED QUALCOMM GLOBALSTAR GSP-1600 TRI-MODE PORTABLE  SATELLITE PHONE (Head only) $99.99 http://t.co/KriaTWbsQA #goods #Camping": 0, "Qualcomm Toq smartwatch launches December 2 for $350  http://t.co/HhDwFh4yxL #android": 0, "HTC opts for Spreadtrum, Broadcom, ST_Ericsson chips, not Qualcomm for new Desires. Starts... http://t.co/yfQ8VpdOoi": 0, "HTC opts for Spreadtrum, Broadcom, ST-Ericsson chips, not Qualcomm for new Desires. Starts outsourcing: To low... http://t.co/EOEL7W4r1e": 0, "The Estonian cryptography startup that wants to be the Qualcomm of data security | ZDNet http://t.co/m4ZHB5zaCa": 0, "Qualcomm Is Now More Valuable Than Intel http://t.co/fLTpCGxIEM": 0, "Here's to not going to school on Monday and only going to training Qualcomm here we come": 0, "android multi tools for reset spreadtrum &amp; Qualcomm http://t.co/r6v2CPNSt1": 0, "android multi tools for reset spreadtrum &amp; Qualcomm http://t.co/lgKvVqeiSP": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/WStKuEu6cf &lt;&lt;READ FULL STORY": 0, "@TimoPesonen Yes, Jolla have Qualcomm MSM8930 with 1,4Ghz.": 0, "Healthcare in the Palm of Your Hand - Qualcomm Tricorder X PRIZE - pretty cool concept http://t.co/rYd4uvTMCq": 0, "RT @SonyXperiaMY: Full HD 6.4\" with a Qualcomm Snapdragon 800 quad-core processor. Xperia Z Ultra LTE is bringing you one of the... http://": 0, "My first cellphone was ah qualcomm...": 0, "The timing of the inquiry has led some to Sinosphere Blog Qualcomm Faces Antitrust": 0, "Welcome Nightswappers!! We are having a great time over here at the Qualcomm Stadium Swap Meet! It's a http://t.co/YrERKggOtc": 0, "Right on time, Qualcomm opens pre-orders for its Toq smartwatch http://t.co/h5GwLraCYX": 0, "@Qualcomm @Snapdragon chips are running throughout our Top Tablets Holiday Gift Guide this year. Can you name them? http://t.co/kX2F2yGgE2": 0, "Qualcomm faces antitrust probe in China http://t.co/mCk79rj1P6 WCTB": 0, "@JollaHQ First Jolla phone ever running #OpenCL trough hybris layer! VERSION: OpenCL 1.1 QUALCOMM build:  (CL2961769) #Jolla": 0, "RT @Ssv971: I say we all ditch on monday and go watch mission bay ein CIF'S on monday at 9:00 in qualcomm": 0, "QUALCOMM HERE WE COME SAINTS": 0, "@bylindsayhjones: Chargers announce Sunday's game against Cincy at Qualcomm is blacked out. The first blackout of the season. Lolz": 0, "Nice to see @Qualcomm Toq offers practicality first with wireless charging and Mirasol. http://t.co/upvcL54DvP #wearables #notjustmarketing": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/N33a0u1FfM": 0, "RT @TheKidAPW: CIF! QUALCOMM BOUND!": 0, "San Diego has been kind to Bengals' Dalton: CINCINNATI -- Andy Dalton has played inside Qualcomm Stadium four... http://t.co/efdxzYc7ZV": 0, "#Tech : HTC Moving Away from #Qualcomm Chips to Reduce Smartphone Costs. |  What about quality ?": 0, "San Diego has been kind to Bengals' Dalton: CINCINNATI -- Andy Dalton has played inside Qualcomm Stadiu... http://t.co/4dtqB6NVOS - #nfl": 0, "the turn up will be real at Qualcomm": 0, "China Targets Qualcomm With Antitrust Probe http://t.co/457FuE6NtB": 0, "RT @Naphtal: HTC moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/llWxovrACH": 0, "RT @DianaC777: Sounds to me like we're going to Qualcomm! and Monday will be a minimum day! ": 0, "The Motley Fool Take: You may not have heard of Qualcomm (Nasdaq: QCOM), but its technology is found inside just... http://t.co/qITkmDZd6R": 0, "http://t.co/NAxRiqJYjj - FIA Formula E, SAE J-2954 Standard Advance Qualcomm's Position in Wireless Charging EVs - @kmak_SA": 0, "@thescottwheeler Scott why don't you talk to me when west hills takes it to Qualcomm ": 0, "HTC moving Away from Qualcomm Chips to Reduce Smartphone Costs http://t.co/llWxovrACH": 0, "@Wlacker Yeah, tbh I'll probably just go with Nexus 5 for the 1080p screen, qualcomm cpu, and 2 gigs of ram. Specs are king.": 0, "This is home, and I'm gunna miss it, but I think Qualcomm should be pretty cool too #toomuchfun http://t.co/3xAYdEINQj": 0, "I really wanna see a game at Qualcomm. Such a great atmosphere.  And i love the chargers": 0, "#tbt #throwbackthursday to my first @chargers game #ATLvsSD #2012 #qualcomm #boltup #boltfam http://t.co/8SVfWFx9gz": 0, "Qualcomm Is Now More Valuable Than Intel: http://t.co/4HDaICrqY6 via @themotleyfool": 0, "Qualcomm Toq: A Better Smartwatch for Business?... http://t.co/mtCsSXzdZA": 0, "RT @joshua_olivos: I hope imperials wins so that they can play against the @chargers at Qualcomm": 0, "RT @kristin82100: Oh yeah baby San Pasqaul won now to big Qualcomm!!!!!!! @KUSIPPR http://t.co/t28iNWd4qf": 0, "then finally they won &amp; it was so satisfying so now they're going to CIF &amp; playing at Qualcomm stadium on monday. I might be too competitive": 0, "Anyone know how to sign up for busses to take us to Qualcomm ?": 0, "NDRC Tells Qualcomm It Faces Antitrust Investigation\nhttp://t.co/f6ht1SW2au": 0, "Qualcomm Is Now More Valuable Than Intel: http://t.co/wgBhb1vFHr via @themotleyfool": 0, "We'll see you at Qualcomm": 0, "Qualcomm here we come.#SanPasqual #FightingEagles #Football": 0, "Right on time, @Qualcomm opens pre-orders for its Toq smartwatch http://t.co/g7Ehqzrcb4 // I'm getting one for sure!": 0, "Does anyone know how much the tix at Qualcomm will cost? Lol": 0, "SPHS goes to championship at Qualcomm stadium Monday!@12:00 http://t.co/qWH2onWY7f": 0, "I believe we are going to Qualcomm": 0, "Cathedral in victory formation, we'll see you all at Qualcomm": 0, "*We welcome San Pasqual to Qualcomm Stadium on 12/2* ": 0, "RT @gpsbusinessnews: Qualcomm Brings BeiDou to GALAXY Note in China http://t.co/8qHGbSUelB": 0, "android multi tools for reset spreadtrum &amp; Qualcomm http://t.co/5Eve79zby6": 0, "RT @cassidyclough: Great job Bucs!!! Qualcomm bound": 0, "Qualcomm TOQ Smartwatch Now Available To Pre-order\n\n~veekei\n\n#qualcomm #toq #smart #watch #preorder http://t.co/FjsWmHF91x": 0, "RT @TheJeremyPires: @MikeAndrade85 @PeterRicardez21 @BigDumbKyle @Coop_Lion_ #stadiumbound #qualcomm Proud of you guys! Wish I was there!": 0, "First time at San Pasqual in 3 years...we feel old but good to be back  #fightingeagles #cif #qualcomm http://t.co/1LmkDJTqyA": 0, "And that's it boys and girls! San Pasqual moves on to the CIF final at Qualcomm! Hell yeah! Proud to be part of this! #football #blessed #ye": 0, "HTC Moves Away from Qualcomm CPUs in New Range of Desire Smartphones http://t.co/EqnyXYNiKi": 0}